QUnit.config.maxDepth = -1;
QUnit.config.noglobals = true;
QUnit.config.seed = true;

import { schema, verbClasses, validVerbClasses, getForms, causativeFormsKey, } from "../lib/ilakkanam.js";

QUnit.module("schema", () => {
    QUnit.test("schema is a tree", t => {
        t.true(schema instanceof Object,);
        t.ok(schema.label,);
        t.strictEqual(typeof schema.label, "string",);
        t.ok(schema.children,);
        t.true(schema.children instanceof Map,);
        schema.children.forEach((v, k,) => {
            t.strictEqual(typeof k, "string",);
            t.strictEqual(typeof v, "object",);
            t.ok(v.label,);
            t.strictEqual(typeof v.label, "string",);
        },);
    },);
},);

QUnit.module("verbClasses", () => {
    QUnit.test("verbClasses is an Array of strings", t => {
        t.true(Array.isArray(verbClasses,),);
        verbClasses.forEach(வினயினத்துப்பெயர் => {
            t.strictEqual(typeof வினயினத்துப்பெயர், "string",);
        },);
    },);
    QUnit.module("validVerbClasses", () => {
        const assertValid = (t, வினயினம்,) => பகுதி => {
            t.true(validVerbClasses(பகுதி,).includes(வினயினம்,),);
        };
        const assertInvalid = (t, வினயினம்,) => பகுதி => {
            t.false(validVerbClasses(பகுதி,).includes(வினயினம்,),);
        };
        QUnit.test("வாங்கு", t => {
            ["ஊது",].forEach(assertValid(t, "வாங்கு",),);
            ["கல்", "கல", "தெரி", "போ",].forEach(assertInvalid(t, "வாங்கு",),);
        },);
        QUnit.test("பார்", t => { t.expect(0,); },); // பார் is always a valid இனம்
        QUnit.test("இரு", t => { t.expect(0,); },); // இரு is always a valid இனம்
        QUnit.test("உயர்", t => {
            ["ஈ", "அணி", "மிகு", "உயர்", "வீழ்", "குலய்", "கல்",].forEach(assertValid(t, "உயர்",),);
            ["கல",].forEach(assertInvalid(t, "உயர்",),);
        },);
        QUnit.test("சொல்", t => {
            ["சொல்",].forEach(assertValid(t, "சொல்",),);
            ["வாங்கு", "போ", "அணி",].forEach(assertInvalid(t, "சொல்",),);
        },);
        QUnit.test("செய்", t => { t.expect(0,); },); // செய் is always a valid இனம்
        QUnit.test("இடு", t => {
            ["போடு", "பெறு",].forEach(assertValid(t, "இடு",),);
            ["பரவு", "உயர்", "விழு", "கடி", "தின்", "உண்",].forEach(assertInvalid(t, "இடு",),);
        },);
        QUnit.test("தகு", t => {
            ["புகு", "மிகு",].forEach(assertValid(t, "தகு",),);
            ["இடு", "விழு", "கடி", "தின்", "பரவு",].forEach(assertInvalid(t, "தகு",),);
        },);
        QUnit.test("வா", t => {
            ["தா",].forEach(assertValid(t, "வா",),);
            ["கல்", "கல", "தெரி", "போ", "வாங்கு", "உயர்",].forEach(assertInvalid(t, "வா",),);
        },);
        QUnit.test("காண்", t => {
            ["காண்",].forEach(assertValid(t, "காண்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "காண்",),);
        },);
        QUnit.test("போது", t => {
            ["போது",].forEach(assertValid(t, "போது",),);
            ["உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "போது",),);
        },);
        QUnit.test("போ", t => {
            ["போ", "ஆ",].forEach(assertValid(t, "போ",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "போ",),);
        },);
        QUnit.test("நோ", t => {
            ["நோ", "வே",].forEach(assertValid(t, "நோ",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா",].forEach(assertInvalid(t, "நோ",),);
        },);
        QUnit.test("சா", t => {
            ["சா",].forEach(assertValid(t, "சா",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "நோ",].forEach(assertInvalid(t, "சா",),);
        },);
        QUnit.test("அல்", t => {
            ["அல்",].forEach(assertValid(t, "அல்",),);
            ["கல்", "கல", "தெரி", "போ",].forEach(assertInvalid(t, "அல்",),);
        },);
        QUnit.test("உள்", t => {
            ["உள்",].forEach(assertValid(t, "உள்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "உள்",),);
        },);
        QUnit.test("இல்", t => {
            ["இல்",].forEach(assertValid(t, "இல்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "இல்",),);
        },);
    },);
},);

QUnit.module("getForms", () => {
    QUnit.module("With unambiguous இனம்", () => {
        QUnit.module("வாங்குவும் போதுவும்", () => {
            QUnit.test("நம்பு", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நம்பி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["நம்பிய", "நம்பின",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பினோம்", "நம்பினம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பினீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்பினான்", "நம்பினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்பினாள்", "நம்பினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்பினார்", "நம்பினர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்பினது", "நம்பியது", "நம்பிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்பின",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்போம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்பான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்பாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்பார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்பாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்பா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நம்ப",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நம்பும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புவோம்", "நம்புவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்புவான்", "நம்புவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்புவாள்", "நம்புவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்புவார்", "நம்புவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்புவது", "நம்பும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்புவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நம்புக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நம்புதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நம்புகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புகின்றோம்", "நம்புகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்புகின்றான்", "நம்புகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்புகின்றாள்", "நம்புகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்புகின்றார்", "நம்புகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்புகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்புகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("நம்பு",), expected,);
            },);
            QUnit.test("உலாவு", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["உலாவி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["உலாவிய", "உலாவின",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவினோம்", "உலாவினம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவினீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவினான்", "உலாவினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவினாள்", "உலாவினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவினார்", "உலாவினர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவினது", "உலாவியது", "உலாவிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவின",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["உலாவ",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாவும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுவோம்", "உலாவுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவுவான்", "உலாவுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவுவாள்", "உலாவுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவுவார்", "உலாவுவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவுவது", "உலாவும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உலாவுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உலாவுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாவுகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுகின்றோம்", "உலாவுகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவுகின்றான்", "உலாவுகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவுகின்றாள்", "உலாவுகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவுகின்றார்", "உலாவுகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவுகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, { label: "வினய் வடிவங்கள்", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தும்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["உலாத்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["உலாத்திய", "உலாத்தின",],),
                        },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தினோம்", "உலாத்தினம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தினீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்தினான்", "உலாத்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்தினாள்", "உலாத்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்தினார்", "உலாத்தினர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்தினது", "உலாத்தியது", "உலாத்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்தின",],), },],
                            ],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தோம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்தார்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["உலாத்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாத்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துவோம்", "உலாத்துவம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துவீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்துவான்", "உலாத்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்துவாள்", "உலாத்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்துவார்", "உலாத்துவர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்துவது", "உலாத்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உலாத்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உலாத்துதல்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாத்துகின்ற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துகின்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துகின்றோம்", "உலாத்துகின்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துகின்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துகின்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்துகின்றான்", "உலாத்துகின்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்துகின்றாள்", "உலாத்துகின்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்துகின்றார்", "உலாத்துகின்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்துகின்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],
                ],), };
                t.deepEqual(getForms("உலாவு",), expected,);
            },);
            QUnit.test("போது", t => {
                const expected = new Map([
                    ["இனம்", "போது",],
                    ["ஏவல்வினய்முற்று", new Set(["போது",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["போதுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["போதார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["போதினார்", "போந்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["போதுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["போதுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["போத",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["போதி", "போந்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["போதிய", "போந்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["போதுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["போதும்",],),],
                    ["தொழிற்பெயர்", new Set(["போதுதல்",],),],
                ],);
                t.deepEqual(getForms("போது",), expected,);
            },);
        },);
        QUnit.module("பாரும் இருவும்", () => {
            QUnit.test("எடு", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["எடுத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["எடுத்த",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுத்தேன்", "எடுத்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுத்தோம்", "எடுத்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுத்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுத்தான்", "எடுத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுத்தாள்", "எடுத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுத்தார்", "எடுத்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்கேன்", "எடேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கோம்", "எடோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்காய்", "எடாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கீர்", "எடீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுக்கான்", "எடான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுக்காள்", "எடாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுக்கார்", "எடார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுக்காது", "எடாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுக்கா", "எடா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["எடுக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["எடுக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுப்போம்", "எடுப்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுப்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுப்பான்", "எடுப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுப்பாள்", "எடுப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுப்பார்", "எடுப்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுப்பது", "எடுக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["எடுக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["எடுத்தல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["எடுக்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கின்றோம்", "எடுக்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுக்கின்றான்", "எடுக்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுக்கின்றாள்", "எடுக்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுக்கின்றார்", "எடுக்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுக்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("எடு",), expected,);
            },);
            QUnit.test("கேள்", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேள்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேளும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["கேட்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["கேட்ட",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்டேன்", "கேட்டன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்டோம்", "கேட்டனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்டீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்டான்", "கேட்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்டாள்", "கேட்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்டார்", "கேட்டனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்டன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்கேன்", "கேளேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கோம்", "கேளோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்காய்", "கேளாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கீர்", "கேளீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்கான்", "கேளான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்காள்", "கேளாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்கார்", "கேளார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்காது", "கேளாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்கா", "கேளா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["கேட்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கேட்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்போம்", "கேட்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்பான்", "கேட்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்பாள்", "கேட்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்பார்", "கேட்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்பது", "கேட்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["கேட்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["கேட்டல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கேட்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கின்றோம்", "கேட்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்கின்றான்", "கேட்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்கின்றாள்", "கேட்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்கின்றார்", "கேட்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("கேள்",), expected,);
            },);
            QUnit.test("வில்", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வில்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வில்லும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["விற்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["விற்ற",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றேன்", "விற்றன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றோம்", "விற்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்றான்", "விற்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்றாள்", "விற்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்றார்", "விற்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்றன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கேன்", "வில்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கோம்", "வில்லோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்காய்", "வில்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கீர்", "வில்லீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கான்", "வில்லான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்காள்", "வில்லாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கார்", "வில்லார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்காது", "வில்லாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கா", "வில்லா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["விற்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்போம்", "விற்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்பான்", "விற்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்பாள்", "விற்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்பார்", "விற்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்பது", "விற்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["விற்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["விற்றல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றோம்", "விற்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கின்றான்", "விற்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்கின்றாள்", "விற்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கின்றார்", "விற்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, { label: "வினய் வடிவங்கள்", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வில்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வில்லும்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["விற்று",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["விற்ற",],),
                        },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றேன்", "விற்றன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றோம்", "விற்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்றான்", "விற்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்றாள்", "விற்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்றார்", "விற்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்றன",],), },],
                            ],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கேன்", "வில்லேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கோம்", "வில்லோம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்காய்", "வில்லாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கீர்", "வில்லீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கான்", "வில்லான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்காள்", "வில்லாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கார்", "வில்லார்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்காது", "வில்லாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கா", "வில்லா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["விற்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்போம்", "விற்பம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்பீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்பான்", "விற்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்பாள்", "விற்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்பார்", "விற்பர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்பது", "விற்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["விற்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["விற்றல்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கின்ற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றோம்", "விற்கின்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கின்றான்", "விற்கின்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்கின்றாள்", "விற்கின்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கின்றார்", "விற்கின்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்கின்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],
                ],), };
                t.deepEqual(getForms("வில்",), expected,);
            },);
            QUnit.test("ஒ", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒவ்வும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஒத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["ஒத்த",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒத்தேன்", "ஒத்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒத்தோம்", "ஒத்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒத்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒத்தான்", "ஒத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒத்தாள்", "ஒத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒத்தார்", "ஒத்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்கேன்", "ஒவ்வேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கோம்", "ஒவ்வோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்காய்", "ஒவ்வாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கீர்", "ஒவ்வீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒக்கான்", "ஒவ்வான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒக்காள்", "ஒவ்வாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒக்கார்", "ஒவ்வார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒக்காது", "ஒவ்வாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒக்கா", "ஒவ்வா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஒக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஒக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒப்போம்", "ஒப்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒப்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒப்பான்", "ஒப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒப்பாள்", "ஒப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒப்பார்", "ஒப்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒப்பது", "ஒக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஒக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஒத்தல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஒக்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கின்றோம்", "ஒக்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒக்கின்றான்", "ஒக்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒக்கின்றாள்", "ஒக்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒக்கின்றார்", "ஒக்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒக்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("ஒ",), expected,);
            },);
            QUnit.test("மூ", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூவும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["மூத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["மூத்த",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூத்தேன்", "மூத்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூத்தோம்", "மூத்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூத்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூத்தான்", "மூத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூத்தாள்", "மூத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூத்தார்", "மூத்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்கேன்", "மூவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கோம்", "மூவோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்காய்", "மூவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கீர்", "மூவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூக்கான்", "மூவான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூக்காள்", "மூவாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூக்கார்", "மூவார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூக்காது", "மூவாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூக்கா", "மூவா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["மூக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மூக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூப்போம்", "மூப்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூப்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூப்பான்", "மூப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூப்பாள்", "மூப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூப்பார்", "மூப்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூப்பது", "மூக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["மூக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["மூத்தல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மூக்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கின்றோம்", "மூக்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூக்கின்றான்", "மூக்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூக்கின்றாள்", "மூக்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூக்கின்றார்", "மூக்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூக்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("மூ",), expected,);
            },);
            QUnit.test("அள", t => {
                const expected = new Map([
                    ["இனம்", "இரு",],
                    ["ஏவல்வினய்முற்று", new Set(["அள",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["அளக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["அளவார்", "அளக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["அளந்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["அளக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["அளப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["அளக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["அளந்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["அளந்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["அளக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["அளக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["அளத்தல்",],),],
                ],);
                t.deepEqual(getForms("அள",), expected,);
            },);
            QUnit.test("மோ", t => {
                const expected = new Map([
                    ["இனம்", "இரு",],
                    ["ஏவல்வினய்முற்று", new Set(["மோ",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["மோக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["மோவார்", "மோக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["மோந்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["மோக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["மோப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["மோக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["மோந்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["மோந்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["மோக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["மோக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["மோத்தல்",],),],
                ],);
                t.deepEqual(getForms("மோ",), expected,);
            },);
            QUnit.test("நில்", t => {
                const expected = new Map([
                    ["இனம்", "இரு",],
                    ["ஏவல்வினய்முற்று", new Set(["நில்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["நிற்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["நில்லார்", "நிற்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["நின்றார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["நிற்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["நிற்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["நிற்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["நின்று",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["நின்ற",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["நிற்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["நிற்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["நிற்றல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["நிறுத்து",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["நிறுத்துக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["நிறுத்தார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["நிறுத்தினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["நிறுத்துகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["நிறுத்துவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["நிறுத்த",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["நிறுத்தி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["நிறுத்திய", "நிறுத்தின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["நிறுத்துகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["நிறுத்தும்",],),],
                        ["தொழிற்பெயர்", new Set(["நிறுத்துதல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("நில்",), expected,);
            },);
        },);
        QUnit.module("உயரும் சொல்லும்", () => {
            QUnit.test("புரி", t => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", new Set(["புரி",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["புரிக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["புரியார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["புரிந்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["புரிகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["புரிவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["புரிய",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["புரிந்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["புரிந்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["புரிகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["புரியும்",],),],
                    ["தொழிற்பெயர்", new Set(["புரிதல்",],),],
                ],);
                t.deepEqual(getForms("புரி",), expected,);
            },);
            QUnit.test("வாழ்", t => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", new Set(["வாழ்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["வாழ்க", "வாழுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["வாழார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["வாழ்ந்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["வாழ்கின்றார்", "வாழுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["வாழ்வார்", "வாழுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["வாழ",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["வாழ்ந்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["வாழ்ந்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["வாழ்கின்ற", "வாழுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["வாழும்",],),],
                    ["தொழிற்பெயர்", new Set(["வாழ்தல்", "வாழுதல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["வாழ்த்து",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["வாழ்த்துக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["வாழ்த்தார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["வாழ்த்தினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["வாழ்த்துகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["வாழ்த்துவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["வாழ்த்த",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["வாழ்த்தி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["வாழ்த்திய", "வாழ்த்தின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["வாழ்த்துகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["வாழ்த்தும்",],),],
                        ["தொழிற்பெயர்", new Set(["வாழ்த்துதல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("வாழ்",), expected,);
            },);
            QUnit.test("பயில்", t => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", new Set(["பயில்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["பயில்க", "பயிலுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["பயிலார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["பயின்றார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["பயில்கின்றார்", "பயிலுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["பயில்வார்", "பயிலுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["பயில",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["பயின்று",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["பயின்ற",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["பயில்கின்ற", "பயிலுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["பயிலும்",],),],
                    ["தொழிற்பெயர்", new Set(["பயிலுதல்", "பயிற்றல்",],),],
                ],);
                t.deepEqual(getForms("பயில்",), expected,);
            },);
            QUnit.test("ஆள்", t => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", new Set(["ஆள்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["ஆள்க", "ஆளுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["ஆளார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["ஆண்டார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["ஆள்கின்றார்", "ஆளுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["ஆள்வார்", "ஆளுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["ஆள",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["ஆண்டு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["ஆண்ட",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["ஆள்கின்ற", "ஆளுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["ஆளும்",],),],
                    ["தொழிற்பெயர்", new Set(["ஆளுதல்", "ஆட்டல்",],),],
                ],);
                t.deepEqual(getForms("ஆள்",), expected,);
            },);
            QUnit.test("செல்", t => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", new Set(["செல்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["செல்க", "செல்லுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["செல்லார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["சென்றார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["செல்கின்றார்", "செல்லுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["செல்வார்", "செல்லுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["செல்ல",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["சென்று",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["சென்ற",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["செல்கின்ற", "செல்லுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["செல்லும்",],),],
                    ["தொழிற்பெயர்", new Set(["செல்லுதல்", "செற்றல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["செலுத்து",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["செலுத்துக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["செலுத்தார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["செலுத்தினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["செலுத்துகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["செலுத்துவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["செலுத்த",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["செலுத்தி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["செலுத்திய", "செலுத்தின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["செலுத்துகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["செலுத்தும்",],),],
                        ["தொழிற்பெயர்", new Set(["செலுத்துதல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("செல்",), expected,);
            },);
            QUnit.test("கொள்", t => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", new Set(["கொள்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["கொள்க", "கொள்ளுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["கொள்ளார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["கொண்டார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["கொள்கின்றார்", "கொள்ளுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["கொள்வார்", "கொள்ளுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["கொள்ள",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["கொண்டு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["கொண்ட",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["கொள்கின்ற", "கொள்ளுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["கொள்ளும்",],),],
                    ["தொழிற்பெயர்", new Set(["கொள்ளுதல்", "கொட்டல்",],),],
                ],);
                t.deepEqual(getForms("கொள்",), expected,);
            },);
            QUnit.test("சொல்", t => {
                const expected = new Map([
                    ["இனம்", "சொல்",],
                    ["ஏவல்வினய்முற்று", new Set(["சொல்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["சொல்க", "சொல்லுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["சொல்லார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["சொன்னார்", "சொல்லினார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["சொல்கின்றார்", "சொல்லுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["சொல்வார்", "சொல்லுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["சொல்ல",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["சொல்லி",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["சொன்ன", "சொல்லிய", "சொல்லின",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சொல்கின்ற", "சொல்லுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சொல்லும்",],),],
                    ["தொழிற்பெயர்", new Set(["சொல்லுதல்", "சொற்றல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", new Set(["சொல்லுவி",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["சொல்லுவிக்க",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["சொல்லுவியார்", "சொல்லுவிக்கார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["சொல்லுவித்தார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["சொல்லுவிக்கின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["சொல்லுவிப்பார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["சொல்லுவிக்க",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["சொல்லுவித்து",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["சொல்லுவித்த",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சொல்லுவிக்கின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சொல்லுவிக்கும்",],),],
                        ["தொழிற்பெயர்", new Set(["சொல்லுவித்தல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("சொல்",), expected,);
            },);
        },);
        QUnit.module("செய்யும் இடுவும் தகுவும் வாவும் காணும்", () => {
            QUnit.test("அழு", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "செய்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அழுது",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுத",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுதேன்", "அழுதன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுதோம்", "அழுதனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுதாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுதீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுதான்", "அழுதனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுதாள்", "அழுதனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுதார்", "அழுதனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுதது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுதன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அழ",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவோம்", "அழுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவான்", "அழுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவாள்", "அழுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவார்", "அழுவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவது", "அழும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["அழுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["அழுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுகின்றோம்", "அழுகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுகின்றான்", "அழுகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுகின்றாள்", "அழுகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுகின்றார்", "அழுகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, { label: "வினய் வடிவங்கள்", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவியும்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அழுவித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["அழுவித்த",],),
                        },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவித்தேன்", "அழுவித்தன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவித்தோம்", "அழுவித்தனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவித்தீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவித்தான்", "அழுவித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவித்தாள்", "அழுவித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவித்தார்", "அழுவித்தனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்கேன்", "அழுவியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கோம்", "அழுவியோம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்காய்", "அழுவியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கீர்", "அழுவியீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவிக்கான்", "அழுவியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவிக்காள்", "அழுவியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவிக்கார்", "அழுவியார்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவிக்காது", "அழுவியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவிக்கா", "அழுவியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அழுவிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுவிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிப்போம்", "அழுவிப்பம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிப்பீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவிப்பான்", "அழுவிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவிப்பாள்", "அழுவிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவிப்பார்", "அழுவிப்பர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவிப்பது", "அழுவிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["அழுவிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["அழுவித்தல்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுவிக்கின்ற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்கின்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கின்றோம்", "அழுவிக்கின்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்கின்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கின்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவிக்கின்றான்", "அழுவிக்கின்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவிக்கின்றாள்", "அழுவிக்கின்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவிக்கின்றார்", "அழுவிக்கின்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவிக்கின்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],
                ],), };
                t.deepEqual(getForms("அழு",), expected,);
            },);
            QUnit.test("தொகு", t => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", new Set(["தொகு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["தொகுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["தொகார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["தொக்கார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["தொகுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["தொகுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["தொக",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["தொக்கு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["தொக்க",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["தொகுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["தொகும்",],),],
                    ["தொழிற்பெயர்", new Set(["தொக்கல்", "தொகுதல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", new Set(["தொகு",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["தொகுக்க",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["தொகார்", "தொகுக்கார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["தொகுத்தார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["தொகுக்கின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["தொகுப்பார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["தொகுக்க",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["தொகுத்து",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["தொகுத்த",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["தொகுக்கின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["தொகுக்கும்",],),],
                        ["தொழிற்பெயர்", new Set(["தொகுத்தல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("தொகு",), expected,);
            },);
            QUnit.test("சுடு", t => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", new Set(["சுடு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["சுடுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["சுடார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["சுட்டார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["சுடுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["சுடுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["சுட",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["சுட்டு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["சுட்ட",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சுடுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சுடும்",],),],
                    ["தொழிற்பெயர்", new Set(["சுட்டல்", "சுடுதல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "இடு",],
                        ["ஏவல்வினய்முற்று", new Set(["சுடு",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["சுடுக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["சுடார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["சுட்டார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["சுடுகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["சுடுவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["சுட",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["சுட்டு",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["சுட்ட",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சுடுகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சுடும்",],),],
                        ["தொழிற்பெயர்", new Set(["சுட்டல்", "சுடுதல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("சுடு",), expected,);
            },);
            QUnit.test("பெறு", t => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", new Set(["பெறு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["பெறுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["பெறார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["பெற்றார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["பெறுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["பெறுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["பெற",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["பெற்று",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["பெற்ற",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["பெறுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["பெறும்",],),],
                    ["தொழிற்பெயர்", new Set(["பெற்றல்", "பெறுதல்",],),],
                ],);
                t.deepEqual(getForms("பெறு",), expected,);
            },);
            QUnit.test("மிகு", t => {
                const expected = new Map([
                    ["இனம்", "தகு",],
                    ["ஏவல்வினய்முற்று", new Set(["மிகு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["மிகுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["மிகார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["மிக்கார்", "மிகுந்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["மிகுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["மிகுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["மிக",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["மிக்கு", "மிகுந்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["மிக்க", "மிகுந்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["மிகுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["மிகும்",],),],
                    ["தொழிற்பெயர்", new Set(["மிக்கல்", "மிகுதல்",],),],
                ],);
                t.deepEqual(getForms("மிகு",), expected,);
            },);
            QUnit.test("தா", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வா", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தா",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தாரும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["தந்த",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தந்தேன்", "தந்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தந்தோம்", "தந்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தந்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தந்தான்", "தந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தந்தாள்", "தந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தந்தார்", "தந்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தரேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தரோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தராய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தரீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தரான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தராள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தரார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தராது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தரா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தர",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தரும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவோம்", "தருவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவான்", "தருவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவாள்", "தருவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவார்", "தருவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவது", "தரும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தருக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தருதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தருகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருகின்றோம்", "தருகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருகின்றான்", "தருகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருகின்றாள்", "தருகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருகின்றார்", "தருகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, { label: "வினய் வடிவங்கள்", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவியும்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தருவித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["தருவித்த",],),
                        },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவித்தேன்", "தருவித்தன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவித்தோம்", "தருவித்தனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவித்தீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவித்தான்", "தருவித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவித்தாள்", "தருவித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவித்தார்", "தருவித்தனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்கேன்", "தருவியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கோம்", "தருவியோம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்காய்", "தருவியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கீர்", "தருவியீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவிக்கான்", "தருவியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவிக்காள்", "தருவியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவிக்கார்", "தருவியார்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவிக்காது", "தருவியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவிக்கா", "தருவியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தருவிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தருவிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிப்போம்", "தருவிப்பம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிப்பீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவிப்பான்", "தருவிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவிப்பாள்", "தருவிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவிப்பார்", "தருவிப்பர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவிப்பது", "தருவிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தருவிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தருவித்தல்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தருவிக்கின்ற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்கின்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கின்றோம்", "தருவிக்கின்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்கின்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கின்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவிக்கின்றான்", "தருவிக்கின்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவிக்கின்றாள்", "தருவிக்கின்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவிக்கின்றார்", "தருவிக்கின்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவிக்கின்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],
                ],), };
                t.deepEqual(getForms("தா",), expected,);
            },);
            QUnit.test("என்", t => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", new Set(["என்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["என்க", "என்னுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["என்னார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["என்றார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["என்கின்றார்", "என்னுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["என்பார்", "என்னுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["என்ன",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["என்று",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["என்ற",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["என்கின்ற", "என்னுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["என்னும்",],),],
                    ["தொழிற்பெயர்", new Set(["என்றல்", "என்னுதல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", new Set(["என்பி",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["என்பிக்க",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["என்பியார்", "என்பிக்கார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["என்பித்தார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["என்பிக்கின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["என்பிப்பார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["என்பிக்க",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["என்பித்து",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["என்பித்த",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["என்பிக்கின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["என்பிக்கும்",],),],
                        ["தொழிற்பெயர்", new Set(["என்பித்தல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("என்",), expected,);
            },);
            QUnit.test("உண்", t => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", new Set(["உண்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["உண்க", "உண்ணுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["உண்ணார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["உண்டார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["உண்கின்றார்", "உண்ணுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["உண்பார்", "உண்ணுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["உண்ண",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["உண்டு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["உண்ட",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["உண்கின்ற", "உண்ணுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["உண்ணும்",],),],
                    ["தொழிற்பெயர்", new Set(["உண்டல்", "உண்ணுதல்",],),],
                    [causativeFormsKey, new Set([
                        new Map([
                            ["இனம்", "வாங்கு",],
                            ["ஏவல்வினய்முற்று", new Set(["ஊட்டு",],),],
                            ["வியங்கோள்வினய்முற்று", new Set(["ஊட்டுக",],),],
                            ["எதிர்மறய்வினய்முற்று", new Set(["ஊட்டார்",],),],
                            ["போனகாலத்துவினய்முற்று", new Set(["ஊட்டினார்",],),],
                            ["நிகழ்காலத்துவினய்முற்று", new Set(["ஊட்டுகின்றார்",],),],
                            ["வருங்காலத்துவினய்முற்று", new Set(["ஊட்டுவார்",],),],
                            ["வருங்காலத்துவினயெச்சம்", new Set(["ஊட்ட",],),],
                            ["போனகாலத்துவினயெச்சம்", new Set(["ஊட்டி",],),],
                            ["போனகாலத்துப்பெயரெச்சம்", new Set(["ஊட்டிய", "ஊட்டின",],),],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["ஊட்டுகின்ற",],),],
                            ["வருங்காலத்துப்பெயரெச்சம்", new Set(["ஊட்டும்",],),],
                            ["தொழிற்பெயர்", new Set(["ஊட்டுதல்",],),],
                        ],),
                        new Map([
                            ["இனம்", "பார்",],
                            ["ஏவல்வினய்முற்று", new Set(["உண்பி",],),],
                            ["வியங்கோள்வினய்முற்று", new Set(["உண்பிக்க",],),],
                            ["எதிர்மறய்வினய்முற்று", new Set(["உண்பியார்", "உண்பிக்கார்",],),],
                            ["போனகாலத்துவினய்முற்று", new Set(["உண்பித்தார்",],),],
                            ["நிகழ்காலத்துவினய்முற்று", new Set(["உண்பிக்கின்றார்",],),],
                            ["வருங்காலத்துவினய்முற்று", new Set(["உண்பிப்பார்",],),],
                            ["வருங்காலத்துவினயெச்சம்", new Set(["உண்பிக்க",],),],
                            ["போனகாலத்துவினயெச்சம்", new Set(["உண்பித்து",],),],
                            ["போனகாலத்துப்பெயரெச்சம்", new Set(["உண்பித்த",],),],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["உண்பிக்கின்ற",],),],
                            ["வருங்காலத்துப்பெயரெச்சம்", new Set(["உண்பிக்கும்",],),],
                            ["தொழிற்பெயர்", new Set(["உண்பித்தல்",],),],
                        ],),
                    ],),],
                ],);
                t.deepEqual(getForms("உண்",), expected,);
            },);
            QUnit.test("தின்", t => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", new Set(["தின்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["தின்க", "தின்னுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["தின்னார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["தின்றார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["தின்கின்றார்", "தின்னுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["தின்பார்", "தின்னுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["தின்ன",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["தின்று",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["தின்ற",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["தின்கின்ற", "தின்னுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["தின்னும்",],),],
                    ["தொழிற்பெயர்", new Set(["தின்றல்", "தின்னுதல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["தீற்று",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["தீற்றுக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["தீற்றார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["தீற்றினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["தீற்றுகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["தீற்றுவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["தீற்ற",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["தீற்றி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["தீற்றிய", "தீற்றின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["தீற்றுகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["தீற்றும்",],),],
                        ["தொழிற்பெயர்", new Set(["தீற்றுதல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("தின்",), expected,);
            },);
            QUnit.test("காண்", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "காண்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["கண்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["கண்ட",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கண்டேன்", "கண்டன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கண்டோம்", "கண்டனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கண்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கண்டீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கண்டான்", "கண்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கண்டாள்", "கண்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கண்டார்", "கண்டனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கண்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கண்டன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காணான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காணாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காணார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காணாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காணா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காண",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காணும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணுவேன்", "காண்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணுவோம்", "காணுவம்", "காண்போம்", "காண்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணுவாய்", "காண்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணுவீர்", "காண்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காணுவான்", "காணுவன்", "காண்பான்", "காண்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காணுவாள்", "காணுவள்", "காண்பாள்", "காண்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காணுவார்", "காணுவர்", "காண்பார்", "காண்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காணுவது", "காண்பது", "காணும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காணுவன", "காண்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காணுக", "காண்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காணுதல்", "காண்டல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காண்கின்ற", "காணுகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்கின்றேன்", "காணுகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்கின்றோம்", "காணுகின்றோம்", "காண்கின்றனம்", "காணுகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்கின்றாய்", "காணுகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்கின்றீர்", "காணுகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்கின்றான்", "காணுகின்றான்", "காண்கின்றனன்", "காணுகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்கின்றாள்", "காணுகின்றாள்", "காண்கின்றனள்", "காணுகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்கின்றார்", "காணுகின்றார்", "காண்கின்றனர்", "காணுகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்கின்றது", "காணுகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்கின்றன", "காணுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([
                        { label: "வினய் வடிவங்கள்", children: new Map([
                            ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                            ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பி",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பியும்",],), },],
                            ],), },],
                            ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["காண்பித்து",],), },],
                            ["போனகாலத்துப்பெயரெச்சம்", {
                                label: "போனகாலத்துப் பெயரெச்சம்",
                                வடிவு: new Set(["காண்பித்த",],),
                            },],
                            ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பித்தேன்", "காண்பித்தன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பித்தோம்", "காண்பித்தனம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பித்தாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பித்தீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பித்தான்", "காண்பித்தனன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பித்தாள்", "காண்பித்தனள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பித்தார்", "காண்பித்தனர்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பித்தது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பித்தன",],), },],
                                ],), },],
                            ],), },],
                            ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்கேன்", "காண்பியேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கோம்", "காண்பியோம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்காய்", "காண்பியாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கீர்", "காண்பியீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பிக்கான்", "காண்பியான்",],),
                                    },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பிக்காள்", "காண்பியாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பிக்கார்", "காண்பியார்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பிக்காது", "காண்பியாது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பிக்கா", "காண்பியா",],), },],
                                ],), },],
                            ],), },],
                            ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காண்பிக்க",],), },],
                            ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காண்பிக்கும்",],), },],
                            ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிப்பேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிப்போம்", "காண்பிப்பம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிப்பாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிப்பீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பிப்பான்", "காண்பிப்பன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பிப்பாள்", "காண்பிப்பள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பிப்பார்", "காண்பிப்பர்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பிப்பது", "காண்பிக்கும்",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பிப்பன",],), },],
                                ],), },],
                            ],), },],
                            ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காண்பிக்க",],), },],
                            ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காண்பித்தல்",],), },],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காண்பிக்கின்ற",],), },],
                            ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்கின்றேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கின்றோம்", "காண்பிக்கின்றனம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்கின்றாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கின்றீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பிக்கின்றான்", "காண்பிக்கின்றனன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பிக்கின்றாள்", "காண்பிக்கின்றனள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பிக்கின்றார்", "காண்பிக்கின்றனர்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பிக்கின்றது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பிக்கின்றன",],), },],
                                ],), },],
                            ],), },],
                        ],), },
                        { label: "வினய் வடிவங்கள்", children: new Map([
                            ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                            ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டு",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டும்",],), },],
                            ],), },],
                            ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["காட்டி",],), },],
                            ["போனகாலத்துப்பெயரெச்சம்", {
                                label: "போனகாலத்துப் பெயரெச்சம்",
                                வடிவு: new Set(["காட்டிய", "காட்டின",],),
                            },],
                            ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டினேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டினோம்", "காட்டினம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டினாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டினீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டினான்", "காட்டினன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டினாள்", "காட்டினள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டினார்", "காட்டினர்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டினது", "காட்டியது", "காட்டிற்று",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டின",],), },],
                                ],), },],
                            ],), },],
                            ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டோம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டான்",],),
                                    },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டார்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டாது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டா",],), },],
                                ],), },],
                            ],), },],
                            ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காட்ட",],), },],
                            ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காட்டும்",],), },],
                            ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுவேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுவோம்", "காட்டுவம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுவாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுவீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டுவான்", "காட்டுவன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டுவாள்", "காட்டுவள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டுவார்", "காட்டுவர்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டுவது", "காட்டும்",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டுவன",],), },],
                                ],), },],
                            ],), },],
                            ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காட்டுக",],), },],
                            ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காட்டுதல்",],), },],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காட்டுகின்ற",],), },],
                            ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுகின்றேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுகின்றோம்", "காட்டுகின்றனம்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுகின்றாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுகின்றீர்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டுகின்றான்", "காட்டுகின்றனன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டுகின்றாள்", "காட்டுகின்றனள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டுகின்றார்", "காட்டுகின்றனர்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டுகின்றது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டுகின்றன",],), },],
                                ],), },],
                            ],), },],
                        ],), },
                    ],),],
                ],), };
                t.deepEqual(getForms("காண்",), expected,);
            },);
        },);
        QUnit.module("கடயுயிரோரசய்", () => {
            QUnit.test("போ", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "போ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போம்", "போவும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["போய்",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["போன", "போயின",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போனேன்", "போயினேன்", "போனன்", "போயினன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போனோம்", "போயினோம்", "போனனம்", "போயினனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போனாய்", "போயினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போனீர்", "போயினீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போனான்", "போயினான்", "போனனன்", "போயினனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போனாள்", "போயினாள்", "போனனள்", "போயினனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போனார்", "போயினார்", "போனனர்", "போயினனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போனது", "போயினது", "போயிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போனன", "போயினன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போகோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போகீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போகார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["போக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["போகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போவேன்", "போகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போவோம்", "போவம்", "போகுவோம்", "போகுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போவாய்", "போகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போவீர்", "போகுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போகுவான்", "போவான்", "போகுவன்", "போவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போகுவாள்", "போவாள்", "போகுவள்", "போவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போகுவார்", "போவார்", "போகுவர்", "போவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போகுவது", "போவது", "போகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போகுவன", "போவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["போக", "போகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["போதல்", "போகுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["போகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போகின்றோம்", "போகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போகின்றான்", "போகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போகின்றாள்", "போகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போகின்றார்", "போகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, { label: "வினய் வடிவங்கள்", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்கு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்கும்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["போக்கி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["போக்கிய", "போக்கின",],),
                        },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்கினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்கினோம்", "போக்கினம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்கினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்கினீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போக்கினான்", "போக்கினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போக்கினாள்", "போக்கினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போக்கினார்", "போக்கினர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போக்கினது", "போக்கியது", "போக்கிற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போக்கின",],), },],
                            ],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்கேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்கோம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்காய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்கீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போக்கான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போக்காள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போக்கார்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போக்காது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போக்கா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["போக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["போக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்குவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்குவோம்", "போக்குவம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்குவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்குவீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போக்குவான்", "போக்குவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போக்குவாள்", "போக்குவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போக்குவார்", "போக்குவர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போக்குவது", "போக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போக்குவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["போக்குக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["போக்குதல்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["போக்குகின்ற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்குகின்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்குகின்றோம்", "போக்குகின்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போக்குகின்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போக்குகின்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போக்குகின்றான்", "போக்குகின்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போக்குகின்றாள்", "போக்குகின்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போக்குகின்றார்", "போக்குகின்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போக்குகின்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போக்குகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],
                ],), };
                t.deepEqual(getForms("போ",), expected,);
            },);
            QUnit.test("ஆ", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "போ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆம்", "ஆவும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஆய்",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆன", "ஆயின",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆனேன்", "ஆயினேன்", "ஆனன்", "ஆயினன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆனோம்", "ஆயினோம்", "ஆனனம்", "ஆயினனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆனாய்", "ஆயினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆனீர்", "ஆயினீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆனான்", "ஆயினான்", "ஆனனன்", "ஆயினனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆனாள்", "ஆயினாள்", "ஆனனள்", "ஆயினனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆனார்", "ஆயினார்", "ஆனனர்", "ஆயினனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆனது", "ஆயினது", "ஆயிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆனன", "ஆயினன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆகார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஆக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆவேன்", "ஆகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆவோம்", "ஆவம்", "ஆகுவோம்", "ஆகுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆவாய்", "ஆகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆவீர்", "ஆகுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆகுவான்", "ஆவான்", "ஆகுவன்", "ஆவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆகுவாள்", "ஆவாள்", "ஆகுவள்", "ஆவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆகுவார்", "ஆவார்", "ஆகுவர்", "ஆவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆகுவது", "ஆவது", "ஆகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆகுவன", "ஆவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஆக", "ஆகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஆதல்", "ஆகுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகின்றோம்", "ஆகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆகின்றான்", "ஆகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆகின்றாள்", "ஆகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆகின்றார்", "ஆகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, { label: "வினய் வடிவங்கள்", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கும்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஆக்கி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["ஆக்கிய", "ஆக்கின",],),
                        },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கினோம்", "ஆக்கினம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கினீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்கினான்", "ஆக்கினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்கினாள்", "ஆக்கினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்கினார்", "ஆக்கினர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்கினது", "ஆக்கியது", "ஆக்கிற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்கின",],), },],
                            ],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கோம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்காய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்கான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்காள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்கார்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்காது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்கா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஆக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குவோம்", "ஆக்குவம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குவீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்குவான்", "ஆக்குவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்குவாள்", "ஆக்குவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்குவார்", "ஆக்குவர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்குவது", "ஆக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்குவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஆக்குக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஆக்குதல்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆக்குகின்ற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குகின்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குகின்றோம்", "ஆக்குகின்றனம்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குகின்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குகின்றீர்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்குகின்றான்", "ஆக்குகின்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்குகின்றாள்", "ஆக்குகின்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்குகின்றார்", "ஆக்குகின்றனர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்குகின்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்குகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],
                ],), };
                t.deepEqual(getForms("ஆ",), expected,);
            },);
            QUnit.test("நோ", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "நோ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோம்", "நோவும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நொந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["நொந்த",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நொந்தேன்", "நொந்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நொந்தோம்", "நொந்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நொந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நொந்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நொந்தான்", "நொந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நொந்தாள்", "நொந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நொந்தார்", "நொந்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நொந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நொந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நோகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நோகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நோகார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நோகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நோகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நோக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நோகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோவேன்", "நோகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோவோம்", "நோவம்", "நோகுவோம்", "நோகுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோவாய்", "நோகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோவீர்", "நோகுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நோகுவான்", "நோவான்", "நோகுவன்", "நோவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நோகுவாள்", "நோவாள்", "நோகுவள்", "நோவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நோகுவார்", "நோவார்", "நோகுவர்", "நோவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நோகுவது", "நோவது", "நோகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நோகுவன", "நோவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நோக", "நோகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நோதல்", "நோகுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நோகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகின்றோம்", "நோகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நோகின்றான்", "நோகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நோகின்றாள்", "நோகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நோகின்றார்", "நோகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நோகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நோகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("நோ",), expected,);
            },);
            QUnit.test("வே", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "நோ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வே",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேம்", "வேயும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வெந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["வெந்த",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வெந்தேன்", "வெந்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வெந்தோம்", "வெந்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வெந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வெந்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வெந்தான்", "வெந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வெந்தாள்", "வெந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வெந்தார்", "வெந்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வெந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வெந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வேகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வேகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வேகார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வேகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வேகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வேக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வேகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேவேன்", "வேகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேவோம்", "வேவம்", "வேகுவோம்", "வேகுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேவாய்", "வேகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேவீர்", "வேகுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வேகுவான்", "வேவான்", "வேகுவன்", "வேவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வேகுவாள்", "வேவாள்", "வேகுவள்", "வேவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வேகுவார்", "வேவார்", "வேகுவர்", "வேவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வேகுவது", "வேவது", "வேகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வேகுவன", "வேவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வேக", "வேகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வேதல்", "வேகுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வேகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகின்றோம்", "வேகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வேகின்றான்", "வேகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வேகின்றாள்", "வேகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வேகின்றார்", "வேகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வேகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வேகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("வே",), expected,);
            },);
            QUnit.test("சா", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "சா", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சா",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாம்", "சாவும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["செத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["செத்த",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செத்தேன்", "செத்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செத்தோம்", "செத்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செத்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செத்தான்", "செத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செத்தாள்", "செத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செத்தார்", "செத்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சாகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சாகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சாகார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சாகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சாகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சாக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சாகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாவேன்", "சாகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாவோம்", "சாவம்", "சாகுவோம்", "சாகுவம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாவாய்", "சாகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாவீர்", "சாகுவீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சாகுவான்", "சாவான்", "சாகுவன்", "சாவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சாகுவாள்", "சாவாள்", "சாகுவள்", "சாவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சாகுவார்", "சாவார்", "சாகுவர்", "சாவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சாகுவது", "சாவது", "சாகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சாகுவன", "சாவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சாக", "சாகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சாதல்", "சாகுதல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சாகின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகின்றோம்", "சாகின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சாகின்றான்", "சாகின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சாகின்றாள்", "சாகின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சாகின்றார்", "சாகின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சாகின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சாகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("சா",), expected,);
            },);
        },);
        QUnit.module("அடிப்படய்", () => {
            QUnit.test("அல்", t => {
                const expected = new Map([
                    ["இனம்", "அல்",],
                    ["ஏவல்வினய்முற்று", new Set([],),],
                    ["வியங்கோள்வினய்முற்று", new Set([],),],
                    ["எதிர்மறய்வினய்முற்று", new Set([],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["அல்லார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["அல்லார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["அல்லார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set([],),],
                    ["போனகாலத்துவினயெச்சம்", new Set([],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["அற்ற", "அல்லாத",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["அற்ற", "அல்லாத",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["அற்ற", "அல்லாத",],),],
                    ["தொழிற்பெயர்", new Set([],),],
                ],);
                t.deepEqual(getForms("அல்",), expected,);
            },);
            QUnit.test("உள்", t => {
                const expected = new Map([
                    ["இனம்", "உள்",],
                    ["ஏவல்வினய்முற்று", new Set([],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["உள்க", "உள்ளுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set([],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["உள்ளார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["உள்ளார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["உள்ளார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set([],),],
                    ["போனகாலத்துவினயெச்சம்", new Set([],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["உள்ள",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["உள்ள",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["உள்ள",],),],
                    ["தொழிற்பெயர்", new Set(["உள்ளுதல்",],),],
                ],);
                t.deepEqual(getForms("உள்",), expected,);
            },);
            QUnit.test("இல்", t => {
                const expected = new Map([
                    ["இனம்", "இல்",],
                    ["ஏவல்வினய்முற்று", new Set([],),],
                    ["வியங்கோள்வினய்முற்று", new Set([],),],
                    ["எதிர்மறய்வினய்முற்று", new Set([],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["இல்லார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["இல்லார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["இல்லார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set([],),],
                    ["போனகாலத்துவினயெச்சம்", new Set([],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["இல்லாத",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["இல்லாத",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["இல்லாத",],),],
                    ["தொழிற்பெயர்", new Set([],),],
                ],);
                t.deepEqual(getForms("இல்",), expected,);
            },);
        },);
    },);
    QUnit.module("With ambiguous இனம்", () => {
        QUnit.module("படு", () => {
            QUnit.test("இனமில்லா படு", t => {
                t.throws(() => getForms("படு",), err => err instanceof Error &&
                    /^Multiple வினய் classes possible for படு: .*. Select one.$/v.test(err.message,),);
            },);
            QUnit.test("இடு இனத்தில் படு", t => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", new Set(["படு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["படுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["படார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["பட்டார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["படுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["படுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["பட",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["பட்டு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["பட்ட",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["படுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["படும்",],),],
                    ["தொழிற்பெயர்", new Set(["பட்டல்", "படுதல்",],),],
                    [causativeFormsKey, new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["படுத்து",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["படுத்தார்",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["படுத்துக",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["படுத்தினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["படுத்துகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["படுத்துவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["படுத்த",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["படுத்தி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["படுத்திய", "படுத்தின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["படுத்துகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["படுத்தும்",],),],
                        ["தொழிற்பெயர்", new Set(["படுத்துதல்",],),],
                    ],),],
                ],);
                t.deepEqual(getForms("படு", "இடு",), expected,);
            },);
            QUnit.test("பார் இனத்தில் படு", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["படுத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["படுத்த",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தேன்", "படுத்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தோம்", "படுத்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்தான்", "படுத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்தாள்", "படுத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்தார்", "படுத்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்கேன்", "படேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கோம்", "படோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்காய்", "படாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கீர்", "படீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுக்கான்", "படான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுக்காள்", "படாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுக்கார்", "படார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுக்காது", "படாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுக்கா", "படா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["படுக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுப்போம்", "படுப்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுப்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுப்பான்", "படுப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுப்பாள்", "படுப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுப்பார்", "படுப்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுப்பது", "படுக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["படுக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["படுத்தல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுக்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கின்றோம்", "படுக்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுக்கின்றான்", "படுக்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுக்கின்றாள்", "படுக்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுக்கின்றார்", "படுக்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுக்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("படு", "பார்",), expected,);
            },);
        },);
        QUnit.module("வய்", () => {
            QUnit.test("இனமில்லா வய்", t => {
                t.throws(() => getForms("வய்",), err => err instanceof Error &&
                    /^Multiple வினய் classes possible for வய்: .*. Select one.$/v.test(err.message,),);
            },);
            QUnit.test("செய் இனத்தில் வய்", t => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", new Set(["வய்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["வய்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["வய்யார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["வய்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["வய்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["வய்வார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["வய்ய",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["வய்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["வய்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["வய்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["வய்யும்",],),],
                    ["தொழிற்பெயர்", new Set(["வய்தல்",],),],
                ],);
                t.deepEqual(getForms("வய்", "செய்",), expected,);
            },);
            QUnit.test("பார் இனத்தில் வய்", t => {
                const expected = { label: "வினய் வடிவங்கள்", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்யும்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வய்த்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["வய்த்த",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்த்தேன்", "வய்த்தன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்த்தோம்", "வய்த்தனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்த்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்த்தீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்த்தான்", "வய்த்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்த்தாள்", "வய்த்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்த்தார்", "வய்த்தனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்த்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்த்தன",],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்கேன்", "வய்யேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கோம்", "வய்யோம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்காய்", "வய்யாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கீர்", "வய்யீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்க்கான்", "வய்யான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்க்காள்", "வய்யாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்க்கார்", "வய்யார்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்க்காது", "வய்யாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்க்கா", "வய்யா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வய்க்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்க்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்ப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்ப்போம்", "வய்ப்பம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்ப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்ப்பீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்ப்பான்", "வய்ப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்ப்பாள்", "வய்ப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்ப்பார்", "வய்ப்பர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்ப்பது", "வய்க்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்ப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வய்க்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வய்த்தல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்க்கின்ற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்கின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கின்றோம்", "வய்க்கின்றனம்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்கின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கின்றீர்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்க்கின்றான்", "வய்க்கின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்க்கின்றாள்", "வய்க்கின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்க்கின்றார்", "வய்க்கின்றனர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்க்கின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்க்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, null,],
                ],), };
                t.deepEqual(getForms("வய்", "பார்",), expected,);
            },);
        },);
    },);
    QUnit.module("With பிறவினய் forms", () => {
        QUnit.module("Rule0", () => {
            QUnit.test("சுடு", t => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", new Set(["சுடு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["சுடுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["சுடார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["சுட்டார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["சுடுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["சுடுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["சுட",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["சுட்டு",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["சுட்ட",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சுடுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சுடும்",],),],
                    ["தொழிற்பெயர்", new Set(["சுட்டல்", "சுடுதல்",],),],
                ],);
                t.deepEqual(getForms("சுடு",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule1", () => {
            QUnit.test("சேர்", t => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", new Set(["சேர்",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["சேர்க்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["சேரார்", "சேர்க்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["சேர்த்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["சேர்க்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["சேர்ப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["சேர்க்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["சேர்த்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["சேர்த்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சேர்க்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சேர்க்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["சேர்த்தல்",],),],
                ],);
                t.deepEqual(getForms("சேர்",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule10", () => {
            QUnit.test("நட", t => {
                const expected = new Set([
                    new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["நடத்து",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["நடத்துக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["நடத்தார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["நடத்தினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["நடத்துகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["நடத்துவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["நடத்த",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["நடத்தி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["நடத்திய", "நடத்தின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["நடத்துகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["நடத்தும்",],),],
                        ["தொழிற்பெயர்", new Set(["நடத்துதல்",],),],
                    ],),
                    new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", new Set(["நடப்பி",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["நடப்பிக்க",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["நடப்பியார்", "நடப்பிக்கார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["நடப்பித்தார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["நடப்பிக்கின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["நடப்பிப்பார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["நடப்பிக்க",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["நடப்பித்து",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["நடப்பித்த",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["நடப்பிக்கின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["நடப்பிக்கும்",],),],
                        ["தொழிற்பெயர்", new Set(["நடப்பித்தல்",],),],
                    ],),
                ],);
                t.deepEqual(getForms("நட",).get(causativeFormsKey,), expected,);
            },);
            QUnit.test("நீள்", t => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", new Set(["நீட்டு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["நீட்டுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["நீட்டார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["நீட்டினார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["நீட்டுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["நீட்டுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["நீட்ட",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["நீட்டி",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["நீட்டிய", "நீட்டின",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["நீட்டுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["நீட்டும்",],),],
                    ["தொழிற்பெயர்", new Set(["நீட்டுதல்",],),],
                ],);
                t.deepEqual(getForms("நீள்",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule11", () => {
            QUnit.test("அடு", t => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", new Set(["அடுக்கு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["அடுக்குக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["அடுக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["அடுக்கினார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["அடுக்குகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["அடுக்குவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["அடுக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["அடுக்கி",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["அடுக்கிய", "அடுக்கின",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["அடுக்குகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["அடுக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["அடுக்குதல்",],),],
                ],);
                t.deepEqual(getForms("அடு",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule12", () => {
            QUnit.test("காய்", t => {
                const expected = new Set([
                    new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", new Set(["காய்",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["காய்க்க",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["காயார்", "காய்க்கார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["காய்த்தார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["காய்க்கின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["காய்ப்பார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["காய்க்க",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["காய்த்து",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["காய்த்த",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["காய்க்கின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["காய்க்கும்",],),],
                        ["தொழிற்பெயர்", new Set(["காய்த்தல்",],),],
                    ],),
                    new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", new Set(["காய்ச்சு",],),],
                        ["வியங்கோள்வினய்முற்று", new Set(["காய்ச்சுக",],),],
                        ["எதிர்மறய்வினய்முற்று", new Set(["காய்ச்சார்",],),],
                        ["போனகாலத்துவினய்முற்று", new Set(["காய்ச்சினார்",],),],
                        ["நிகழ்காலத்துவினய்முற்று", new Set(["காய்ச்சுகின்றார்",],),],
                        ["வருங்காலத்துவினய்முற்று", new Set(["காய்ச்சுவார்",],),],
                        ["வருங்காலத்துவினயெச்சம்", new Set(["காய்ச்ச",],),],
                        ["போனகாலத்துவினயெச்சம்", new Set(["காய்ச்சி",],),],
                        ["போனகாலத்துப்பெயரெச்சம்", new Set(["காய்ச்சிய", "காய்ச்சின",],),],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["காய்ச்சுகின்ற",],),],
                        ["வருங்காலத்துப்பெயரெச்சம்", new Set(["காய்ச்சும்",],),],
                        ["தொழிற்பெயர்", new Set(["காய்ச்சுதல்",],),],
                    ],),
                ],);
                t.deepEqual(getForms("காய்",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule13", () => {
            QUnit.test("பர", t => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", new Set(["பரப்பு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["பரப்புக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["பரப்பார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["பரப்பினார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["பரப்புகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["பரப்புவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["பரப்ப",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["பரப்பி",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["பரப்பிய", "பரப்பின",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["பரப்புகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["பரப்பும்",],),],
                    ["தொழிற்பெயர்", new Set(["பரப்புதல்",],),],
                ],);
                t.deepEqual(getForms("பர",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule20", () => {
            QUnit.test("செய்", t => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", new Set(["செய்வி",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["செய்விக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["செய்வியார்", "செய்விக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["செய்வித்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["செய்விக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["செய்விப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["செய்விக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["செய்வித்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["செய்வித்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["செய்விக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["செய்விக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["செய்வித்தல்",],),],
                ],);
                t.deepEqual(getForms("செய்",).get(causativeFormsKey,), expected,);
            },);
            QUnit.test("தெரி", t => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", new Set(["தெரிவி",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["தெரிவிக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["தெரிவியார்", "தெரிவிக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["தெரிவித்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["தெரிவிக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["தெரிவிப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["தெரிவிக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["தெரிவித்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["தெரிவித்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["தெரிவிக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["தெரிவிக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["தெரிவித்தல்",],),],
                ],);
                t.deepEqual(getForms("தெரி",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule21", () => {
            QUnit.test("கல்", t => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", new Set(["கற்பி",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["கற்பிக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["கற்பியார்", "கற்பிக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["கற்பித்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["கற்பிக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["கற்பிப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["கற்பிக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["கற்பித்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["கற்பித்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["கற்பிக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["கற்பிக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["கற்பித்தல்",],),],
                ],);
                t.deepEqual(getForms("கல்",).get(causativeFormsKey,), expected,);
            },);
            QUnit.test("சிற", t => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", new Set(["சிறப்பி",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["சிறப்பிக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["சிறப்பியார்", "சிறப்பிக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["சிறப்பித்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["சிறப்பிக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["சிறப்பிப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["சிறப்பிக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["சிறப்பித்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["சிறப்பித்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["சிறப்பிக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["சிறப்பிக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["சிறப்பித்தல்",],),],
                ],);
                t.deepEqual(getForms("சிற",).get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule30", () => {
            QUnit.test("ஆடு", t => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", new Set(["ஆட்டு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["ஆட்டுக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["ஆட்டார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["ஆட்டினார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["ஆட்டுகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["ஆட்டுவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["ஆட்ட",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["ஆட்டி",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["ஆட்டிய", "ஆட்டின",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["ஆட்டுகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["ஆட்டும்",],),],
                    ["தொழிற்பெயர்", new Set(["ஆட்டுதல்",],),],
                ],);
                t.deepEqual(getForms("ஆடு",).get(causativeFormsKey,), expected,);
            },);
            QUnit.test("எழும்பு", t => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", new Set(["எழுப்பு",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["எழுப்புக",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["எழுப்பார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["எழுப்பினார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["எழுப்புகின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["எழுப்புவார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["எழுப்ப",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["எழுப்பி",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["எழுப்பிய", "எழுப்பின",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["எழுப்புகின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["எழுப்பும்",],),],
                    ["தொழிற்பெயர்", new Set(["எழுப்புதல்",],),],
                ],);
                t.deepEqual(getForms("எழும்பு",).get(causativeFormsKey,), expected,);
            },);
        },);
    },);
    QUnit.module("புத்தெழுத்துமுறய்", () => {
        QUnit.test("மறை", t => {
            const expected = new Map([
                ["இனம்", "உயர்",],
                ["ஏவல்வினய்முற்று", new Set(["மறை",],),],
                ["வியங்கோள்வினய்முற்று", new Set(["மறைக",],),],
                ["எதிர்மறய்வினய்முற்று", new Set(["மறையார்",],),],
                ["போனகாலத்துவினய்முற்று", new Set(["மறைந்தார்",],),],
                ["நிகழ்காலத்துவினய்முற்று", new Set(["மறைகின்றார்",],),],
                ["வருங்காலத்துவினய்முற்று", new Set(["மறைவார்",],),],
                ["வருங்காலத்துவினயெச்சம்", new Set(["மறைய",],),],
                ["போனகாலத்துவினயெச்சம்", new Set(["மறைந்து",],),],
                ["போனகாலத்துப்பெயரெச்சம்", new Set(["மறைந்த",],),],
                ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["மறைகின்ற",],),],
                ["வருங்காலத்துப்பெயரெச்சம்", new Set(["மறையும்",],),],
                ["தொழிற்பெயர்", new Set(["மறைதல்",],),],
                [causativeFormsKey, new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", new Set(["மறை",],),],
                    ["வியங்கோள்வினய்முற்று", new Set(["மறைக்க",],),],
                    ["எதிர்மறய்வினய்முற்று", new Set(["மறையார்", "மறைக்கார்",],),],
                    ["போனகாலத்துவினய்முற்று", new Set(["மறைத்தார்",],),],
                    ["நிகழ்காலத்துவினய்முற்று", new Set(["மறைக்கின்றார்",],),],
                    ["வருங்காலத்துவினய்முற்று", new Set(["மறைப்பார்",],),],
                    ["வருங்காலத்துவினயெச்சம்", new Set(["மறைக்க",],),],
                    ["போனகாலத்துவினயெச்சம்", new Set(["மறைத்து",],),],
                    ["போனகாலத்துப்பெயரெச்சம்", new Set(["மறைத்த",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["மறைக்கின்ற",],),],
                    ["வருங்காலத்துப்பெயரெச்சம்", new Set(["மறைக்கும்",],),],
                    ["தொழிற்பெயர்", new Set(["மறைத்தல்",],),],
                ],),],
            ],);
            t.deepEqual(getForms("மறை", null, true,), expected,);
        },);
        QUnit.test("வை", t => {
            const expected = new Map([
                ["இனம்", "பார்",],
                ["ஏவல்வினய்முற்று", new Set(["வை",],),],
                ["வியங்கோள்வினய்முற்று", new Set(["வைக்க",],),],
                ["எதிர்மறய்வினய்முற்று", new Set(["வையார்", "வைக்கார்",],),],
                ["போனகாலத்துவினய்முற்று", new Set(["வைத்தார்",],),],
                ["நிகழ்காலத்துவினய்முற்று", new Set(["வைக்கின்றார்",],),],
                ["வருங்காலத்துவினய்முற்று", new Set(["வைப்பார்",],),],
                ["வருங்காலத்துவினயெச்சம்", new Set(["வைக்க",],),],
                ["போனகாலத்துவினயெச்சம்", new Set(["வைத்து",],),],
                ["போனகாலத்துப்பெயரெச்சம்", new Set(["வைத்த",],),],
                ["நிகழ்காலத்துப்பெயரெச்சம்", new Set(["வைக்கின்ற",],),],
                ["வருங்காலத்துப்பெயரெச்சம்", new Set(["வைக்கும்",],),],
                ["தொழிற்பெயர்", new Set(["வைத்தல்",],),],
            ],);
            t.deepEqual(getForms("வை", "பார்", true,), expected,);
        },);
    },);
    QUnit.module("Invalid getForms", () => {
        QUnit.test("அ as a வினயினம்", t => {
            t.throws(
                () => getForms("படு", "அ",),
                err => err instanceof Error &&
                    /^Unknown வினயினம் .*\.$/v.test(err.message,),
            );
        },);
        QUnit.test("இல் as the வினயினம் for அல்", t => {
            t.throws(
                () => getForms("அல்", "இல்",),
                err => err instanceof Error &&
                    /^பகுதி .* isn't valid for வினயினம் .*\.$/v.test(err.message,),
            );
        },);
        QUnit.test("அ as a பகுதி", t => {
            t.throws(
                () => getForms("அ",),
                err => err instanceof Error &&
                    /^Unknown பகுதி .*\.$/v.test(err.message,),
            );
        },);
    },);
},);
