QUnit.config.maxDepth = -1;
QUnit.config.noglobals = true;
QUnit.config.seed = true;

import { verbClasses, validVerbClasses, getForms, causativeFormsKey, conversionsToNewSpelling, } from "../lib/ilakkanam.js";

QUnit.module("verbClasses", () => {
    QUnit.test("verbClasses is an Array of strings", t => {
        t.true(Array.isArray(verbClasses,),);
        verbClasses.forEach(வினயினத்துப்பெயர் => {
            t.strictEqual(typeof வினயினத்துப்பெயர், "string",);
        },);
    },);
    QUnit.module("validVerbClasses", () => {
        const assertValid = (t, வினயினம்,) => பகுதி => {
            t.true(validVerbClasses(பகுதி,).includes(வினயினம்,),);
        };
        const assertInvalid = (t, வினயினம்,) => பகுதி => {
            t.false(validVerbClasses(பகுதி,).includes(வினயினம்,),);
        };
        QUnit.test("வாங்கு", t => {
            ["ஊது",].forEach(assertValid(t, "வாங்கு",),);
            ["கல்", "கல", "தெரி", "போ",].forEach(assertInvalid(t, "வாங்கு",),);
        },);
        QUnit.test("பார்", t => { t.expect(0,); },); // பார் is always a valid இனம்
        QUnit.test("திற", t => { t.expect(0,); },); // திற is always a valid இனம்
        QUnit.test("உயர்", t => {
            ["ஈ", "அணி", "மிகு", "உயர்", "வீழ்", "குலய்", "கல்",].forEach(assertValid(t, "உயர்",),);
            ["கல",].forEach(assertInvalid(t, "உயர்",),);
        },);
        QUnit.test("சொல்", t => {
            ["சொல்",].forEach(assertValid(t, "சொல்",),);
            ["வாங்கு", "போ", "அணி",].forEach(assertInvalid(t, "சொல்",),);
        },);
        QUnit.test("செய்", t => { t.expect(0,); },); // செய் is always a valid இனம்
        QUnit.test("இடு", t => {
            ["போடு", "பெறு",].forEach(assertValid(t, "இடு",),);
            ["பரவு", "உயர்", "விழு", "கடி", "தின்", "உண்",].forEach(assertInvalid(t, "இடு",),);
        },);
        QUnit.test("தகு", t => {
            ["புகு", "மிகு",].forEach(assertValid(t, "தகு",),);
            ["இடு", "விழு", "கடி", "தின்", "பரவு",].forEach(assertInvalid(t, "தகு",),);
        },);
        QUnit.test("வா", t => {
            ["தா",].forEach(assertValid(t, "வா",),);
            ["கல்", "கல", "தெரி", "போ", "வாங்கு", "உயர்",].forEach(assertInvalid(t, "வா",),);
        },);
        QUnit.test("காண்", t => {
            ["காண்",].forEach(assertValid(t, "காண்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "காண்",),);
        },);
        QUnit.test("போது", t => {
            ["போது",].forEach(assertValid(t, "போது",),);
            ["உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "போது",),);
        },);
        QUnit.test("போ", t => {
            ["போ", "ஆ",].forEach(assertValid(t, "போ",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "போ",),);
        },);
        QUnit.test("நோ", t => {
            ["நோ", "வே",].forEach(assertValid(t, "நோ",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா",].forEach(assertInvalid(t, "நோ",),);
        },);
        QUnit.test("சா", t => {
            ["சா",].forEach(assertValid(t, "சா",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "நோ",].forEach(assertInvalid(t, "சா",),);
        },);
        QUnit.test("அல்", t => {
            ["அல்",].forEach(assertValid(t, "அல்",),);
            ["கல்", "கல", "தெரி", "போ",].forEach(assertInvalid(t, "அல்",),);
        },);
        QUnit.test("உள்", t => {
            ["உள்",].forEach(assertValid(t, "உள்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "உள்",),);
        },);
        QUnit.test("இல்", t => {
            ["இல்",].forEach(assertValid(t, "இல்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "இல்",),);
        },);
    },);
},);

QUnit.module("getForms", () => {
    QUnit.module("With unambiguous இனம்", () => {
        QUnit.module("வாங்குவும் போதுவும்", () => {
            QUnit.test("நம்பு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "நம்பு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பும்", "நம்புங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நம்பி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["நம்பிய", "நம்பின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நம்பினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நம்பினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பினோம்", "நம்பினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பினீர்", "நம்பினீர்கள்", "நம்பினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்பினான்", "நம்பினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்பினாள்", "நம்பினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்பினார்", "நம்பினார்கள்", "நம்பினர்", "நம்பினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்பினது", "நம்பியது", "நம்பிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்பின", "நம்பியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்பியவன்", "நம்பியோன்", "நம்பினவன்", "நம்பினோன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்பியவள்", "நம்பியோள்", "நம்பினவள்", "நம்பினோள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்பியவர்", "நம்பியவர்கள்", "நம்பியோர்", "நம்பியோர்கள்", "நம்பினவர்", "நம்பினவர்கள்", "நம்பினோர்", "நம்பினோர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்பியது", "நம்பினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்பியவய்", "நம்பினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்போம்", "நம்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்பீர்", "நம்பீர்கள்", "நம்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்பான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்பாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்பார்", "நம்பார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்பாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்பா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நம்ப",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நம்பும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புவோம்", "நம்புவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புவீர்", "நம்புவீர்கள்", "நம்புவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்புவான்", "நம்புவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்புவாள்", "நம்புவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்புவார்", "நம்புவார்கள்", "நம்புவர்", "நம்புவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்புவது", "நம்பும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்புவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நம்புக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நம்புதல்", "நம்பல்", "நம்புகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நம்புகின்ற", "நம்புகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புகின்றேன்", "நம்புகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புகின்றோம்", "நம்புகின்றோங்கள்", "நம்புகிறோம்", "நம்புகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நம்புகின்றாய்", "நம்புகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நம்புகின்றீர்", "நம்புகின்றீர்கள்", "நம்புகின்றீர்கள்", "நம்புகிறீர்", "நம்புகிறீர்கள்", "நம்புகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நம்புகின்றான்", "நம்புகின்றனன்", "நம்புகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நம்புகின்றாள்", "நம்புகின்றனள்", "நம்புகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நம்புகின்றார்", "நம்புகின்றார்கள்", "நம்புகின்றனர்", "நம்புகின்றனர்கள்", "நம்புகிறார்", "நம்புகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நம்புகின்றது", "நம்புகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நம்புகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("நம்பு",), expected,);
            },);
            QUnit.test("உலாவு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "உலாவு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவும்", "உலாவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["உலாவி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["உலாவிய", "உலாவின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உலாவினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உலாவினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவினோம்", "உலாவினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவினீர்", "உலாவினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவினான்", "உலாவினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவினாள்", "உலாவினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவினார்", "உலாவினார்கள்", "உலாவினர்", "உலாவினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவினது", "உலாவியது", "உலாவிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவின", "உலாவியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவியவன்", "உலாவியோன்", "உலாவினவன்", "உலாவினோன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவியவள்", "உலாவியோள்", "உலாவினவள்", "உலாவினோள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவியவர்", "உலாவியவர்கள்", "உலாவியோர்", "உலாவியோர்கள்", "உலாவினவர்", "உலாவினவர்கள்", "உலாவினோர்", "உலாவினோர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவியது", "உலாவினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவியவய்", "உலாவினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவோம்", "உலாவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவீர்", "உலாவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவார்", "உலாவார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["உலாவ",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாவும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுவோம்", "உலாவுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுவீர்", "உலாவுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவுவான்", "உலாவுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவுவாள்", "உலாவுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவுவார்", "உலாவுவார்கள்", "உலாவுவர்", "உலாவுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவுவது", "உலாவும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உலாவுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உலாவுதல்", "உலாவல்", "உலாவுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாவுகின்ற", "உலாவுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுகின்றேன்", "உலாவுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுகின்றோம்", "உலாவுகின்றோங்கள்", "உலாவுகிறோம்", "உலாவுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாவுகின்றாய்", "உலாவுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாவுகின்றீர்", "உலாவுகின்றீர்கள்", "உலாவுகிறீர்", "உலாவுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாவுகின்றான்", "உலாவுகின்றனன்", "உலாவுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாவுகின்றாள்", "உலாவுகின்றனள்", "உலாவுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாவுகின்றார்", "உலாவுகின்றார்கள்", "உலாவுகின்றனர்", "உலாவுகின்றனர்கள்", "உலாவுகிறார்", "உலாவுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாவுகின்றது", "உலாவுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாவுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "உலாத்து", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தும்", "உலாத்துங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["உலாத்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["உலாத்திய", "உலாத்தின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உலாத்தினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உலாத்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தினோம்", "உலாத்தினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தினீர்", "உலாத்தினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்தினான்", "உலாத்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்தினாள்", "உலாத்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்தினார்", "உலாத்தினார்கள்", "உலாத்தினர்", "உலாத்தினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்தினது", "உலாத்தியது", "உலாத்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்தின", "உலாத்தியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்தியவன்", "உலாத்தியோன்", "உலாத்தினவன்", "உலாத்தினோன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்தியவள்", "உலாத்தியோள்", "உலாத்தினவள்", "உலாத்தினோள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்தியவர்", "உலாத்தியவர்கள்", "உலாத்தியோர்", "உலாத்தியோர்கள்", "உலாத்தினவர்", "உலாத்தினவர்கள்", "உலாத்தினோர்", "உலாத்தினோர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்தியது", "உலாத்தினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்தியவய்", "உலாத்தினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தோம்", "உலாத்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்தீர்", "உலாத்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்தார்", "உலாத்தார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["உலாத்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாத்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துவோம்", "உலாத்துவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துவீர்", "உலாத்துவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்துவான்", "உலாத்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்துவாள்", "உலாத்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்துவார்", "உலாத்துவார்கள்", "உலாத்துவர்", "உலாத்துவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்துவது", "உலாத்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உலாத்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உலாத்துதல்", "உலாத்தல்", "உலாத்துகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உலாத்துகின்ற", "உலாத்துகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துகின்றேன்", "உலாத்துகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துகின்றோம்", "உலாத்துகின்றோங்கள்", "உலாத்துகிறோம்", "உலாத்துகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உலாத்துகின்றாய்", "உலாத்துகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உலாத்துகின்றீர்", "உலாத்துகின்றீர்கள்", "உலாத்துகிறீர்", "உலாத்துகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உலாத்துகின்றான்", "உலாத்துகின்றனன்", "உலாத்துகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உலாத்துகின்றாள்", "உலாத்துகின்றனள்", "உலாத்துகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உலாத்துகின்றார்", "உலாத்துகின்றார்கள்", "உலாத்துகின்றனர்", "உலாத்துகின்றனர்கள்", "உலாத்துகிறார்", "உலாத்துகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உலாத்துகின்றது", "உலாத்துகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உலாத்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("உலாவு",), expected,);
            },);
            QUnit.test("போது", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "போது", },],
                    ["வினய்", { label: "வினய்", வடிவு: "போது", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போது",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதும்", "போதுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["போதி", "போந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["போதிய", "போதின", "போந்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", {
                        label: "நிபந்தனய் வினயெச்சம்",
                        வடிவு: new Set(["போதினால்", "போந்தால்",],),
                    },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", {
                        label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்",
                        வடிவு: new Set(["போதினும்", "போந்தினும்",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதினேன்", "போந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதினோம்", "போதினோங்கள்", "போந்தோம்", "போந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதினாய்", "போந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதினீர்", "போதினீர்கள்", "போந்தீர்", "போந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போதினான்", "போதினன்", "போந்தான்", "போந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போதினாள்", "போதினள்", "போந்தாள்", "போந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போதினார்", "போதினார்கள்", "போதினர்", "போதினர்கள்", "போந்தார்", "போந்தார்கள்", "போந்தனர்", "போந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போதினது", "போதியது", "போதிற்று", "போந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போதின", "போதியன", "போந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போந்தவன்", "போந்தோன்", "போதியவன்", "போதியோன்", "போதினவன்", "போதினோன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போந்தவள்", "போந்தோள்", "போதியவள்", "போதியோள்", "போதினவள்", "போதினோள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போந்தவர்", "போந்தவர்கள்", "போந்தோர்", "போந்தோர்கள்", "போதியவர்", "போதியவர்கள்", "போதியோர்", "போதியோர்கள்", "போதினவர்", "போதினவர்கள்", "போதினோர்", "போதினோர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போந்தது", "போதியது", "போதினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போந்தவய்", "போதியவய்", "போதினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதோம்", "போதோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதீர்", "போதீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போதான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போதாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போதார்", "போதார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போதாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போதா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["போத",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["போதும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதுவோம்", "போதுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதுவீர்", "போதுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போதுவான்", "போதுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போதுவாள்", "போதுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போதுவார்", "போதுவார்கள்", "போதுவர்", "போதுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போதுவது", "போதும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போதுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["போதுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["போதுதல்", "போதல்", "போதுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["போதுகின்ற", "போதுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதுகின்றேன்", "போதுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதுகின்றோம்", "போதுகின்றோங்கள்", "போதுகிறோம்", "போதுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["போதுகின்றாய்", "போதுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["போதுகின்றீர்", "போதுகின்றீர்கள்", "போதுகிறீர்", "போதுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["போதுகின்றான்", "போதுகின்றனன்", "போதுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["போதுகின்றாள்", "போதுகின்றனள்", "போதுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["போதுகின்றார்", "போதுகின்றார்கள்", "போதுகின்றனர்", "போதுகின்றனர்கள்", "போதுகிறார்", "போதுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["போதுகின்றது", "போதுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["போதுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("போது",), expected,);
            },);
        },);
        QUnit.module("பாரும் திறவும்", () => {
            QUnit.test("எடு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "எடு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடும்", "எடுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["எடுத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["எடுத்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["எடுத்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["எடுத்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுத்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுத்தோம்", "எடுத்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுத்தீர்", "எடுத்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுத்தான்", "எடுத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுத்தாள்", "எடுத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுத்தார்", "எடுத்தார்கள்", "எடுத்தனர்", "எடுத்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுத்தோன்", "எடுத்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுத்தோள்", "எடுத்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுத்தோர்கள்", "எடுத்தவர்கள்", "எடுத்தோர்", "எடுத்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுத்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்கேன்", "எடேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கோம்", "எடுக்கோங்கள்", "எடோம்", "எடோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்காய்", "எடாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கீர்", "எடுக்கீர்கள்", "எடீர்", "எடீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுக்கான்", "எடான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுக்காள்", "எடாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுக்கார்", "எடுக்கார்கள்", "எடார்", "எடார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுக்காது", "எடாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுக்கா", "எடா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["எடுக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["எடுக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுப்போம்", "எடுப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுப்பீர்", "எடுப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுப்பான்", "எடுப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுப்பாள்", "எடுப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுப்பார்", "எடுப்பார்கள்", "எடுப்பர்", "எடுப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுப்பது", "எடுக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["எடுக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["எடுத்தல்", "எடுக்கல்", "எடல்", "எடுக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["எடுக்கின்ற", "எடுக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்கின்றேன்", "எடுக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கின்றோம்", "எடுக்கின்றோங்கள்", "எடுக்கிறோம்", "எடுக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எடுக்கின்றாய்", "எடுக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எடுக்கின்றீர்", "எடுக்கின்றீர்கள்", "எடுக்கிறீர்", "எடுக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எடுக்கின்றான்", "எடுக்கின்றனன்", "எடுக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எடுக்கின்றாள்", "எடுக்கின்றனள்", "எடுக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எடுக்கின்றார்", "எடுக்கின்றார்கள்", "எடுக்கின்றனர்", "எடுக்கின்றனர்கள்", "எடுக்கிறார்", "எடுக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எடுக்கின்றது", "எடுக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எடுக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("எடு",), expected,);
            },);
            QUnit.test("கேள்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "கேள்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேள்", "கேளு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேளும்", "கேளுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["கேட்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["கேட்ட",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கேட்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கேட்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்டோம்", "கேட்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்டீர்", "கேட்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்டான்", "கேட்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்டாள்", "கேட்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்டார்", "கேட்டார்கள்", "கேட்டனர்", "கேட்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்டோன்", "கேட்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்டோள்", "கேட்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்டோர்கள்", "கேட்டவர்கள்", "கேட்டோர்", "கேட்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்கேன்", "கேளேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கோம்", "கேட்கோங்கள்", "கேளோம்", "கேளோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்காய்", "கேளாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கீர்", "கேட்கீர்கள்", "கேளீர்", "கேளீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்கான்", "கேளான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்காள்", "கேளாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்கார்", "கேட்கார்கள்", "கேளார்", "கேளார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்காது", "கேளாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்கா", "கேளா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["கேட்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கேட்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்போம்", "கேட்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்பீர்", "கேட்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்பான்", "கேட்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்பாள்", "கேட்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்பார்", "கேட்பார்கள்", "கேட்பர்", "கேட்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்பது", "கேட்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["கேட்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["கேட்டல்", "கேட்கல்", "கேளல்", "கேட்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கேட்கின்ற", "கேட்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்கின்றேன்", "கேட்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கின்றோம்", "கேட்கின்றோங்கள்", "கேட்கிறோம்", "கேட்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கேட்கின்றாய்", "கேட்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கேட்கின்றீர்", "கேட்கின்றீர்கள்", "கேட்கிறீர்", "கேட்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கேட்கின்றான்", "கேட்கின்றனன்", "கேட்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கேட்கின்றாள்", "கேட்கின்றனள்", "கேட்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கேட்கின்றார்", "கேட்கின்றார்கள்", "கேட்கின்றனர்", "கேட்கின்றனர்கள்", "கேட்கிறார்", "கேட்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கேட்கின்றது", "கேட்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கேட்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("கேள்",), expected,);
            },);
            QUnit.test("வில்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "வில்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வில்", "வில்லு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வில்லும்", "வில்லுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["விற்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["விற்ற",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["விற்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["விற்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றோம்", "விற்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றீர்", "விற்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்றான்", "விற்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்றாள்", "விற்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்றார்", "விற்றார்கள்", "விற்றனர்", "விற்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்றோன்", "விற்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்றோள்", "விற்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்றோர்கள்", "விற்றவர்கள்", "விற்றோர்", "விற்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கேன்", "வில்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கோம்", "விற்கோங்கள்", "வில்லோம்", "வில்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்காய்", "வில்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கீர்", "விற்கீர்கள்", "வில்லீர்", "வில்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கான்", "வில்லான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்காள்", "வில்லாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கார்", "விற்கார்கள்", "வில்லார்", "வில்லார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்காது", "வில்லாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கா", "வில்லா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["விற்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்போம்", "விற்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்பீர்", "விற்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்பான்", "விற்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்பாள்", "விற்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்பார்", "விற்பார்கள்", "விற்பர்", "விற்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்பது", "விற்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["விற்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["விற்றல்", "விற்கல்", "வில்லல்", "விற்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கின்ற", "விற்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றேன்", "விற்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றோம்", "விற்கின்றோங்கள்", "விற்கிறோம்", "விற்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றாய்", "விற்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றீர்", "விற்கின்றீர்கள்", "விற்கிறீர்", "விற்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கின்றான்", "விற்கின்றனன்", "விற்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்கின்றாள்", "விற்கின்றனள்", "விற்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கின்றார்", "விற்கின்றார்கள்", "விற்கின்றனர்", "விற்கின்றனர்கள்", "விற்கிறார்", "விற்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்கின்றது", "விற்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "வில்", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வில்", "வில்லு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வில்லும்", "வில்லுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["விற்று",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["விற்ற",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["விற்றால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["விற்றினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றோம்", "விற்றோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்றீர்", "விற்றீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்றான்", "விற்றனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்றாள்", "விற்றனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்றார்", "விற்றார்கள்", "விற்றனர்", "விற்றனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்றது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்றன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்றோன்", "விற்றவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்றோள்", "விற்றவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்றோர்கள்", "விற்றவர்கள்", "விற்றோர்", "விற்றவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்றவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கேன்", "வில்லேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கோம்", "விற்கோங்கள்", "வில்லோம்", "வில்லோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்காய்", "வில்லாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கீர்", "விற்கீர்கள்", "வில்லீர்", "வில்லீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கான்", "வில்லான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்காள்", "வில்லாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கார்", "விற்கார்கள்", "வில்லார்", "வில்லார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்காது", "வில்லாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கா", "வில்லா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["விற்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்போம்", "விற்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்பீர்", "விற்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்பான்", "விற்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்பாள்", "விற்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்பார்", "விற்பார்கள்", "விற்பர்", "விற்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்பது", "விற்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["விற்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["விற்றல்", "விற்கல்", "வில்லல்", "விற்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["விற்கின்ற", "விற்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றேன்", "விற்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றோம்", "விற்கின்றோங்கள்", "விற்கிறோம்", "விற்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["விற்கின்றாய்", "விற்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["விற்கின்றீர்", "விற்கின்றீர்கள்", "விற்கிறீர்", "விற்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["விற்கின்றான்", "விற்கின்றனன்", "விற்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["விற்கின்றாள்", "விற்கின்றனள்", "விற்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["விற்கின்றார்", "விற்கின்றார்கள்", "விற்கின்றனர்", "விற்கின்றனர்கள்", "விற்கிறார்", "விற்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["விற்கின்றது", "விற்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["விற்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("வில்",), expected,);
            },);
            QUnit.test("ஒ", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "ஒ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒவ்வும்", "ஒவ்வுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஒத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["ஒத்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஒத்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஒத்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒத்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒத்தோம்", "ஒத்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒத்தீர்", "ஒத்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒத்தான்", "ஒத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒத்தாள்", "ஒத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒத்தார்", "ஒத்தார்கள்", "ஒத்தனர்", "ஒத்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒத்தோன்", "ஒத்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒத்தோள்", "ஒத்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒத்தோர்கள்", "ஒத்தவர்கள்", "ஒத்தோர்", "ஒத்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒத்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்கேன்", "ஒவ்வேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கோம்", "ஒக்கோங்கள்", "ஒவ்வோம்", "ஒவ்வோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்காய்", "ஒவ்வாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கீர்", "ஒக்கீர்கள்", "ஒவ்வீர்", "ஒவ்வீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒக்கான்", "ஒவ்வான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒக்காள்", "ஒவ்வாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒக்கார்", "ஒக்கார்கள்", "ஒவ்வார்", "ஒவ்வார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒக்காது", "ஒவ்வாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒக்கா", "ஒவ்வா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஒக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஒக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒப்போம்", "ஒப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒப்பீர்", "ஒப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒப்பான்", "ஒப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒப்பாள்", "ஒப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒப்பார்", "ஒப்பார்கள்", "ஒப்பர்", "ஒப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒப்பது", "ஒக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஒக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஒத்தல்", "ஒக்கல்", "ஒவ்வல்", "ஒக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஒக்கின்ற", "ஒக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்கின்றேன்", "ஒக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கின்றோம்", "ஒக்கின்றோங்கள்", "ஒக்கிறோம்", "ஒக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஒக்கின்றாய்", "ஒக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஒக்கின்றீர்", "ஒக்கின்றீர்கள்", "ஒக்கிறீர்", "ஒக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஒக்கின்றான்", "ஒக்கின்றனன்", "ஒக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஒக்கின்றாள்", "ஒக்கின்றனள்", "ஒக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஒக்கின்றார்", "ஒக்கின்றார்கள்", "ஒக்கின்றனர்", "ஒக்கின்றனர்கள்", "ஒக்கிறார்", "ஒக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஒக்கின்றது", "ஒக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஒக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("ஒ",), expected,);
            },);
            QUnit.test("மூ", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "மூ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூவும்", "மூவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["மூத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["மூத்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மூத்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மூத்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூத்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூத்தோம்", "மூத்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூத்தீர்", "மூத்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூத்தான்", "மூத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூத்தாள்", "மூத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூத்தார்", "மூத்தார்கள்", "மூத்தனர்", "மூத்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூத்தோன்", "மூத்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூத்தோள்", "மூத்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூத்தோர்கள்", "மூத்தவர்கள்", "மூத்தோர்", "மூத்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூத்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்கேன்", "மூவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கோம்", "மூக்கோங்கள்", "மூவோம்", "மூவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்காய்", "மூவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கீர்", "மூக்கீர்கள்", "மூவீர்", "மூவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூக்கான்", "மூவான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூக்காள்", "மூவாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூக்கார்", "மூக்கார்கள்", "மூவார்", "மூவார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூக்காது", "மூவாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூக்கா", "மூவா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["மூக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மூக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூப்போம்", "மூப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூப்பீர்", "மூப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூப்பான்", "மூப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூப்பாள்", "மூப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூப்பார்", "மூப்பார்கள்", "மூப்பர்", "மூப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூப்பது", "மூக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["மூக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["மூத்தல்", "மூக்கல்", "மூவல்", "மூக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மூக்கின்ற", "மூக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்கின்றேன்", "மூக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கின்றோம்", "மூக்கின்றோங்கள்", "மூக்கிறோம்", "மூக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மூக்கின்றாய்", "மூக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மூக்கின்றீர்", "மூக்கின்றீர்கள்", "மூக்கிறீர்", "மூக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மூக்கின்றான்", "மூக்கின்றனன்", "மூக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மூக்கின்றாள்", "மூக்கின்றனள்", "மூக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மூக்கின்றார்", "மூக்கின்றார்கள்", "மூக்கின்றனர்", "மூக்கின்றனர்கள்", "மூக்கிறார்", "மூக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மூக்கின்றது", "மூக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மூக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("மூ",), expected,);
            },);
            QUnit.test("அள", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "திற", },],
                    ["வினய்", { label: "வினய்", வடிவு: "அள", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அள",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளவும்", "அளவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அளந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["அளந்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அளந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அளந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளந்தோம்", "அளந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளந்தீர்", "அளந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அளந்தான்", "அளந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அளந்தாள்", "அளந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அளந்தார்", "அளந்தார்கள்", "அளந்தனர்", "அளந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அளந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அளந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அளந்தோன்", "அளந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அளந்தோள்", "அளந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அளந்தோர்கள்", "அளந்தவர்கள்", "அளந்தோர்", "அளந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அளந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அளந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளக்கேன்", "அளவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளக்கோம்", "அளக்கோங்கள்", "அளவோம்", "அளவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளக்காய்", "அளவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளக்கீர்", "அளக்கீர்கள்", "அளவீர்", "அளவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அளக்கான்", "அளவான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அளக்காள்", "அளவாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அளக்கார்", "அளக்கார்கள்", "அளவார்", "அளவார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அளக்காது", "அளவாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அளக்கா", "அளவா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அளக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அளக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளப்போம்", "அளப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளப்பீர்", "அளப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அளப்பான்", "அளப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அளப்பாள்", "அளப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அளப்பார்", "அளப்பார்கள்", "அளப்பர்", "அளப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அளப்பது", "அளக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அளப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["அளக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["அளத்தல்", "அளக்கல்", "அளவல்", "அளக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அளக்கின்ற", "அளக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளக்கின்றேன்", "அளக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளக்கின்றோம்", "அளக்கின்றோங்கள்", "அளக்கிறோம்", "அளக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அளக்கின்றாய்", "அளக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அளக்கின்றீர்", "அளக்கின்றீர்கள்", "அளக்கிறீர்", "அளக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அளக்கின்றான்", "அளக்கின்றனன்", "அளக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அளக்கின்றாள்", "அளக்கின்றனள்", "அளக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அளக்கின்றார்", "அளக்கின்றார்கள்", "அளக்கின்றனர்", "அளக்கின்றனர்கள்", "அளக்கிறார்", "அளக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அளக்கின்றது", "அளக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அளக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("அள",), expected,);
            },);
            QUnit.test("மோ", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "திற", },],
                    ["வினய்", { label: "வினய்", வடிவு: "மோ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோவும்", "மோவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["மோந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["மோந்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மோந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மோந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோந்தோம்", "மோந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோந்தீர்", "மோந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மோந்தான்", "மோந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மோந்தாள்", "மோந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மோந்தார்", "மோந்தார்கள்", "மோந்தனர்", "மோந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மோந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மோந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மோந்தோன்", "மோந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மோந்தோள்", "மோந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மோந்தோர்கள்", "மோந்தவர்கள்", "மோந்தோர்", "மோந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மோந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மோந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோக்கேன்", "மோவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோக்கோம்", "மோக்கோங்கள்", "மோவோம்", "மோவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோக்காய்", "மோவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோக்கீர்", "மோக்கீர்கள்", "மோவீர்", "மோவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மோக்கான்", "மோவான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மோக்காள்", "மோவாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மோக்கார்", "மோக்கார்கள்", "மோவார்", "மோவார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மோக்காது", "மோவாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மோக்கா", "மோவா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["மோக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மோக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோப்போம்", "மோப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோப்பீர்", "மோப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மோப்பான்", "மோப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மோப்பாள்", "மோப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மோப்பார்", "மோப்பார்கள்", "மோப்பர்", "மோப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மோப்பது", "மோக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மோப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["மோக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["மோத்தல்", "மோக்கல்", "மோவல்", "மோக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மோக்கின்ற", "மோக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோக்கின்றேன்", "மோக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோக்கின்றோம்", "மோக்கின்றோங்கள்", "மோக்கிறோம்", "மோக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மோக்கின்றாய்", "மோக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மோக்கின்றீர்", "மோக்கின்றீர்கள்", "மோக்கிறீர்", "மோக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மோக்கின்றான்", "மோக்கின்றனன்", "மோக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மோக்கின்றாள்", "மோக்கின்றனள்", "மோக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மோக்கின்றார்", "மோக்கின்றார்கள்", "மோக்கின்றனர்", "மோக்கின்றனர்கள்", "மோக்கிறார்", "மோக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மோக்கின்றது", "மோக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மோக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("மோ",), expected,);
            },);
            QUnit.test("நில்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "திற", },],
                    ["வினய்", { label: "வினய்", வடிவு: "நில்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நில்", "நில்லு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நில்லும்", "நில்லுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நின்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["நின்ற",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நின்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நின்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நின்றோம்", "நின்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நின்றீர்", "நின்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நின்றான்", "நின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நின்றாள்", "நின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நின்றார்", "நின்றார்கள்", "நின்றனர்", "நின்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நின்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நின்றோன்", "நின்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நின்றோள்", "நின்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நின்றோர்கள்", "நின்றவர்கள்", "நின்றோர்", "நின்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நின்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நின்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிற்கேன்", "நில்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிற்கோம்", "நிற்கோங்கள்", "நில்லோம்", "நில்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிற்காய்", "நில்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிற்கீர்", "நிற்கீர்கள்", "நில்லீர்", "நில்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிற்கான்", "நில்லான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிற்காள்", "நில்லாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிற்கார்", "நிற்கார்கள்", "நில்லார்", "நில்லார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிற்காது", "நில்லாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிற்கா", "நில்லா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நிற்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நிற்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிற்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிற்போம்", "நிற்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிற்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிற்பீர்", "நிற்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிற்பான்", "நிற்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிற்பாள்", "நிற்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிற்பார்", "நிற்பார்கள்", "நிற்பர்", "நிற்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிற்பது", "நிற்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிற்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நிற்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நிற்றல்", "நிற்கல்", "நில்லல்", "நிற்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நிற்கின்ற", "நிற்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிற்கின்றேன்", "நிற்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிற்கின்றோம்", "நிற்கின்றோங்கள்", "நிற்கிறோம்", "நிற்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிற்கின்றாய்", "நிற்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிற்கின்றீர்", "நிற்கின்றீர்கள்", "நிற்கிறீர்", "நிற்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிற்கின்றான்", "நிற்கின்றனன்", "நிற்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிற்கின்றாள்", "நிற்கின்றனள்", "நிற்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிற்கின்றார்", "நிற்கின்றார்கள்", "நிற்கின்றனர்", "நிற்கின்றனர்கள்", "நிற்கிறார்", "நிற்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிற்கின்றது", "நிற்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிற்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "நிறுத்து", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்தும்", "நிறுத்துங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நிறுத்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["நிறுத்திய", "நிறுத்தின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நிறுத்தினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நிறுத்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்தினோம்", "நிறுத்தினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்தினீர்", "நிறுத்தினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிறுத்தினான்", "நிறுத்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிறுத்தினாள்", "நிறுத்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிறுத்தினார்", "நிறுத்தினார்கள்", "நிறுத்தினர்", "நிறுத்தினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிறுத்தினது", "நிறுத்தியது", "நிறுத்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிறுத்தின", "நிறுத்தியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிறுத்தியோன்", "நிறுத்தினோன்", "நிறுத்தியவன்", "நிறுத்தினவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிறுத்தியோள்", "நிறுத்தினோள்", "நிறுத்தியவள்", "நிறுத்தினவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிறுத்தியோர்கள்", "நிறுத்தினோர்கள்", "நிறுத்தியவர்கள்", "நிறுத்தினவர்கள்", "நிறுத்தியோர்", "நிறுத்தினோர்", "நிறுத்தியவர்", "நிறுத்தினவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிறுத்தியது", "நிறுத்தினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிறுத்தியவய்", "நிறுத்தினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்தோம்", "நிறுத்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்தீர்", "நிறுத்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிறுத்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிறுத்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிறுத்தார்", "நிறுத்தார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிறுத்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிறுத்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நிறுத்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நிறுத்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்துவோம்", "நிறுத்துவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்துவீர்", "நிறுத்துவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிறுத்துவான்", "நிறுத்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிறுத்துவாள்", "நிறுத்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிறுத்துவார்", "நிறுத்துவார்கள்", "நிறுத்துவர்", "நிறுத்துவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிறுத்துவது", "நிறுத்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிறுத்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நிறுத்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நிறுத்துதல்", "நிறுத்தல்", "நிறுத்துகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நிறுத்துகின்ற", "நிறுத்துகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்துகின்றேன்", "நிறுத்துகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்துகின்றோம்", "நிறுத்துகின்றோங்கள்", "நிறுத்துகிறோம்", "நிறுத்துகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நிறுத்துகின்றாய்", "நிறுத்துகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நிறுத்துகின்றீர்", "நிறுத்துகின்றீர்கள்", "நிறுத்துகிறீர்", "நிறுத்துகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நிறுத்துகின்றான்", "நிறுத்துகின்றனன்", "நிறுத்துகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நிறுத்துகின்றாள்", "நிறுத்துகின்றனள்", "நிறுத்துகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நிறுத்துகின்றார்", "நிறுத்துகின்றார்கள்", "நிறுத்துகின்றனர்", "நிறுத்துகின்றனர்கள்", "நிறுத்துகிறார்", "நிறுத்துகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நிறுத்துகின்றது", "நிறுத்துகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நிறுத்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("நில்",), expected,);
            },);
        },);
        QUnit.module("உயரும் சொல்லும்", () => {
            QUnit.test("புரி", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "புரி", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரி",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரியும்", "புரியுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["புரிந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["புரிந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["புரிந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["புரிந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரிந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரிந்தோம்", "புரிந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரிந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரிந்தீர்", "புரிந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["புரிந்தான்", "புரிந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["புரிந்தாள்", "புரிந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["புரிந்தார்", "புரிந்தார்கள்", "புரிந்தனர்", "புரிந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["புரிந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["புரிந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["புரிந்தோன்", "புரிந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["புரிந்தோள்", "புரிந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["புரிந்தோர்கள்", "புரிந்தவர்கள்", "புரிந்தோர்", "புரிந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["புரிந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["புரிந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரியேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரியோம்", "புரியோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரியாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரியீர்", "புரியீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["புரியான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["புரியாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["புரியார்", "புரியார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["புரியாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["புரியா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["புரிய",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["புரியும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரிவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரிவோம்", "புரிவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரிவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரிவீர்", "புரிவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["புரிவான்", "புரிவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["புரிவாள்", "புரிவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["புரிவார்", "புரிவார்கள்", "புரிவர்", "புரிவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["புரிவது", "புரியும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["புரிவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["புரிக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["புரிதல்", "புரியுதல்", "புரியல்", "புரிகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["புரிகின்ற", "புரிகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரிகின்றேன்", "புரிகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரிகின்றோம்", "புரிகின்றோங்கள்", "புரிகிறோம்", "புரிகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["புரிகின்றாய்", "புரிகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["புரிகின்றீர்", "புரிகின்றீர்கள்", "புரிகிறீர்", "புரிகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["புரிகின்றான்", "புரிகின்றனன்", "புரிகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["புரிகின்றாள்", "புரிகின்றனள்", "புரிகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["புரிகின்றார்", "புரிகின்றார்கள்", "புரிகின்றனர்", "புரிகின்றனர்கள்", "புரிகிறார்", "புரிகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["புரிகின்றது", "புரிகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["புரிகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("புரி",), expected,);
            },);
            QUnit.test("வாழ்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "வாழ்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்", "வாழு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழும்", "வாழுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வாழ்ந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["வாழ்ந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வாழ்ந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வாழ்ந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்ந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்ந்தோம்", "வாழ்ந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்ந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்ந்தீர்", "வாழ்ந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்ந்தான்", "வாழ்ந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்ந்தாள்", "வாழ்ந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்ந்தார்", "வாழ்ந்தார்கள்", "வாழ்ந்தனர்", "வாழ்ந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்ந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்ந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்ந்தோன்", "வாழ்ந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்ந்தோள்", "வாழ்ந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்ந்தோர்கள்", "வாழ்ந்தவர்கள்", "வாழ்ந்தோர்", "வாழ்ந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்ந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்ந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழோம்", "வாழோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழீர்", "வாழீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழார்", "வாழார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வாழ",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வாழும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்வேன்", "வாழுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்வோம்", "வாழ்வோங்கள்", "வாழுவோம்", "வாழுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்வாய்", "வாழுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்வீர்", "வாழ்வீர்கள்", "வாழுவீர்", "வாழுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்வான்", "வாழ்வன்", "வாழுவான்", "வாழுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்வாள்", "வாழ்வள்", "வாழுவாள்", "வாழுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்வார்", "வாழ்வார்கள்", "வாழ்வர்", "வாழ்வர்கள்", "வாழுவார்", "வாழுவார்கள்", "வாழுவர்", "வாழுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்வது", "வாழுவது", "வாழும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்வன", "வாழுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வாழ்க", "வாழுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வாழ்தல்", "வாழுதல்", "வாழல்", "வாழுகய்", "வாழ்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வாழ்கின்ற", "வாழுகின்ற", "வாழ்கிற", "வாழுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்கின்றேன்", "வாழுகின்றேன்", "வாழ்கிறேன்", "வாழுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்கின்றோம்", "வாழ்கின்றோங்கள்", "வாழுகின்றோம்", "வாழுகின்றோங்கள்", "வாழ்கிறோம்", "வாழ்கிறோங்கள்", "வாழுகிறோம்", "வாழுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்கின்றாய்", "வாழுகின்றாய்", "வாழ்கிறாய்", "வாழுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்கின்றீர்", "வாழ்கின்றீர்கள்", "வாழுகின்றீர்", "வாழுகின்றீர்கள்", "வாழ்கிறீர்", "வாழ்கிறீர்கள்", "வாழுகிறீர்", "வாழுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்கின்றான்", "வாழ்கின்றனன்", "வாழுகின்றான்", "வாழுகின்றனன்", "வாழ்கிறான்", "வாழுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்கின்றாள்", "வாழ்கின்றனள்", "வாழுகின்றாள்", "வாழுகின்றனள்", "வாழ்கிறாள்", "வாழுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்கின்றார்", "வாழ்கின்றார்கள்", "வாழ்கின்றனர்", "வாழ்கின்றனர்கள்", "வாழுகின்றார்", "வாழுகின்றார்கள்", "வாழுகின்றனர்", "வாழுகின்றனர்கள்", "வாழ்கிறார்", "வாழ்கிறார்கள்", "வாழுகிறார்", "வாழுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்கின்றது", "வாழுகின்றது", "வாழ்கிறது", "வாழுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்கின்றன", "வாழுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "வாழ்த்து", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்தும்", "வாழ்த்துங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வாழ்த்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["வாழ்த்திய", "வாழ்த்தின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வாழ்த்தினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வாழ்த்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்தினோம்", "வாழ்த்தினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்தினீர்", "வாழ்த்தினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்த்தினான்", "வாழ்த்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்த்தினாள்", "வாழ்த்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்த்தினார்", "வாழ்த்தினார்கள்", "வாழ்த்தினர்", "வாழ்த்தினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்த்தினது", "வாழ்த்தியது", "வாழ்த்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்த்தின", "வாழ்த்தியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்த்தியவன்", "வாழ்த்தியோன்", "வாழ்த்தினவன்", "வாழ்த்தினோன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்த்தியவள்", "வாழ்த்தியோள்", "வாழ்த்தினவள்", "வாழ்த்தினோள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்த்தியவர்", "வாழ்த்தியவர்கள்", "வாழ்த்தியோர்", "வாழ்த்தியோர்கள்", "வாழ்த்தினவர்", "வாழ்த்தினவர்கள்", "வாழ்த்தினோர்", "வாழ்த்தினோர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்த்தியது", "வாழ்த்தினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்த்தியவய்", "வாழ்த்தினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்தோம்", "வாழ்த்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்தீர்", "வாழ்த்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்த்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்த்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்த்தார்", "வாழ்த்தார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்த்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்த்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வாழ்த்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வாழ்த்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்துவோம்", "வாழ்த்துவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்துவீர்", "வாழ்த்துவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்த்துவான்", "வாழ்த்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்த்துவாள்", "வாழ்த்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்த்துவார்", "வாழ்த்துவார்கள்", "வாழ்த்துவர்", "வாழ்த்துவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்த்துவது", "வாழ்த்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்த்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வாழ்த்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வாழ்த்துதல்", "வாழ்த்தல்", "வாழ்த்துகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வாழ்த்துகின்ற", "வாழ்த்துகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்துகின்றேன்", "வாழ்த்துகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்துகின்றோம்", "வாழ்த்துகின்றோங்கள்", "வாழ்த்துகிறோம்", "வாழ்த்துகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வாழ்த்துகின்றாய்", "வாழ்த்துகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வாழ்த்துகின்றீர்", "வாழ்த்துகின்றீர்கள்", "வாழ்த்துகிறீர்", "வாழ்த்துகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வாழ்த்துகின்றான்", "வாழ்த்துகின்றனன்", "வாழ்த்துகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வாழ்த்துகின்றாள்", "வாழ்த்துகின்றனள்", "வாழ்த்துகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வாழ்த்துகின்றார்", "வாழ்த்துகின்றார்கள்", "வாழ்த்துகின்றனர்", "வாழ்த்துகின்றனர்கள்", "வாழ்த்துகிறார்", "வாழ்த்துகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வாழ்த்துகின்றது", "வாழ்த்துகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வாழ்த்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("வாழ்",), expected,);
            },);
            QUnit.test("குளிர்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "குளிர்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்", "குளிரு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிரும்", "குளிருங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["குளிர்ந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["குளிர்ந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["குளிர்ந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["குளிர்ந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்ந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிர்ந்தோம்", "குளிர்ந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்ந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிர்ந்தீர்", "குளிர்ந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["குளிர்ந்தான்", "குளிர்ந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["குளிர்ந்தாள்", "குளிர்ந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["குளிர்ந்தார்", "குளிர்ந்தார்கள்", "குளிர்ந்தனர்", "குளிர்ந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["குளிர்ந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["குளிர்ந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["குளிர்ந்தோன்", "குளிர்ந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["குளிர்ந்தோள்", "குளிர்ந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["குளிர்ந்தோர்கள்", "குளிர்ந்தவர்கள்", "குளிர்ந்தோர்", "குளிர்ந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["குளிர்ந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["குளிர்ந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிரேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிரோம்", "குளிரோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிராய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிரீர்", "குளிரீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["குளிரான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["குளிராள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["குளிரார்", "குளிரார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["குளிராது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["குளிரா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["குளிர",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["குளிரும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்வேன்", "குளிருவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிர்வோம்", "குளிர்வோங்கள்", "குளிருவோம்", "குளிருவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்வாய்", "குளிருவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிர்வீர்", "குளிர்வீர்கள்", "குளிருவீர்", "குளிருவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["குளிர்வான்", "குளிர்வன்", "குளிருவான்", "குளிருவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["குளிர்வாள்", "குளிர்வள்", "குளிருவாள்", "குளிருவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["குளிர்வார்", "குளிர்வார்கள்", "குளிர்வர்", "குளிர்வர்கள்", "குளிருவார்", "குளிருவார்கள்", "குளிருவர்", "குளிருவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["குளிர்வது", "குளிருவது", "குளிரும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["குளிர்வன", "குளிருவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["குளிர்க", "குளிருக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["குளிர்தல்", "குளிருதல்", "குளிரல்", "குளிர்கய்", "குளிருகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["குளிர்கின்ற", "குளிருகின்ற", "குளிர்கிற", "குளிருகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்கின்றேன்", "குளிருகின்றேன்", "குளிர்கிறேன்", "குளிருகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிர்கின்றோம்", "குளிர்கின்றோங்கள்", "குளிருகின்றோம்", "குளிருகின்றோங்கள்", "குளிர்கிறோம்", "குளிர்கிறோங்கள்", "குளிருகிறோம்", "குளிருகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["குளிர்கின்றாய்", "குளிருகின்றாய்", "குளிர்கிறாய்", "குளிருகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["குளிர்கின்றீர்", "குளிர்கின்றீர்கள்", "குளிருகின்றீர்", "குளிருகின்றீர்கள்", "குளிர்கிறீர்", "குளிர்கிறீர்கள்", "குளிருகிறீர்", "குளிருகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["குளிர்கின்றான்", "குளிர்கின்றனன்", "குளிருகின்றான்", "குளிருகின்றனன்", "குளிர்கிறான்", "குளிருகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["குளிர்கின்றாள்", "குளிர்கின்றனள்", "குளிருகின்றாள்", "குளிருகின்றனள்", "குளிர்கிறாள்", "குளிருகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["குளிர்கின்றார்", "குளிர்கின்றார்கள்", "குளிர்கின்றனர்", "குளிர்கின்றனர்கள்", "குளிருகின்றார்", "குளிருகின்றார்கள்", "குளிருகின்றனர்", "குளிருகின்றனர்கள்", "குளிர்கிறார்", "குளிர்கிறார்கள்", "குளிருகிறார்", "குளிருகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["குளிர்கின்றது", "குளிருகின்றது", "குளிர்கிறது", "குளிருகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["குளிர்கின்றன", "குளிருகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("குளிர்",), expected,);
            },);
            QUnit.test("பயில்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "பயில்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயில்", "பயிலு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயிலும்", "பயிலுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["பயின்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["பயின்ற",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பயின்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பயின்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயின்றோம்", "பயின்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயின்றீர்", "பயின்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பயின்றான்", "பயின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பயின்றாள்", "பயின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பயின்றார்", "பயின்றார்கள்", "பயின்றனர்", "பயின்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பயின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பயின்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பயின்றோன்", "பயின்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பயின்றோள்", "பயின்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பயின்றோர்கள்", "பயின்றவர்கள்", "பயின்றோர்", "பயின்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பயின்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பயின்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயிலேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயிலோம்", "பயிலோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயிலாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயிலீர்", "பயிலீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பயிலான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பயிலாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பயிலார்", "பயிலார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பயிலாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பயிலா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["பயில",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["பயிலும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயில்வேன்", "பயிலுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயில்வோம்", "பயில்வோங்கள்", "பயிலுவோம்", "பயிலுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயில்வாய்", "பயிலுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயில்வீர்", "பயில்வீர்கள்", "பயிலுவீர்", "பயிலுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பயில்வான்", "பயில்வன்", "பயிலுவான்", "பயிலுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பயில்வாள்", "பயில்வள்", "பயிலுவாள்", "பயிலுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பயில்வார்", "பயில்வார்கள்", "பயில்வர்", "பயில்வர்கள்", "பயிலுவார்", "பயிலுவார்கள்", "பயிலுவர்", "பயிலுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பயில்வது", "பயிலுவது", "பயிலும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பயில்வன", "பயிலுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["பயில்க", "பயிலுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["பயிற்றல்", "பயிலுதல்", "பயிலல்", "பயில்கய்", "பயிலுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["பயில்கின்ற", "பயிலுகின்ற", "பயில்கிற", "பயிலுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயில்கின்றேன்", "பயிலுகின்றேன்", "பயில்கிறேன்", "பயிலுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயில்கின்றோம்", "பயில்கின்றோங்கள்", "பயிலுகின்றோம்", "பயிலுகின்றோங்கள்", "பயில்கிறோம்", "பயில்கிறோங்கள்", "பயிலுகிறோம்", "பயிலுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பயில்கின்றாய்", "பயிலுகின்றாய்", "பயில்கிறாய்", "பயிலுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பயில்கின்றீர்", "பயில்கின்றீர்கள்", "பயிலுகின்றீர்", "பயிலுகின்றீர்கள்", "பயில்கிறீர்", "பயில்கிறீர்கள்", "பயிலுகிறீர்", "பயிலுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பயில்கின்றான்", "பயில்கின்றனன்", "பயிலுகின்றான்", "பயிலுகின்றனன்", "பயில்கிறான்", "பயிலுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பயில்கின்றாள்", "பயில்கின்றனள்", "பயிலுகின்றாள்", "பயிலுகின்றனள்", "பயில்கிறாள்", "பயிலுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பயில்கின்றார்", "பயில்கின்றார்கள்", "பயில்கின்றனர்", "பயில்கின்றனர்கள்", "பயிலுகின்றார்", "பயிலுகின்றார்கள்", "பயிலுகின்றனர்", "பயிலுகின்றனர்கள்", "பயில்கிறார்", "பயில்கிறார்கள்", "பயிலுகிறார்", "பயிலுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பயில்கின்றது", "பயிலுகின்றது", "பயில்கிறது", "பயிலுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பயில்கின்றன", "பயிலுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("பயில்",), expected,);
            },);
            QUnit.test("ஆள்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "ஆள்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆள்", "ஆளு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆளும்", "ஆளுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஆண்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆண்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆண்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆண்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆண்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆண்டோம்", "ஆண்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆண்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆண்டீர்", "ஆண்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆண்டான்", "ஆண்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆண்டாள்", "ஆண்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆண்டார்", "ஆண்டார்கள்", "ஆண்டனர்", "ஆண்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆண்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆண்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆண்டோன்", "ஆண்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆண்டோள்", "ஆண்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆண்டோர்கள்", "ஆண்டவர்கள்", "ஆண்டோர்", "ஆண்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆண்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆண்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆளேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆளோம்", "ஆளோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆளாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆளீர்", "ஆளீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆளான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆளாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆளார்", "ஆளார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆளாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆளா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஆள",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆளும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆள்வேன்", "ஆளுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆள்வோம்", "ஆள்வோங்கள்", "ஆளுவோம்", "ஆளுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆள்வாய்", "ஆளுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆள்வீர்", "ஆள்வீர்கள்", "ஆளுவீர்", "ஆளுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆள்வான்", "ஆள்வன்", "ஆளுவான்", "ஆளுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆள்வாள்", "ஆள்வள்", "ஆளுவாள்", "ஆளுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆள்வார்", "ஆள்வார்கள்", "ஆள்வர்", "ஆள்வர்கள்", "ஆளுவார்", "ஆளுவார்கள்", "ஆளுவர்", "ஆளுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆள்வது", "ஆளுவது", "ஆளும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆள்வன", "ஆளுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஆள்க", "ஆளுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஆட்டல்", "ஆளல்", "ஆளுதல்", "ஆள்கய்", "ஆளுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆள்கின்ற", "ஆளுகின்ற", "ஆள்கிற", "ஆளுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆள்கின்றேன்", "ஆளுகின்றேன்", "ஆள்கிறேன்", "ஆளுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆள்கின்றோம்", "ஆள்கின்றோங்கள்", "ஆளுகின்றோம்", "ஆளுகின்றோங்கள்", "ஆள்கிறோம்", "ஆள்கிறோங்கள்", "ஆளுகிறோம்", "ஆளுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆள்கின்றாய்", "ஆளுகின்றாய்", "ஆள்கிறாய்", "ஆளுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆள்கின்றீர்", "ஆள்கின்றீர்கள்", "ஆளுகின்றீர்", "ஆளுகின்றீர்கள்", "ஆள்கிறீர்", "ஆள்கிறீர்கள்", "ஆளுகிறீர்", "ஆளுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆள்கின்றான்", "ஆள்கின்றனன்", "ஆளுகின்றான்", "ஆளுகின்றனன்", "ஆள்கிறான்", "ஆளுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆள்கின்றாள்", "ஆள்கின்றனள்", "ஆளுகின்றாள்", "ஆளுகின்றனள்", "ஆள்கிறாள்", "ஆளுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆள்கின்றார்", "ஆள்கின்றார்கள்", "ஆள்கின்றனர்", "ஆள்கின்றனர்கள்", "ஆளுகின்றார்", "ஆளுகின்றார்கள்", "ஆளுகின்றனர்", "ஆளுகின்றனர்கள்", "ஆள்கிறார்", "ஆள்கிறார்கள்", "ஆளுகிறார்", "ஆளுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆள்கின்றது", "ஆளுகின்றது", "ஆள்கிறது", "ஆளுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆள்கின்றன", "ஆளுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("ஆள்",), expected,);
            },);
            QUnit.test("செல்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "செல்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்", "செல்லு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்லும்", "செல்லுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சென்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["சென்ற",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சென்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சென்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சென்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சென்றோம்", "சென்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சென்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சென்றீர்", "சென்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சென்றான்", "சென்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சென்றாள்", "சென்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சென்றார்", "சென்றார்கள்", "சென்றனர்", "சென்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சென்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சென்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சென்றோன்", "சென்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சென்றோள்", "சென்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சென்றோர்கள்", "சென்றவர்கள்", "சென்றோர்", "சென்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சென்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சென்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்லோம்", "செல்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்லீர்", "செல்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செல்லான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செல்லாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செல்லார்", "செல்லார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செல்லாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செல்லா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["செல்ல",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["செல்லும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்வேன்", "செல்லுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்வோம்", "செல்வோங்கள்", "செல்லுவோம்", "செல்லுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்வாய்", "செல்லுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்வீர்", "செல்வீர்கள்", "செல்லுவீர்", "செல்லுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செல்வான்", "செல்வன்", "செல்லுவான்", "செல்லுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செல்வாள்", "செல்வள்", "செல்லுவாள்", "செல்லுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செல்வார்", "செல்வார்கள்", "செல்வர்", "செல்வர்கள்", "செல்லுவார்", "செல்லுவார்கள்", "செல்லுவர்", "செல்லுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செல்வது", "செல்லுவது", "செல்லும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செல்வன", "செல்லுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["செல்க", "செல்லுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["செற்றல்", "செல்லல்", "செல்லுதல்", "செல்கய்", "செல்லுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["செல்கின்ற", "செல்லுகின்ற", "செல்கிற", "செல்லுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்கின்றேன்", "செல்லுகின்றேன்", "செல்கிறேன்", "செல்லுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்கின்றோம்", "செல்கின்றோங்கள்", "செல்லுகின்றோம்", "செல்லுகின்றோங்கள்", "செல்கிறோம்", "செல்கிறோங்கள்", "செல்லுகிறோம்", "செல்லுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செல்கின்றாய்", "செல்லுகின்றாய்", "செல்கிறாய்", "செல்லுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செல்கின்றீர்", "செல்கின்றீர்கள்", "செல்லுகின்றீர்", "செல்லுகின்றீர்கள்", "செல்கிறீர்", "செல்கிறீர்கள்", "செல்லுகிறீர்", "செல்லுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செல்கின்றான்", "செல்கின்றனன்", "செல்லுகின்றான்", "செல்லுகின்றனன்", "செல்கிறான்", "செல்லுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செல்கின்றாள்", "செல்கின்றனள்", "செல்லுகின்றாள்", "செல்லுகின்றனள்", "செல்கிறாள்", "செல்லுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செல்கின்றார்", "செல்கின்றார்கள்", "செல்கின்றனர்", "செல்கின்றனர்கள்", "செல்லுகின்றார்", "செல்லுகின்றார்கள்", "செல்லுகின்றனர்", "செல்லுகின்றனர்கள்", "செல்கிறார்", "செல்கிறார்கள்", "செல்லுகிறார்", "செல்லுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செல்கின்றது", "செல்லுகின்றது", "செல்கிறது", "செல்லுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செல்கின்றன", "செல்லுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "செலுத்து", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்தும்", "செலுத்துங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["செலுத்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["செலுத்திய", "செலுத்தின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["செலுத்தினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["செலுத்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்தினோம்", "செலுத்தினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்தினீர்", "செலுத்தினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செலுத்தினான்", "செலுத்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செலுத்தினாள்", "செலுத்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செலுத்தினார்", "செலுத்தினார்கள்", "செலுத்தினர்", "செலுத்தினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செலுத்தினது", "செலுத்தியது", "செலுத்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செலுத்தின", "செலுத்தியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செலுத்தியோன்", "செலுத்தினோன்", "செலுத்தியவன்", "செலுத்தினவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செலுத்தியோள்", "செலுத்தினோள்", "செலுத்தியவள்", "செலுத்தினவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செலுத்தியோர்கள்", "செலுத்தினோர்கள்", "செலுத்தியவர்கள்", "செலுத்தினவர்கள்", "செலுத்தியோர்", "செலுத்தினோர்", "செலுத்தியவர்", "செலுத்தினவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செலுத்தியது", "செலுத்தினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செலுத்தியவய்", "செலுத்தினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்தோம்", "செலுத்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்தீர்", "செலுத்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செலுத்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செலுத்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செலுத்தார்", "செலுத்தார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செலுத்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செலுத்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["செலுத்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["செலுத்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்துவோம்", "செலுத்துவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்துவீர்", "செலுத்துவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செலுத்துவான்", "செலுத்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செலுத்துவாள்", "செலுத்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செலுத்துவார்", "செலுத்துவார்கள்", "செலுத்துவர்", "செலுத்துவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செலுத்துவது", "செலுத்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செலுத்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["செலுத்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["செலுத்தல்", "செலுத்துதல்", "செலுத்துகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["செலுத்துகின்ற", "செலுத்துகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்துகின்றேன்", "செலுத்துகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்துகின்றோம்", "செலுத்துகின்றோங்கள்", "செலுத்துகிறோம்", "செலுத்துகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செலுத்துகின்றாய்", "செலுத்துகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செலுத்துகின்றீர்", "செலுத்துகின்றீர்கள்", "செலுத்துகிறீர்", "செலுத்துகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செலுத்துகின்றான்", "செலுத்துகின்றனன்", "செலுத்துகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செலுத்துகின்றாள்", "செலுத்துகின்றனள்", "செலுத்துகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செலுத்துகின்றார்", "செலுத்துகின்றார்கள்", "செலுத்துகின்றனர்", "செலுத்துகின்றனர்கள்", "செலுத்துகிறார்", "செலுத்துகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செலுத்துகின்றது", "செலுத்துகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செலுத்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("செல்",), expected,);
            },);
            QUnit.test("கொள்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "கொள்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்", "கொள்ளு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்ளும்", "கொள்ளுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["கொண்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["கொண்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கொண்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கொண்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொண்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொண்டோம்", "கொண்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொண்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொண்டீர்", "கொண்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கொண்டான்", "கொண்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கொண்டாள்", "கொண்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கொண்டார்", "கொண்டார்கள்", "கொண்டனர்", "கொண்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கொண்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கொண்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கொண்டோன்", "கொண்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கொண்டோள்", "கொண்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கொண்டோர்கள்", "கொண்டவர்கள்", "கொண்டோர்", "கொண்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கொண்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கொண்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்ளேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்ளோம்", "கொள்ளோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்ளாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்ளீர்", "கொள்ளீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கொள்ளான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கொள்ளாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கொள்ளார்", "கொள்ளார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கொள்ளாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கொள்ளா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["கொள்ள",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கொள்ளும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்வேன்", "கொள்ளுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்வோம்", "கொள்வோங்கள்", "கொள்ளுவோம்", "கொள்ளுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்வாய்", "கொள்ளுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்வீர்", "கொள்வீர்கள்", "கொள்ளுவீர்", "கொள்ளுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கொள்வான்", "கொள்வன்", "கொள்ளுவான்", "கொள்ளுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கொள்வாள்", "கொள்வள்", "கொள்ளுவாள்", "கொள்ளுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கொள்வார்", "கொள்வார்கள்", "கொள்வர்", "கொள்வர்கள்", "கொள்ளுவார்", "கொள்ளுவார்கள்", "கொள்ளுவர்", "கொள்ளுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கொள்வது", "கொள்ளுவது", "கொள்ளும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கொள்வன", "கொள்ளுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["கொள்க", "கொள்ளுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["கொட்டல்", "கொள்ளல்", "கொள்ளுதல்", "கொள்கய்", "கொள்ளுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கொள்கின்ற", "கொள்ளுகின்ற", "கொள்கிற", "கொள்ளுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்கின்றேன்", "கொள்ளுகின்றேன்", "கொள்கிறேன்", "கொள்ளுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்கின்றோம்", "கொள்கின்றோங்கள்", "கொள்ளுகின்றோம்", "கொள்ளுகின்றோங்கள்", "கொள்கிறோம்", "கொள்கிறோங்கள்", "கொள்ளுகிறோம்", "கொள்ளுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கொள்கின்றாய்", "கொள்ளுகின்றாய்", "கொள்கிறாய்", "கொள்ளுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கொள்கின்றீர்", "கொள்கின்றீர்கள்", "கொள்ளுகின்றீர்", "கொள்ளுகின்றீர்கள்", "கொள்கிறீர்", "கொள்கிறீர்கள்", "கொள்ளுகிறீர்", "கொள்ளுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கொள்கின்றான்", "கொள்கின்றனன்", "கொள்ளுகின்றான்", "கொள்ளுகின்றனன்", "கொள்கிறான்", "கொள்ளுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கொள்கின்றாள்", "கொள்கின்றனள்", "கொள்ளுகின்றாள்", "கொள்ளுகின்றனள்", "கொள்கிறாள்", "கொள்ளுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கொள்கின்றார்", "கொள்கின்றார்கள்", "கொள்கின்றனர்", "கொள்கின்றனர்கள்", "கொள்ளுகின்றார்", "கொள்ளுகின்றார்கள்", "கொள்ளுகின்றனர்", "கொள்ளுகின்றனர்கள்", "கொள்கிறார்", "கொள்கிறார்கள்", "கொள்ளுகிறார்", "கொள்ளுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கொள்கின்றது", "கொள்ளுகின்றது", "கொள்கிறது", "கொள்ளுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கொள்கின்றன", "கொள்ளுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("கொள்",), expected,);
            },);
            QUnit.test("சொல்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "சொல்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "சொல்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்", "சொல்லு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லும்", "சொல்லுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சொல்லி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["சொல்லிய", "சொல்லின", "சொன்ன",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", {
                        label: "நிபந்தனய் வினயெச்சம்",
                        வடிவு: new Set(["சொல்லினால்", "சொன்னால்",],),
                    },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சொல்லினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லினேன்", "சொன்னேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லினோம்", "சொல்லினோங்கள்", "சொன்னோம்", "சொன்னோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லினாய்", "சொன்னாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லினீர்", "சொல்லினீர்கள்", "சொன்னீர்", "சொன்னீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லினான்", "சொல்லினன்", "சொன்னான்", "சொன்னனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லினாள்", "சொல்லினள்", "சொன்னாள்", "சொன்னனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லினார்", "சொல்லினார்கள்", "சொல்லினர்", "சொல்லினர்கள்", "சொன்னார்", "சொன்னார்கள்", "சொன்னனர்", "சொன்னனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லினது", "சொல்லியது", "சொல்லிற்று", "சொன்னது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லின", "சொல்லியன", "சொன்னன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொன்னோன்", "சொன்னவன்", "சொல்லினோன்", "சொல்லினவன்", "சொல்லியோன்", "சொல்லியவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொன்னோள்", "சொன்னவள்", "சொல்லினோள்", "சொல்லினவள்", "சொல்லியோள்", "சொல்லியவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொன்னோர்", "சொன்னோர்கள்", "சொன்னவர்", "சொன்னவர்கள்", "சொல்லினோர்", "சொல்லினோர்கள்", "சொல்லினவர்", "சொல்லினவர்கள்", "சொல்லியோர்", "சொல்லியோர்கள்", "சொல்லியவர்", "சொல்லியவர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொன்னது", "சொல்லினது", "சொல்லியது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொன்னவய்", "சொல்லினவய்", "சொல்லியவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லோம்", "சொல்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லீர்", "சொல்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லார்", "சொல்லார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சொல்ல",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சொல்லும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்வேன்", "சொல்லுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்வோம்", "சொல்வோங்கள்", "சொல்லுவோம்", "சொல்லுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்வாய்", "சொல்லுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்வீர்", "சொல்வீர்கள்", "சொல்லுவீர்", "சொல்லுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்வான்", "சொல்லுவான்", "சொல்வன்", "சொல்லுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்வாள்", "சொல்லுவாள்", "சொல்வள்", "சொல்லுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்வார்", "சொல்வார்கள்", "சொல்லுவார்", "சொல்லுவார்கள்", "சொல்வர்", "சொல்வர்கள்", "சொல்லுவர்", "சொல்லுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்வது", "சொல்லுவது", "சொல்லும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்வன", "சொல்லுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சொல்க", "சொல்லுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சொற்றல்", "சொல்லல்", "சொல்லுதல்", "சொல்கய்", "சொல்லுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சொல்லுகின்ற", "சொல்கின்ற", "சொல்லுகிற", "சொல்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுகின்றேன்", "சொல்கின்றேன்", "சொல்லுகிறேன்", "சொல்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுகின்றோம்", "சொல்லுகின்றோங்கள்", "சொல்கின்றோம்", "சொல்கின்றோங்கள்", "சொல்லுகிறோம்", "சொல்லுகிறோங்கள்", "சொல்கிறோம்", "சொல்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுகின்றாய்", "சொல்கின்றாய்", "சொல்லுகிறாய்", "சொல்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுகின்றீர்", "சொல்லுகின்றீர்கள்", "சொல்கின்றீர்", "சொல்கின்றீர்கள்", "சொல்லுகிறீர்", "சொல்லுகிறீர்கள்", "சொல்கிறீர்", "சொல்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லுகின்றான்", "சொல்கின்றான்", "சொல்லுகின்றனன்", "சொல்கின்றனன்", "சொல்லுகிறான்", "சொல்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லுகின்றாள்", "சொல்கின்றாள்", "சொல்லுகின்றனள்", "சொல்கின்றனள்", "சொல்லுகிறாள்", "சொல்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லுகின்றார்", "சொல்லுகின்றார்கள்", "சொல்கின்றார்", "சொல்கின்றார்கள்", "சொல்லுகின்றனர்", "சொல்லுகின்றனர்கள்", "சொல்கின்றனர்", "சொல்கின்றனர்கள்", "சொல்லுகிறார்", "சொல்லுகிறார்கள்", "சொல்கிறார்", "சொல்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லுகின்றது", "சொல்கின்றது", "சொல்லுகிறது", "சொல்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லுகின்றன", "சொல்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "சொல்லுவி", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவியும்", "சொல்லுவியுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சொல்லுவித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["சொல்லுவித்த",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சொல்லுவித்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சொல்லுவித்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவித்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவித்தோம்", "சொல்லுவித்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவித்தீர்", "சொல்லுவித்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லுவித்தான்", "சொல்லுவித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லுவித்தாள்", "சொல்லுவித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லுவித்தார்", "சொல்லுவித்தார்கள்", "சொல்லுவித்தனர்", "சொல்லுவித்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லுவித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லுவித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லுவித்தோன்", "சொல்லுவித்தவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லுவித்தோள்", "சொல்லுவித்தவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லுவித்தோர்கள்", "சொல்லுவித்தவர்கள்", "சொல்லுவித்தோர்", "சொல்லுவித்தவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லுவித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லுவித்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவிக்கேன்", "சொல்லுவியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவிக்கோம்", "சொல்லுவிக்கோங்கள்", "சொல்லுவியோம்", "சொல்லுவியோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவிக்காய்", "சொல்லுவியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவிக்கீர்", "சொல்லுவிக்கீர்கள்", "சொல்லுவியீர்", "சொல்லுவியீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லுவிக்கான்", "சொல்லுவியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லுவிக்காள்", "சொல்லுவியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லுவிக்கார்", "சொல்லுவிக்கார்கள்", "சொல்லுவியார்", "சொல்லுவியார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லுவிக்காது", "சொல்லுவியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லுவிக்கா", "சொல்லுவியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சொல்லுவிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சொல்லுவிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவிப்போம்", "சொல்லுவிப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவிப்பீர்", "சொல்லுவிப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லுவிப்பான்", "சொல்லுவிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லுவிப்பாள்", "சொல்லுவிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லுவிப்பார்", "சொல்லுவிப்பார்கள்", "சொல்லுவிப்பர்", "சொல்லுவிப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லுவிப்பது", "சொல்லுவிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லுவிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சொல்லுவிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சொல்லுவித்தல்", "சொல்லுவிக்கல்", "சொல்லுவியல்", "சொல்லுவிக்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சொல்லுவிக்கின்ற", "சொல்லுவிக்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவிக்கின்றேன்", "சொல்லுவிக்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவிக்கின்றோம்", "சொல்லுவிக்கின்றோங்கள்", "சொல்லுவிக்கிறோம்", "சொல்லுவிக்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சொல்லுவிக்கின்றாய்", "சொல்லுவிக்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சொல்லுவிக்கின்றீர்", "சொல்லுவிக்கின்றீர்கள்", "சொல்லுவிக்கிறீர்", "சொல்லுவிக்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சொல்லுவிக்கின்றான்", "சொல்லுவிக்கின்றனன்", "சொல்லுவிக்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சொல்லுவிக்கின்றாள்", "சொல்லுவிக்கின்றனள்", "சொல்லுவிக்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சொல்லுவிக்கின்றார்", "சொல்லுவிக்கின்றார்கள்", "சொல்லுவிக்கின்றனர்", "சொல்லுவிக்கின்றனர்கள்", "சொல்லுவிக்கிறார்", "சொல்லுவிக்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சொல்லுவிக்கின்றது", "சொல்லுவிக்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சொல்லுவிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("சொல்",), expected,);
            },);
        },);
        QUnit.module("செய்யும் இடுவும் தகுவும் வாவும் காணும்", () => {
            QUnit.test("அழு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "செய்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "அழு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழும்", "அழுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அழுது",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுத",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அழுதால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அழுதினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுதேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுதோம்", "அழுதோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுதாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுதீர்", "அழுதீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுதான்", "அழுதனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுதாள்", "அழுதனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுதார்", "அழுதார்கள்", "அழுதனர்", "அழுதனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுதது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுதன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுதோன்", "அழுதவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுதோள்", "அழுதவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுதோர்கள்", "அழுதவர்கள்", "அழுதோர்", "அழுதவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுதது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுதவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழோம்", "அழோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழீர்", "அழீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழார்", "அழார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அழ",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவோம்", "அழுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவீர்", "அழுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவான்", "அழுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவாள்", "அழுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவார்", "அழுவார்கள்", "அழுவர்", "அழுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவது", "அழும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["அழுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["அழல்", "அழுதல்", "அழுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுகின்ற", "அழுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுகின்றேன்", "அழுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுகின்றோம்", "அழுகின்றோங்கள்", "அழுகிறோம்", "அழுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுகின்றாய்", "அழுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுகின்றீர்", "அழுகின்றீர்கள்", "அழுகிறீர்", "அழுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுகின்றான்", "அழுகின்றனன்", "அழுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுகின்றாள்", "அழுகின்றனள்", "அழுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுகின்றார்", "அழுகின்றார்கள்", "அழுகின்றனர்", "அழுகின்றனர்கள்", "அழுகிறார்", "அழுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுகின்றது", "அழுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "அழுவி", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவியும்", "அழுவியுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அழுவித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["அழுவித்த",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அழுவித்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அழுவித்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவித்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவித்தோம்", "அழுவித்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவித்தீர்", "அழுவித்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவித்தான்", "அழுவித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவித்தாள்", "அழுவித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவித்தார்", "அழுவித்தார்கள்", "அழுவித்தனர்", "அழுவித்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவித்தோன்", "அழுவித்தவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவித்தோள்", "அழுவித்தவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவித்தோர்கள்", "அழுவித்தவர்கள்", "அழுவித்தோர்", "அழுவித்தவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவித்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்கேன்", "அழுவியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கோம்", "அழுவிக்கோங்கள்", "அழுவியோம்", "அழுவியோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்காய்", "அழுவியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கீர்", "அழுவிக்கீர்கள்", "அழுவியீர்", "அழுவியீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவிக்கான்", "அழுவியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவிக்காள்", "அழுவியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவிக்கார்", "அழுவிக்கார்கள்", "அழுவியார்", "அழுவியார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவிக்காது", "அழுவியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவிக்கா", "அழுவியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அழுவிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுவிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிப்போம்", "அழுவிப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிப்பீர்", "அழுவிப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவிப்பான்", "அழுவிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவிப்பாள்", "அழுவிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவிப்பார்", "அழுவிப்பார்கள்", "அழுவிப்பர்", "அழுவிப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவிப்பது", "அழுவிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["அழுவிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["அழுவிக்கல்", "அழுவித்தல்", "அழுவியல்", "அழுவிக்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அழுவிக்கின்ற", "அழுவிக்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்கின்றேன்", "அழுவிக்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கின்றோம்", "அழுவிக்கின்றோங்கள்", "அழுவிக்கிறோம்", "அழுவிக்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அழுவிக்கின்றாய்", "அழுவிக்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அழுவிக்கின்றீர்", "அழுவிக்கின்றீர்கள்", "அழுவிக்கிறீர்", "அழுவிக்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அழுவிக்கின்றான்", "அழுவிக்கின்றனன்", "அழுவிக்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அழுவிக்கின்றாள்", "அழுவிக்கின்றனள்", "அழுவிக்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அழுவிக்கின்றார்", "அழுவிக்கின்றார்கள்", "அழுவிக்கின்றனர்", "அழுவிக்கின்றனர்கள்", "அழுவிக்கிறார்", "அழுவிக்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அழுவிக்கின்றது", "அழுவிக்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அழுவிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("அழு",), expected,);
            },);
            QUnit.test("தொகு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இடு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "தொகு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகும்", "தொகுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தொக்கு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["தொக்க",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தொக்கால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தொக்கினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொக்கேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொக்கோம்", "தொக்கோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொக்காய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொக்கீர்", "தொக்கீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொக்கான்", "தொக்கனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொக்காள்", "தொக்கனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொக்கார்", "தொக்கார்கள்", "தொக்கனர்", "தொக்கனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொக்கது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொக்கன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொக்கோன்", "தொக்கவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொக்கோள்", "தொக்கவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொக்கோர்கள்", "தொக்கவர்கள்", "தொக்கோர்", "தொக்கவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொக்கது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொக்கவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகோம்", "தொகோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகீர்", "தொகீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகார்", "தொகார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தொக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தொகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுவோம்", "தொகுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுவீர்", "தொகுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுவான்", "தொகுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுவாள்", "தொகுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுவார்", "தொகுவார்கள்", "தொகுவர்", "தொகுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுவது", "தொகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தொகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தொக்கல்", "தொகுதல்", "தொகல்", "தொகுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தொகுகின்ற", "தொகுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுகின்றேன்", "தொகுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுகின்றோம்", "தொகுகின்றோங்கள்", "தொகுகிறோம்", "தொகுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுகின்றாய்", "தொகுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுகின்றீர்", "தொகுகின்றீர்கள்", "தொகுகிறீர்", "தொகுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுகின்றான்", "தொகுகின்றனன்", "தொகுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுகின்றாள்", "தொகுகின்றனள்", "தொகுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுகின்றார்", "தொகுகின்றார்கள்", "தொகுகின்றனர்", "தொகுகின்றனர்கள்", "தொகுகிறார்", "தொகுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுகின்றது", "தொகுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "தொகு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகும்", "தொகுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தொகுத்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["தொகுத்த",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தொகுத்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தொகுத்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுத்தோம்", "தொகுத்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுத்தீர்", "தொகுத்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுத்தான்", "தொகுத்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுத்தாள்", "தொகுத்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுத்தார்", "தொகுத்தார்கள்", "தொகுத்தனர்", "தொகுத்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுத்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுத்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுத்தோன்", "தொகுத்தவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுத்தோள்", "தொகுத்தவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுத்தோர்கள்", "தொகுத்தவர்கள்", "தொகுத்தோர்", "தொகுத்தவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுத்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுக்கேன்", "தொகேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுக்கோம்", "தொகுக்கோங்கள்", "தொகோம்", "தொகோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுக்காய்", "தொகாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுக்கீர்", "தொகுக்கீர்கள்", "தொகீர்", "தொகீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுக்கான்", "தொகான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுக்காள்", "தொகாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுக்கார்", "தொகுக்கார்கள்", "தொகார்", "தொகார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுக்காது", "தொகாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுக்கா", "தொகா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தொகுக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தொகுக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுப்போம்", "தொகுப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுப்பீர்", "தொகுப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுப்பான்", "தொகுப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுப்பாள்", "தொகுப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுப்பார்", "தொகுப்பார்கள்", "தொகுப்பர்", "தொகுப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுப்பது", "தொகுக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தொகுக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தொகுத்தல்", "தொகுக்கல்", "தொகல்", "தொகுக்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தொகுக்கின்ற", "தொகுக்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுக்கின்றேன்", "தொகுக்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுக்கின்றோம்", "தொகுக்கின்றோங்கள்", "தொகுக்கிறோம்", "தொகுக்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தொகுக்கின்றாய்", "தொகுக்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தொகுக்கின்றீர்", "தொகுக்கின்றீர்கள்", "தொகுக்கிறீர்", "தொகுக்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தொகுக்கின்றான்", "தொகுக்கின்றனன்", "தொகுக்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தொகுக்கின்றாள்", "தொகுக்கின்றனள்", "தொகுக்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தொகுக்கின்றார்", "தொகுக்கின்றார்கள்", "தொகுக்கின்றனர்", "தொகுக்கின்றனர்கள்", "தொகுக்கிறார்", "தொகுக்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தொகுக்கின்றது", "தொகுக்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தொகுக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("தொகு",), expected,);
            },);
            QUnit.test("சுடு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இடு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "சுடு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடும்", "சுடுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சுட்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுட்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சுட்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சுட்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுட்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுட்டோம்", "சுட்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுட்டீர்", "சுட்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுட்டான்", "சுட்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுட்டாள்", "சுட்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுட்டார்", "சுட்டார்கள்", "சுட்டனர்", "சுட்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுட்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுட்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுட்டோன்", "சுட்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுட்டோள்", "சுட்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுட்டோர்கள்", "சுட்டவர்கள்", "சுட்டோர்", "சுட்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுட்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுட்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடோம்", "சுடோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடீர்", "சுடீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடார்", "சுடார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சுட",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுடும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுவோம்", "சுடுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுவீர்", "சுடுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடுவான்", "சுடுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடுவாள்", "சுடுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடுவார்", "சுடுவார்கள்", "சுடுவர்", "சுடுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடுவது", "சுடும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சுடுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சுட்டல்", "சுடுதல்", "சுடல்", "சுடுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுடுகின்ற", "சுடுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுகின்றேன்", "சுடுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுகின்றோம்", "சுடுகின்றோங்கள்", "சுடுகிறோம்", "சுடுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுகின்றாய்", "சுடுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுகின்றீர்", "சுடுகின்றீர்கள்", "சுடுகிறீர்", "சுடுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடுகின்றான்", "சுடுகின்றனன்", "சுடுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடுகின்றாள்", "சுடுகின்றனள்", "சுடுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடுகின்றார்", "சுடுகின்றார்கள்", "சுடுகின்றனர்", "சுடுகின்றனர்கள்", "சுடுகிறார்", "சுடுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடுகின்றது", "சுடுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இடு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "சுடு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடும்", "சுடுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சுட்டு",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுட்ட",],), },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சுட்டால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சுட்டினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுட்டேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுட்டோம்", "சுட்டோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுட்டாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுட்டீர்", "சுட்டீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுட்டான்", "சுட்டனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுட்டாள்", "சுட்டனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுட்டார்", "சுட்டார்கள்", "சுட்டனர்", "சுட்டனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுட்டது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுட்டன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுட்டோன்", "சுட்டவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுட்டோள்", "சுட்டவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுட்டோர்கள்", "சுட்டவர்கள்", "சுட்டோர்", "சுட்டவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுட்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுட்டவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடோம்", "சுடோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடீர்", "சுடீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடார்", "சுடார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சுட",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுடும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுவோம்", "சுடுவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுவீர்", "சுடுவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடுவான்", "சுடுவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடுவாள்", "சுடுவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடுவார்", "சுடுவார்கள்", "சுடுவர்", "சுடுவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடுவது", "சுடும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடுவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சுடுக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சுட்டல்", "சுடுதல்", "சுடல்", "சுடுகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுடுகின்ற", "சுடுகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுகின்றேன்", "சுடுகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுகின்றோம்", "சுடுகின்றோங்கள்", "சுடுகிறோம்", "சுடுகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுகின்றாய்", "சுடுகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுகின்றீர்", "சுடுகின்றீர்கள்", "சுடுகிறீர்", "சுடுகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடுகின்றான்", "சுடுகின்றனன்", "சுடுகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடுகின்றாள்", "சுடுகின்றனள்", "சுடுகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடுகின்றார்", "சுடுகின்றார்கள்", "சுடுகின்றனர்", "சுடுகின்றனர்கள்", "சுடுகிறார்", "சுடுகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடுகின்றது", "சுடுகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடுகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("சுடு",), expected,);
            },);
            QUnit.test("பெறு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இடு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "பெறு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறும்", "பெறுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["பெற்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["பெற்ற",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பெற்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பெற்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெற்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெற்றோம்", "பெற்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெற்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெற்றீர்", "பெற்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பெற்றான்", "பெற்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பெற்றாள்", "பெற்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பெற்றார்", "பெற்றார்கள்", "பெற்றனர்", "பெற்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பெற்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பெற்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பெற்றோன்", "பெற்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பெற்றோள்", "பெற்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பெற்றோர்கள்", "பெற்றவர்கள்", "பெற்றோர்", "பெற்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பெற்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பெற்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறோம்", "பெறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறீர்", "பெறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பெறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பெறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பெறார்", "பெறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பெறாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பெறா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["பெற",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["பெறும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறுவோம்", "பெறுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறுவீர்", "பெறுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பெறுவான்", "பெறுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பெறுவாள்", "பெறுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பெறுவார்", "பெறுவார்கள்", "பெறுவர்", "பெறுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பெறுவது", "பெறும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பெறுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["பெறுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["பெற்றல்", "பெறுதல்", "பெறல்", "பெறுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["பெறுகின்ற", "பெறுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறுகின்றேன்", "பெறுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறுகின்றோம்", "பெறுகின்றோங்கள்", "பெறுகிறோம்", "பெறுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பெறுகின்றாய்", "பெறுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பெறுகின்றீர்", "பெறுகின்றீர்கள்", "பெறுகிறீர்", "பெறுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பெறுகின்றான்", "பெறுகின்றனன்", "பெறுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பெறுகின்றாள்", "பெறுகின்றனள்", "பெறுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பெறுகின்றார்", "பெறுகின்றார்கள்", "பெறுகின்றனர்", "பெறுகின்றனர்கள்", "பெறுகிறார்", "பெறுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பெறுகின்றது", "பெறுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பெறுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("பெறு",), expected,);
            },);
            QUnit.test("மிகு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "தகு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "மிகு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகும்", "மிகுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["மிக்கு", "மிகுந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["மிக்க", "மிகுந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", {
                        label: "நிபந்தனய் வினயெச்சம்",
                        வடிவு: new Set(["மிக்கால்", "மிகுந்தால்",],),
                    },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", {
                        label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்",
                        வடிவு: new Set(["மிக்கினும்", "மிகுந்தினும்",],),
                    },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிக்கேன்", "மிகுந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிக்கோம்", "மிக்கோங்கள்", "மிகுந்தோம்", "மிகுந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிக்காய்", "மிகுந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிக்கீர்", "மிக்கீர்கள்", "மிகுந்தீர்", "மிகுந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மிக்கான்", "மிக்கனன்", "மிகுந்தான்", "மிகுந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மிக்காள்", "மிக்கனள்", "மிகுந்தாள்", "மிகுந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மிக்கார்", "மிக்கார்கள்", "மிக்கனர்", "மிக்கனர்கள்", "மிகுந்தார்", "மிகுந்தார்கள்", "மிகுந்தனர்", "மிகுந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மிக்கது", "மிகுந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மிக்கன", "மிகுந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மிக்கோன்", "மிகுந்தோன்", "மிக்கவன்", "மிகுந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மிக்கோள்", "மிகுந்தோள்", "மிக்கவள்", "மிகுந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மிக்கோர்கள்", "மிகுந்தோர்கள்", "மிக்கவர்கள்", "மிகுந்தவர்கள்", "மிக்கோர்", "மிகுந்தோர்", "மிக்கவர்", "மிகுந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மிக்கது", "மிகுந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மிக்கவய்", "மிகுந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகோம்", "மிகோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகீர்", "மிகீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மிகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மிகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மிகார்", "மிகார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மிகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மிகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["மிக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மிகும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகுவோம்", "மிகுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகுவீர்", "மிகுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மிகுவான்", "மிகுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மிகுவாள்", "மிகுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மிகுவார்", "மிகுவார்கள்", "மிகுவர்", "மிகுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மிகுவது", "மிகும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மிகுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["மிகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["மிக்கல்", "மிகுதல்", "மிகல்", "மிகுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மிகுகின்ற", "மிகுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகுகின்றேன்", "மிகுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகுகின்றோம்", "மிகுகின்றோங்கள்", "மிகுகிறோம்", "மிகுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மிகுகின்றாய்", "மிகுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மிகுகின்றீர்", "மிகுகின்றீர்கள்", "மிகுகிறீர்", "மிகுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மிகுகின்றான்", "மிகுகின்றனன்", "மிகுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மிகுகின்றாள்", "மிகுகின்றனள்", "மிகுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மிகுகின்றார்", "மிகுகின்றார்கள்", "மிகுகின்றனர்", "மிகுகின்றனர்கள்", "மிகுகிறார்", "மிகுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மிகுகின்றது", "மிகுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மிகுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("மிகு",), expected,);
            },);
            QUnit.test("தா", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வா", },],
                    ["வினய்", { label: "வினய்", வடிவு: "தா", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தா",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தாரும்", "தாருங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["தந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தந்தோம்", "தந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தந்தீர்", "தந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தந்தான்", "தந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தந்தாள்", "தந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தந்தார்", "தந்தார்கள்", "தந்தனர்", "தந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தந்தோன்", "தந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தந்தோள்", "தந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தந்தோர்கள்", "தந்தவர்கள்", "தந்தோர்", "தந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தரேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தரோம்", "தரோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தராய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தரீர்", "தரீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தரான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தராள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தரார்", "தரார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தராது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தரா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தர",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தரும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவோம்", "தருவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவீர்", "தருவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவான்", "தருவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவாள்", "தருவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவார்", "தருவார்கள்", "தருவர்", "தருவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவது", "தரும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தருக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தரல்", "தருதல்", "தருகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தருகின்ற", "தருகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருகின்றேன்", "தருகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருகின்றோம்", "தருகின்றோங்கள்", "தருகிறோம்", "தருகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருகின்றாய்", "தருகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருகின்றீர்", "தருகின்றீர்கள்", "தருகிறீர்", "தருகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருகின்றான்", "தருகின்றனன்", "தருகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருகின்றாள்", "தருகின்றனள்", "தருகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருகின்றார்", "தருகின்றார்கள்", "தருகின்றனர்", "தருகின்றனர்கள்", "தருகிறார்", "தருகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருகின்றது", "தருகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "தருவி", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவியும்", "தருவியுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தருவித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["தருவித்த",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தருவித்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தருவித்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவித்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவித்தோம்", "தருவித்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவித்தீர்", "தருவித்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவித்தான்", "தருவித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவித்தாள்", "தருவித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவித்தார்", "தருவித்தார்கள்", "தருவித்தனர்", "தருவித்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவித்தோன்", "தருவித்தவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவித்தோள்", "தருவித்தவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவித்தோர்கள்", "தருவித்தவர்கள்", "தருவித்தோர்", "தருவித்தவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவித்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்கேன்", "தருவியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கோம்", "தருவிக்கோங்கள்", "தருவியோம்", "தருவியோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்காய்", "தருவியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கீர்", "தருவிக்கீர்கள்", "தருவியீர்", "தருவியீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவிக்கான்", "தருவியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவிக்காள்", "தருவியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவிக்கார்", "தருவிக்கார்கள்", "தருவியார்", "தருவியார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவிக்காது", "தருவியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவிக்கா", "தருவியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தருவிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தருவிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிப்போம்", "தருவிப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிப்பீர்", "தருவிப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவிப்பான்", "தருவிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவிப்பாள்", "தருவிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவிப்பார்", "தருவிப்பார்கள்", "தருவிப்பர்", "தருவிப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவிப்பது", "தருவிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தருவிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தருவிக்கல்", "தருவித்தல்", "தருவியல்", "தருவிக்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தருவிக்கின்ற", "தருவிக்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்கின்றேன்", "தருவிக்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கின்றோம்", "தருவிக்கின்றோங்கள்", "தருவிக்கிறோம்", "தருவிக்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தருவிக்கின்றாய்", "தருவிக்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தருவிக்கின்றீர்", "தருவிக்கின்றீர்கள்", "தருவிக்கிறீர்", "தருவிக்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தருவிக்கின்றான்", "தருவிக்கின்றனன்", "தருவிக்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தருவிக்கின்றாள்", "தருவிக்கின்றனள்", "தருவிக்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தருவிக்கின்றார்", "தருவிக்கின்றார்கள்", "தருவிக்கின்றனர்", "தருவிக்கின்றனர்கள்", "தருவிக்கிறார்", "தருவிக்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தருவிக்கின்றது", "தருவிக்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தருவிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("தா",), expected,);
            },);
            QUnit.test("என்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "செய்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "என்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்", "என்னு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்னும்", "என்னுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["என்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["என்ற",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["என்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["என்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்றோம்", "என்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்றீர்", "என்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்றான்", "என்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்றாள்", "என்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்றார்", "என்றார்கள்", "என்றனர்", "என்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்றோன்", "என்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்றோள்", "என்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்றோர்கள்", "என்றவர்கள்", "என்றோர்", "என்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்னேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்னோம்", "என்னோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்னாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்னீர்", "என்னீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்னான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்னாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்னார்", "என்னார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்னாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்னா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["என்ன",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["என்னும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்னுவேன்", "என்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்னுவோம்", "என்னுவோங்கள்", "என்போம்", "என்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்னுவாய்", "என்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்னுவீர்", "என்னுவீர்கள்", "என்பீர்", "என்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்னுவான்", "என்னுவன்", "என்பான்", "என்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்னுவாள்", "என்னுவள்", "என்பாள்", "என்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்னுவார்", "என்னுவார்கள்", "என்னுவர்", "என்னுவர்கள்", "என்பார்", "என்பார்கள்", "என்பர்", "என்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்னுவது", "என்பது", "என்னும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்னுவன", "என்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["என்னுக", "என்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["என்னல்", "என்னுதல்", "என்றல்", "என்கய்", "என்னுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["என்கின்ற", "என்னுகின்ற", "என்கிற", "என்னுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்கின்றேன்", "என்னுகின்றேன்", "என்கிறேன்", "என்னுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்கின்றோம்", "என்கின்றோங்கள்", "என்னுகின்றோம்", "என்னுகின்றோங்கள்", "என்கிறோம்", "என்கிறோங்கள்", "என்னுகிறோம்", "என்னுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்கின்றாய்", "என்னுகின்றாய்", "என்கிறாய்", "என்னுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்கின்றீர்", "என்கின்றீர்கள்", "என்னுகின்றீர்", "என்னுகின்றீர்கள்", "என்கிறீர்", "என்கிறீர்கள்", "என்னுகிறீர்", "என்னுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்கின்றான்", "என்னுகின்றான்", "என்கின்றனன்", "என்னுகின்றனன்", "என்கிறான்", "என்னுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்கின்றாள்", "என்னுகின்றாள்", "என்கின்றனள்", "என்னுகின்றனள்", "என்கிறாள்", "என்னுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்கின்றார்", "என்கின்றார்கள்", "என்னுகின்றார்", "என்னுகின்றார்கள்", "என்கின்றனர்", "என்கின்றனர்கள்", "என்னுகின்றனர்", "என்னுகின்றனர்கள்", "என்கிறார்", "என்கிறார்கள்", "என்னுகிறார்", "என்னுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்கின்றது", "என்னுகின்றது", "என்கிறது", "என்னுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்கின்றன", "என்னுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "என்பி", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பியும்", "என்பியுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["என்பித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["என்பித்த",],), },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["என்பித்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["என்பித்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பித்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பித்தோம்", "என்பித்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பித்தீர்", "என்பித்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்பித்தான்", "என்பித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்பித்தாள்", "என்பித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்பித்தார்", "என்பித்தார்கள்", "என்பித்தனர்", "என்பித்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்பித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்பித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்பித்தோன்", "என்பித்தவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்பித்தோள்", "என்பித்தவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்பித்தோர்கள்", "என்பித்தவர்கள்", "என்பித்தோர்", "என்பித்தவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்பித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்பித்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பிக்கேன்", "என்பியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பிக்கோம்", "என்பிக்கோங்கள்", "என்பியோம்", "என்பியோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பிக்காய்", "என்பியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பிக்கீர்", "என்பிக்கீர்கள்", "என்பியீர்", "என்பியீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்பிக்கான்", "என்பியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்பிக்காள்", "என்பியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்பிக்கார்", "என்பிக்கார்கள்", "என்பியார்", "என்பியார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்பிக்காது", "என்பியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்பிக்கா", "என்பியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["என்பிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["என்பிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பிப்போம்", "என்பிப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பிப்பீர்", "என்பிப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்பிப்பான்", "என்பிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்பிப்பாள்", "என்பிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்பிப்பார்", "என்பிப்பார்கள்", "என்பிப்பர்", "என்பிப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்பிப்பது", "என்பிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்பிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["என்பிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["என்பித்தல்", "என்பிக்கல்", "என்பியல்", "என்பிக்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["என்பிக்கின்ற", "என்பிக்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பிக்கின்றேன்", "என்பிக்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பிக்கின்றோம்", "என்பிக்கின்றோங்கள்", "என்பிக்கிறோம்", "என்பிக்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["என்பிக்கின்றாய்", "என்பிக்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["என்பிக்கின்றீர்", "என்பிக்கின்றீர்கள்", "என்பிக்கிறீர்", "என்பிக்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["என்பிக்கின்றான்", "என்பிக்கின்றனன்", "என்பிக்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["என்பிக்கின்றாள்", "என்பிக்கின்றனள்", "என்பிக்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["என்பிக்கின்றார்", "என்பிக்கின்றார்கள்", "என்பிக்கின்றனர்", "என்பிக்கின்றனர்கள்", "என்பிக்கிறார்", "என்பிக்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["என்பிக்கின்றது", "என்பிக்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["என்பிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("என்",), expected,);
            },);
            QUnit.test("உண்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "செய்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "உண்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்", "உண்ணு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்ணும்", "உண்ணுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["உண்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["உண்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உண்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உண்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்டோம்", "உண்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்டீர்", "உண்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்டான்", "உண்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்டாள்", "உண்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்டார்", "உண்டார்கள்", "உண்டனர்", "உண்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்டோன்", "உண்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்டோள்", "உண்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்டோர்கள்", "உண்டவர்கள்", "உண்டோர்", "உண்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்ணேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்ணோம்", "உண்ணோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்ணாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்ணீர்", "உண்ணீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்ணான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்ணாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்ணார்", "உண்ணார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்ணாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்ணா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["உண்ண",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உண்ணும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்ணுவேன்", "உண்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்ணுவோம்", "உண்ணுவோங்கள்", "உண்போம்", "உண்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்ணுவாய்", "உண்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்ணுவீர்", "உண்ணுவீர்கள்", "உண்பீர்", "உண்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்ணுவான்", "உண்ணுவன்", "உண்பான்", "உண்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்ணுவாள்", "உண்ணுவள்", "உண்பாள்", "உண்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்ணுவார்", "உண்ணுவார்கள்", "உண்ணுவர்", "உண்ணுவர்கள்", "உண்பார்", "உண்பார்கள்", "உண்பர்", "உண்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்ணுவது", "உண்பது", "உண்ணும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்ணுவன", "உண்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உண்ணுக", "உண்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உண்டல்", "உண்ணல்", "உண்ணுதல்", "உண்கய்", "உண்ணுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உண்கின்ற", "உண்ணுகின்ற", "உண்கிற", "உண்ணுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்கின்றேன்", "உண்ணுகின்றேன்", "உண்கிறேன்", "உண்ணுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்கின்றோம்", "உண்கின்றோங்கள்", "உண்ணுகின்றோம்", "உண்ணுகின்றோங்கள்", "உண்கிறோம்", "உண்கிறோங்கள்", "உண்ணுகிறோம்", "உண்ணுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்கின்றாய்", "உண்ணுகின்றாய்", "உண்கிறாய்", "உண்ணுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்கின்றீர்", "உண்கின்றீர்கள்", "உண்ணுகின்றீர்", "உண்ணுகின்றீர்கள்", "உண்கிறீர்", "உண்கிறீர்கள்", "உண்ணுகிறீர்", "உண்ணுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்கின்றான்", "உண்ணுகின்றான்", "உண்கின்றனன்", "உண்ணுகின்றனன்", "உண்கிறான்", "உண்ணுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்கின்றாள்", "உண்ணுகின்றாள்", "உண்கின்றனள்", "உண்ணுகின்றனள்", "உண்கிறாள்", "உண்ணுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்கின்றார்", "உண்கின்றார்கள்", "உண்ணுகின்றார்", "உண்ணுகின்றார்கள்", "உண்கின்றனர்", "உண்கின்றனர்கள்", "உண்ணுகின்றனர்", "உண்ணுகின்றனர்கள்", "உண்கிறார்", "உண்கிறார்கள்", "உண்ணுகிறார்", "உண்ணுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்கின்றது", "உண்ணுகின்றது", "உண்கிறது", "உண்ணுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்கின்றன", "உண்ணுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([
                        { label: "வினய் வடிவு", children: new Map([
                            ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                            ["வினய்", { label: "வினய்", வடிவு: "உண்பி", },],
                            ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பி",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பியும்", "உண்பியுங்கள்",],), },],
                            ],), },],
                            ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["உண்பித்து",],), },],
                            ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["உண்பித்த",],), },],
                            ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உண்பித்தால்",],), },],
                            ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["உண்பித்தினும்",],), },],
                            ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பித்தேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பித்தோம்", "உண்பித்தோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பித்தாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பித்தீர்", "உண்பித்தீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்பித்தான்", "உண்பித்தனன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்பித்தாள்", "உண்பித்தனள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்பித்தார்", "உண்பித்தார்கள்", "உண்பித்தனர்", "உண்பித்தனர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்பித்தது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்பித்தன",],), },],
                                ],), },],
                            ],), },],
                            ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்பித்தோன்", "உண்பித்தவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்பித்தோள்", "உண்பித்தவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்பித்தோர்கள்", "உண்பித்தவர்கள்", "உண்பித்தோர்", "உண்பித்தவர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்பித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்பித்தவய்",],), },],
                            ],), },],
                            ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பிக்கேன்", "உண்பியேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பிக்கோம்", "உண்பிக்கோங்கள்", "உண்பியோம்", "உண்பியோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பிக்காய்", "உண்பியாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பிக்கீர்", "உண்பிக்கீர்கள்", "உண்பியீர்", "உண்பியீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்பிக்கான்", "உண்பியான்",],),
                                    },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்பிக்காள்", "உண்பியாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்பிக்கார்", "உண்பிக்கார்கள்", "உண்பியார்", "உண்பியார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்பிக்காது", "உண்பியாது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்பிக்கா", "உண்பியா",],), },],
                                ],), },],
                            ],), },],
                            ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["உண்பிக்க",],), },],
                            ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உண்பிக்கும்",],), },],
                            ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பிப்பேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பிப்போம்", "உண்பிப்போங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பிப்பாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பிப்பீர்", "உண்பிப்பீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்பிப்பான்", "உண்பிப்பன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்பிப்பாள்", "உண்பிப்பள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்பிப்பார்", "உண்பிப்பார்கள்", "உண்பிப்பர்", "உண்பிப்பர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்பிப்பது", "உண்பிக்கும்",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்பிப்பன",],), },],
                                ],), },],
                            ],), },],
                            ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உண்பிக்க",],), },],
                            ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உண்பித்தல்", "உண்பிக்கல்", "உண்பியல்", "உண்பிக்கய்",],), },],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உண்பிக்கின்ற", "உண்பிக்கிற",],), },],
                            ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பிக்கின்றேன்", "உண்பிக்கிறேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பிக்கின்றோம்", "உண்பிக்கின்றோங்கள்", "உண்பிக்கிறோம்", "உண்பிக்கிறோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உண்பிக்கின்றாய்", "உண்பிக்கிறாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உண்பிக்கின்றீர்", "உண்பிக்கின்றீர்கள்", "உண்பிக்கிறீர்", "உண்பிக்கிறீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உண்பிக்கின்றான்", "உண்பிக்கின்றனன்", "உண்பிக்கிறான்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உண்பிக்கின்றாள்", "உண்பிக்கின்றனள்", "உண்பிக்கிறாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உண்பிக்கின்றார்", "உண்பிக்கின்றார்கள்", "உண்பிக்கின்றனர்", "உண்பிக்கின்றனர்கள்", "உண்பிக்கிறார்", "உண்பிக்கிறார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உண்பிக்கின்றது", "உண்பிக்கிறது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உண்பிக்கின்றன",],), },],
                                ],), },],
                            ],), },],
                        ],), },
                        { label: "வினய் வடிவு", children: new Map([
                            ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                            ["வினய்", { label: "வினய்", வடிவு: "ஊட்டு", },],
                            ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டு",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டும்", "ஊட்டுங்கள்",],), },],
                            ],), },],
                            ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஊட்டி",],), },],
                            ["போனகாலத்துப்பெயரெச்சம்", {
                                label: "போனகாலத்துப் பெயரெச்சம்",
                                வடிவு: new Set(["ஊட்டிய", "ஊட்டின",],),
                            },],
                            ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஊட்டினால்",],), },],
                            ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஊட்டினும்",],), },],
                            ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டினேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டினோம்", "ஊட்டினோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டினாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டினீர்", "ஊட்டினீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஊட்டினான்", "ஊட்டினன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஊட்டினாள்", "ஊட்டினள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஊட்டினார்", "ஊட்டினார்கள்", "ஊட்டினர்", "ஊட்டினர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஊட்டினது", "ஊட்டியது", "ஊட்டிற்று",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஊட்டின", "ஊட்டியன",],), },],
                                ],), },],
                            ],), },],
                            ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஊட்டியோன்", "ஊட்டினோன்", "ஊட்டியவன்", "ஊட்டினவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஊட்டியோள்", "ஊட்டினோள்", "ஊட்டியவள்", "ஊட்டினவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஊட்டியோர்கள்", "ஊட்டினோர்கள்", "ஊட்டியவர்கள்", "ஊட்டினவர்கள்", "ஊட்டியோர்", "ஊட்டினோர்", "ஊட்டியவர்", "ஊட்டினவர்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஊட்டியது", "ஊட்டினது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஊட்டியவய்", "ஊட்டினவய்",],), },],
                            ],), },],
                            ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டோம்", "ஊட்டோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டீர்", "ஊட்டீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஊட்டான்",],),
                                    },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஊட்டாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஊட்டார்", "ஊட்டார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஊட்டாது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஊட்டா",],), },],
                                ],), },],
                            ],), },],
                            ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஊட்ட",],), },],
                            ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஊட்டும்",],), },],
                            ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டுவேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டுவோம்", "ஊட்டுவோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டுவாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டுவீர்", "ஊட்டுவீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஊட்டுவான்", "ஊட்டுவன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஊட்டுவாள்", "ஊட்டுவள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஊட்டுவார்", "ஊட்டுவார்கள்", "ஊட்டுவர்", "ஊட்டுவர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஊட்டுவது", "ஊட்டும்",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஊட்டுவன",],), },],
                                ],), },],
                            ],), },],
                            ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஊட்டுக",],), },],
                            ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஊட்டல்", "ஊட்டுதல்", "ஊட்டுகய்",],), },],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஊட்டுகின்ற", "ஊட்டுகிற",],), },],
                            ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டுகின்றேன்", "ஊட்டுகிறேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டுகின்றோம்", "ஊட்டுகின்றோங்கள்", "ஊட்டுகிறோம்", "ஊட்டுகிறோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஊட்டுகின்றாய்", "ஊட்டுகிறாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஊட்டுகின்றீர்", "ஊட்டுகின்றீர்கள்", "ஊட்டுகிறீர்", "ஊட்டுகிறீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஊட்டுகின்றான்", "ஊட்டுகின்றனன்", "ஊட்டுகிறான்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஊட்டுகின்றாள்", "ஊட்டுகின்றனள்", "ஊட்டுகிறாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஊட்டுகின்றார்", "ஊட்டுகின்றார்கள்", "ஊட்டுகின்றனர்", "ஊட்டுகின்றனர்கள்", "ஊட்டுகிறார்", "ஊட்டுகிறார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஊட்டுகின்றது", "ஊட்டுகிறது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஊட்டுகின்றன",],), },],
                                ],), },],
                            ],), },],
                        ],), },
                    ],),],
                ],), };
                t.deepEqual(getForms("உண்",), expected,);
            },);
            QUnit.test("தின்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "செய்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "தின்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்", "தின்னு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்னும்", "தின்னுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தின்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["தின்ற",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தின்றால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தின்றினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்றேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்றோம்", "தின்றோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்றாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்றீர்", "தின்றீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தின்றான்", "தின்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தின்றாள்", "தின்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தின்றார்", "தின்றார்கள்", "தின்றனர்", "தின்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தின்றது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தின்றன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தின்றோன்", "தின்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தின்றோள்", "தின்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தின்றோர்கள்", "தின்றவர்கள்", "தின்றோர்", "தின்றவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தின்றது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தின்றவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்னேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்னோம்", "தின்னோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்னாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்னீர்", "தின்னீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தின்னான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தின்னாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தின்னார்", "தின்னார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தின்னாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தின்னா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தின்ன",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தின்னும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்னுவேன்", "தின்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்னுவோம்", "தின்னுவோங்கள்", "தின்போம்", "தின்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்னுவாய்", "தின்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்னுவீர்", "தின்னுவீர்கள்", "தின்பீர்", "தின்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தின்னுவான்", "தின்னுவன்", "தின்பான்", "தின்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தின்னுவாள்", "தின்னுவள்", "தின்பாள்", "தின்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தின்னுவார்", "தின்னுவார்கள்", "தின்னுவர்", "தின்னுவர்கள்", "தின்பார்", "தின்பார்கள்", "தின்பர்", "தின்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தின்னுவது", "தின்பது", "தின்னும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தின்னுவன", "தின்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தின்னுக", "தின்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தின்னல்", "தின்னுதல்", "தின்றல்", "தின்கய்", "தின்னுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தின்கின்ற", "தின்னுகின்ற", "தின்கிற", "தின்னுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்கின்றேன்", "தின்னுகின்றேன்", "தின்கிறேன்", "தின்னுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்கின்றோம்", "தின்கின்றோங்கள்", "தின்னுகின்றோம்", "தின்னுகின்றோங்கள்", "தின்கிறோம்", "தின்கிறோங்கள்", "தின்னுகிறோம்", "தின்னுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தின்கின்றாய்", "தின்னுகின்றாய்", "தின்கிறாய்", "தின்னுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தின்கின்றீர்", "தின்கின்றீர்கள்", "தின்னுகின்றீர்", "தின்னுகின்றீர்கள்", "தின்கிறீர்", "தின்கிறீர்கள்", "தின்னுகிறீர்", "தின்னுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தின்கின்றான்", "தின்னுகின்றான்", "தின்கின்றனன்", "தின்னுகின்றனன்", "தின்கிறான்", "தின்னுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தின்கின்றாள்", "தின்னுகின்றாள்", "தின்கின்றனள்", "தின்னுகின்றனள்", "தின்கிறாள்", "தின்னுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தின்கின்றார்", "தின்கின்றார்கள்", "தின்னுகின்றார்", "தின்னுகின்றார்கள்", "தின்கின்றனர்", "தின்கின்றனர்கள்", "தின்னுகின்றனர்", "தின்னுகின்றனர்கள்", "தின்கிறார்", "தின்கிறார்கள்", "தின்னுகிறார்", "தின்னுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தின்கின்றது", "தின்னுகின்றது", "தின்கிறது", "தின்னுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தின்கின்றன", "தின்னுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "தீற்று", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்று",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றும்", "தீற்றுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தீற்றி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["தீற்றிய", "தீற்றின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தீற்றினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தீற்றினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றினோம்", "தீற்றினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றினீர்", "தீற்றினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தீற்றினான்", "தீற்றினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தீற்றினாள்", "தீற்றினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தீற்றினார்", "தீற்றினார்கள்", "தீற்றினர்", "தீற்றினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தீற்றினது", "தீற்றியது", "தீற்றிற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தீற்றின", "தீற்றியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தீற்றியோன்", "தீற்றினோன்", "தீற்றியவன்", "தீற்றினவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தீற்றியோள்", "தீற்றினோள்", "தீற்றியவள்", "தீற்றினவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தீற்றியோர்கள்", "தீற்றினோர்கள்", "தீற்றியவர்கள்", "தீற்றினவர்கள்", "தீற்றியோர்", "தீற்றினோர்", "தீற்றியவர்", "தீற்றினவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தீற்றியது", "தீற்றினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தீற்றியவய்", "தீற்றினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றோம்", "தீற்றோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றீர்", "தீற்றீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தீற்றான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தீற்றாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தீற்றார்", "தீற்றார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தீற்றாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தீற்றா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தீற்ற",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தீற்றும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றுவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றுவோம்", "தீற்றுவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றுவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றுவீர்", "தீற்றுவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தீற்றுவான்", "தீற்றுவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தீற்றுவாள்", "தீற்றுவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தீற்றுவார்", "தீற்றுவார்கள்", "தீற்றுவர்", "தீற்றுவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தீற்றுவது", "தீற்றும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தீற்றுவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தீற்றுக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தீற்றுதல்", "தீற்றல்", "தீற்றுகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தீற்றுகின்ற", "தீற்றுகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றுகின்றேன்", "தீற்றுகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றுகின்றோம்", "தீற்றுகின்றோங்கள்", "தீற்றுகிறோம்", "தீற்றுகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தீற்றுகின்றாய்", "தீற்றுகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தீற்றுகின்றீர்", "தீற்றுகின்றீர்கள்", "தீற்றுகிறீர்", "தீற்றுகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தீற்றுகின்றான்", "தீற்றுகின்றனன்", "தீற்றுகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தீற்றுகின்றாள்", "தீற்றுகின்றனள்", "தீற்றுகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தீற்றுகின்றார்", "தீற்றுகின்றார்கள்", "தீற்றுகின்றனர்", "தீற்றுகின்றனர்கள்", "தீற்றுகிறார்", "தீற்றுகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தீற்றுகின்றது", "தீற்றுகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தீற்றுகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("தின்",), expected,);
            },);
            QUnit.test("காண்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "காண்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "காண்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்", "காணு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணும்", "காணுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["கண்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["கண்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கண்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கண்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கண்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கண்டோம்", "கண்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கண்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கண்டீர்", "கண்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கண்டான்", "கண்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கண்டாள்", "கண்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கண்டார்", "கண்டார்கள்", "கண்டனர்", "கண்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கண்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கண்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கண்டோன்", "கண்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கண்டோள்", "கண்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கண்டோர்கள்", "கண்டவர்கள்", "கண்டோர்", "கண்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கண்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கண்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணோம்", "காணோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணீர்", "காணீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காணான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காணாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காணார்", "காணார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காணாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காணா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காண",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காணும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணுவேன்", "காண்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணுவோம்", "காணுவோங்கள்", "காண்போம்", "காண்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காணுவாய்", "காண்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காணுவீர்", "காணுவீர்கள்", "காண்பீர்", "காண்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காணுவான்", "காணுவன்", "காண்பான்", "காண்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காணுவாள்", "காணுவள்", "காண்பாள்", "காண்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காணுவார்", "காணுவார்கள்", "காணுவர்", "காணுவர்கள்", "காண்பார்", "காண்பார்கள்", "காண்பர்", "காண்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காணுவது", "காண்பது", "காணும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காணுவன", "காண்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காணுக", "காண்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காணல்", "காணுதல்", "காண்டல்", "காண்கய்", "காணுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காண்கின்ற", "காணுகின்ற", "காண்கிற", "காணுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்கின்றேன்", "காணுகின்றேன்", "காண்கிறேன்", "காணுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்கின்றோம்", "காண்கின்றோங்கள்", "காணுகின்றோம்", "காணுகின்றோங்கள்", "காண்கிறோம்", "காண்கிறோங்கள்", "காணுகிறோம்", "காணுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்கின்றாய்", "காணுகின்றாய்", "காண்கிறாய்", "காணுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்கின்றீர்", "காண்கின்றீர்கள்", "காணுகின்றீர்", "காணுகின்றீர்கள்", "காண்கிறீர்", "காண்கிறீர்கள்", "காணுகிறீர்", "காணுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்கின்றான்", "காணுகின்றான்", "காண்கின்றனன்", "காணுகின்றனன்", "காண்கிறான்", "காணுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்கின்றாள்", "காணுகின்றாள்", "காண்கின்றனள்", "காணுகின்றனள்", "காண்கிறாள்", "காணுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்கின்றார்", "காண்கின்றார்கள்", "காணுகின்றார்", "காணுகின்றார்கள்", "காண்கின்றனர்", "காண்கின்றனர்கள்", "காணுகின்றனர்", "காணுகின்றனர்கள்", "காண்கிறார்", "காண்கிறார்கள்", "காணுகிறார்", "காணுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்கின்றது", "காணுகின்றது", "காண்கிறது", "காணுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்கின்றன", "காணுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([
                        { label: "வினய் வடிவு", children: new Map([
                            ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                            ["வினய்", { label: "வினய்", வடிவு: "காண்பி", },],
                            ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பி",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பியும்", "காண்பியுங்கள்",],), },],
                            ],), },],
                            ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["காண்பித்து",],), },],
                            ["போனகாலத்துப்பெயரெச்சம்", {
                                label: "போனகாலத்துப் பெயரெச்சம்",
                                வடிவு: new Set(["காண்பித்த",],),
                            },],
                            ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காண்பித்தால்",],), },],
                            ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காண்பித்தினும்",],), },],
                            ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பித்தேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பித்தோம்", "காண்பித்தோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பித்தாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பித்தீர்", "காண்பித்தீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பித்தான்", "காண்பித்தனன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பித்தாள்", "காண்பித்தனள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பித்தார்", "காண்பித்தார்கள்", "காண்பித்தனர்", "காண்பித்தனர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பித்தது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பித்தன",],), },],
                                ],), },],
                            ],), },],
                            ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பித்தோன்", "காண்பித்தவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பித்தோள்", "காண்பித்தவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பித்தோர்", "காண்பித்தோர்கள்", "காண்பித்தவர்", "காண்பித்தவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பித்தவய்",],), },],
                            ],), },],
                            ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்கேன்", "காண்பியேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கோம்", "காண்பிக்கோங்கள்", "காண்பியோம்", "காண்பியோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்காய்", "காண்பியாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கீர்", "காண்பிக்கீர்கள்", "காண்பியீர்", "காண்பியீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பிக்கான்", "காண்பியான்",],),
                                    },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பிக்காள்", "காண்பியாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பிக்கார்", "காண்பிக்கார்கள்", "காண்பியார்", "காண்பியார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பிக்காது", "காண்பியாது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பிக்கா", "காண்பியா",],), },],
                                ],), },],
                            ],), },],
                            ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காண்பிக்க",],), },],
                            ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காண்பிக்கும்",],), },],
                            ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிப்பேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிப்போம்", "காண்பிப்போங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிப்பாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிப்பீர்", "காண்பிப்பீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பிப்பான்", "காண்பிப்பன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பிப்பாள்", "காண்பிப்பள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பிப்பார்", "காண்பிப்பார்கள்", "காண்பிப்பர்", "காண்பிப்பர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பிப்பது", "காண்பிக்கும்",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பிப்பன",],), },],
                                ],), },],
                            ],), },],
                            ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காண்பிக்க",],), },],
                            ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காண்பிக்கல்", "காண்பித்தல்", "காண்பியல்", "காண்பிக்கய்",],), },],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காண்பிக்கின்ற", "காண்பிக்கிற",],), },],
                            ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்கின்றேன்", "காண்பிக்கிறேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கின்றோம்", "காண்பிக்கின்றோங்கள்", "காண்பிக்கிறோம்", "காண்பிக்கிறோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காண்பிக்கின்றாய்", "காண்பிக்கிறாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காண்பிக்கின்றீர்", "காண்பிக்கின்றீர்கள்", "காண்பிக்கிறீர்", "காண்பிக்கிறீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காண்பிக்கின்றான்", "காண்பிக்கின்றனன்", "காண்பிக்கிறான்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காண்பிக்கின்றாள்", "காண்பிக்கின்றனள்", "காண்பிக்கிறாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காண்பிக்கின்றார்", "காண்பிக்கின்றார்கள்", "காண்பிக்கின்றனர்", "காண்பிக்கின்றனர்கள்", "காண்பிக்கிறார்", "காண்பிக்கிறார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காண்பிக்கின்றது", "காண்பிக்கிறது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காண்பிக்கின்றன",],), },],
                                ],), },],
                            ],), },],
                        ],), },
                        { label: "வினய் வடிவு", children: new Map([
                            ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                            ["வினய்", { label: "வினய்", வடிவு: "காட்டு", },],
                            ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டு",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டும்", "காட்டுங்கள்",],), },],
                            ],), },],
                            ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["காட்டி",],), },],
                            ["போனகாலத்துப்பெயரெச்சம்", {
                                label: "போனகாலத்துப் பெயரெச்சம்",
                                வடிவு: new Set(["காட்டிய", "காட்டின",],),
                            },],
                            ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காட்டினால்",],), },],
                            ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காட்டினும்",],), },],
                            ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டினேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டினோம்", "காட்டினோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டினாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டினீர்", "காட்டினீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டினான்", "காட்டினன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டினாள்", "காட்டினள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டினார்", "காட்டினார்கள்", "காட்டினர்", "காட்டினர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டினது", "காட்டியது", "காட்டிற்று",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டின", "காட்டியன",],), },],
                                ],), },],
                            ],), },],
                            ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டினோன்", "காட்டினவன்", "காட்டியோன்", "காட்டியவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டினோள்", "காட்டினவள்", "காட்டியோள்", "காட்டியவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டினோர்", "காட்டினோர்கள்", "காட்டினவர்", "காட்டினவர்கள்", "காட்டியோர்", "காட்டியோர்கள்", "காட்டியவர்", "காட்டியவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டினது", "காட்டியது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டினவய்", "காட்டியவய்",],), },],
                            ],), },],
                            ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                            ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டோம்", "காட்டோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டீர்", "காட்டீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டான்",],),
                                    },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டார்", "காட்டார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டாது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டா",],), },],
                                ],), },],
                            ],), },],
                            ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காட்ட",],), },],
                            ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காட்டும்",],), },],
                            ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுவேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுவோம்", "காட்டுவோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுவாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுவீர்", "காட்டுவீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டுவான்", "காட்டுவன்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டுவாள்", "காட்டுவள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டுவார்", "காட்டுவார்கள்", "காட்டுவர்", "காட்டுவர்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டுவது", "காட்டும்",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டுவன",],), },],
                                ],), },],
                            ],), },],
                            ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காட்டுக",],), },],
                            ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காட்டுதல்", "காட்டல்", "காட்டுகய்",],), },],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காட்டுகின்ற", "காட்டுகிற",],), },],
                            ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                                ["தன்மய்", { label: "தன்மய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுகின்றேன்", "காட்டுகிறேன்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுகின்றோம்", "காட்டுகின்றோங்கள்", "காட்டுகிறோம்", "காட்டுகிறோங்கள்",],), },],
                                ],), },],
                                ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காட்டுகின்றாய்", "காட்டுகிறாய்",],), },],
                                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காட்டுகின்றீர்", "காட்டுகின்றீர்கள்", "காட்டுகிறீர்", "காட்டுகிறீர்கள்",],), },],
                                ],), },],
                                ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காட்டுகின்றான்", "காட்டுகின்றனன்", "காட்டுகிறான்",],), },],
                                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காட்டுகின்றாள்", "காட்டுகின்றனள்", "காட்டுகிறாள்",],), },],
                                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காட்டுகின்றார்", "காட்டுகின்றார்கள்", "காட்டுகின்றனர்", "காட்டுகின்றனர்கள்", "காட்டுகிறார்", "காட்டுகிறார்கள்",],), },],
                                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காட்டுகின்றது", "காட்டுகிறது",],), },],
                                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காட்டுகின்றன",],), },],
                                ],), },],
                            ],), },],
                        ],), },
                    ],),],
                ],), };
                t.deepEqual(getForms("காண்",), expected,);
            },);
        },);
        QUnit.module("கடயுயிரோரசய்", () => {
            QUnit.test("ஆ", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "போ", },],
                    ["வினய்", { label: "வினய்", வடிவு: "ஆ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆம்", "ஆவும்", "ஆங்கள்", "ஆவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஆய்",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆன", "ஆயின",],), },],
                    ["நிபந்தனய்வினயெச்சம்", {
                        label: "நிபந்தனய் வினயெச்சம்",
                        வடிவு: new Set(["ஆனால்", "ஆயினால்",],),
                    },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆயினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆனேன்", "ஆயினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆனோம்", "ஆனோங்கள்", "ஆயினோம்", "ஆயினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆனாய்", "ஆயினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆனீர்", "ஆனீர்கள்", "ஆயினீர்", "ஆயினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆனான்", "ஆயினான்", "ஆனனன்", "ஆயினனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆனாள்", "ஆயினாள்", "ஆனனள்", "ஆயினனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆனார்", "ஆனார்கள்", "ஆயினார்", "ஆயினார்கள்", "ஆனனர்", "ஆனனர்கள்", "ஆயினனர்", "ஆயினனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆனது", "ஆயினது", "ஆயிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆனன", "ஆயினன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆனோன்", "ஆயினோன்", "ஆனவன்", "ஆயினவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆனோள்", "ஆயினோள்", "ஆனவள்", "ஆயினவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆனோர்கள்", "ஆயினோர்கள்", "ஆனவர்கள்", "ஆயினவர்கள்", "ஆனோர்", "ஆயினோர்", "ஆனவர்", "ஆயினவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆனது", "ஆயினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆனவய்", "ஆயினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகோம்", "ஆகோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகீர்", "ஆகீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆகார்", "ஆகார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஆக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆகும்", "ஆம்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆவேன்", "ஆகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆவோம்", "ஆவோங்கள்", "ஆகுவோம்", "ஆகுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆவாய்", "ஆகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆவீர்", "ஆவீர்கள்", "ஆகுவீர்", "ஆகுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆகுவான்", "ஆவான்", "ஆகுவன்", "ஆவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆகுவாள்", "ஆவாள்", "ஆகுவள்", "ஆவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆகுவார்", "ஆகுவார்கள்", "ஆவார்", "ஆவார்கள்", "ஆகுவர்", "ஆகுவர்கள்", "ஆவர்", "ஆவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆகுவது", "ஆவது", "ஆகும்", "ஆம்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆகுவன", "ஆவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஆக", "ஆகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஆகல்", "ஆகுதல்", "ஆதல்", "ஆவல்", "ஆகய்", "ஆகுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆகின்ற", "ஆகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகின்றேன்", "ஆகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகின்றோம்", "ஆகின்றோங்கள்", "ஆகிறோம்", "ஆகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆகின்றாய்", "ஆகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆகின்றீர்", "ஆகின்றீர்கள்", "ஆகிறீர்", "ஆகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆகின்றான்", "ஆகின்றனன்", "ஆகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆகின்றாள்", "ஆகின்றனள்", "ஆகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆகின்றார்", "ஆகின்றார்கள்", "ஆகின்றனர்", "ஆகின்றனர்கள்", "ஆகிறார்", "ஆகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆகின்றது", "ஆகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "ஆக்கு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கும்", "ஆக்குங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஆக்கி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["ஆக்கிய", "ஆக்கின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆக்கினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆக்கினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கினோம்", "ஆக்கினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கினீர்", "ஆக்கினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்கினான்", "ஆக்கினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்கினாள்", "ஆக்கினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்கினார்", "ஆக்கினார்கள்", "ஆக்கினர்", "ஆக்கினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்கினது", "ஆக்கியது", "ஆக்கிற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்கின", "ஆக்கியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்கினோன்", "ஆக்கினவன்", "ஆக்கியோன்", "ஆக்கியவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்கினோள்", "ஆக்கினவள்", "ஆக்கியோள்", "ஆக்கியவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்கினோர்கள்", "ஆக்கினவர்கள்", "ஆக்கினோர்", "ஆக்கினவர்", "ஆக்கியோர்கள்", "ஆக்கியவர்கள்", "ஆக்கியோர்", "ஆக்கியவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்கினது", "ஆக்கியது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்கினவய்", "ஆக்கியவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்கேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கோம்", "ஆக்கோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்காய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்கீர்", "ஆக்கீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்கான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்காள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்கார்", "ஆக்கார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்காது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்கா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஆக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குவோம்", "ஆக்குவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குவீர்", "ஆக்குவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்குவான்", "ஆக்குவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்குவாள்", "ஆக்குவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்குவார்", "ஆக்குவார்கள்", "ஆக்குவர்", "ஆக்குவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்குவது", "ஆக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்குவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஆக்குக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஆக்கல்", "ஆக்குதல்", "ஆக்குகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆக்குகின்ற", "ஆக்குகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குகின்றேன்", "ஆக்குகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குகின்றோம்", "ஆக்குகின்றோங்கள்", "ஆக்குகிறோம்", "ஆக்குகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆக்குகின்றாய்", "ஆக்குகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆக்குகின்றீர்", "ஆக்குகின்றீர்கள்", "ஆக்குகிறீர்", "ஆக்குகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆக்குகின்றான்", "ஆக்குகின்றனன்", "ஆக்குகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆக்குகின்றாள்", "ஆக்குகின்றனள்", "ஆக்குகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆக்குகின்றார்", "ஆக்குகின்றார்கள்", "ஆக்குகின்றனர்", "ஆக்குகின்றனர்கள்", "ஆக்குகிறார்", "ஆக்குகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆக்குகின்றது", "ஆக்குகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆக்குகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("ஆ",), expected,);
            },);
            QUnit.test("நோ", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "நோ", },],
                    ["வினய்", { label: "வினய்", வடிவு: "நோ", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோ",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோம்", "நோவும்", "நோங்கள்", "நோவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நொந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["நொந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நொந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நொந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நொந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நொந்தோம்", "நொந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நொந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நொந்தீர்", "நொந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நொந்தான்", "நொந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நொந்தாள்", "நொந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நொந்தார்", "நொந்தார்கள்", "நொந்தனர்", "நொந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நொந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நொந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நொந்தோன்", "நொந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நொந்தோள்", "நொந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நொந்தோர்கள்", "நொந்தவர்கள்", "நொந்தோர்", "நொந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நொந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நொந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகோம்", "நோகோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகீர்", "நோகீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நோகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நோகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நோகார்", "நோகார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நோகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நோகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நோக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நோகும்", "நோம்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோவேன்", "நோகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோவோம்", "நோவோங்கள்", "நோகுவோம்", "நோகுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோவாய்", "நோகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோவீர்", "நோவீர்கள்", "நோகுவீர்", "நோகுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நோகுவான்", "நோவான்", "நோகுவன்", "நோவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நோகுவாள்", "நோவாள்", "நோகுவள்", "நோவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நோகுவார்", "நோகுவார்கள்", "நோவார்", "நோவார்கள்", "நோகுவர்", "நோகுவர்கள்", "நோவர்", "நோவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நோகுவது", "நோவது", "நோகும்", "நோம்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நோகுவன", "நோவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நோக", "நோகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நோகல்", "நோகுதல்", "நோதல்", "நோவல்", "நோகய்", "நோகுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நோகின்ற", "நோகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகின்றேன்", "நோகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகின்றோம்", "நோகின்றோங்கள்", "நோகிறோம்", "நோகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நோகின்றாய்", "நோகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நோகின்றீர்", "நோகின்றீர்கள்", "நோகிறீர்", "நோகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நோகின்றான்", "நோகின்றனன்", "நோகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நோகின்றாள்", "நோகின்றனள்", "நோகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நோகின்றார்", "நோகின்றார்கள்", "நோகின்றனர்", "நோகின்றனர்கள்", "நோகிறார்", "நோகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நோகின்றது", "நோகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நோகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("நோ",), expected,);
            },);
            QUnit.test("வே", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "நோ", },],
                    ["வினய்", { label: "வினய்", வடிவு: "வே", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வே",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேம்", "வேயும்", "வேங்கள்", "வேயுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வெந்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["வெந்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வெந்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வெந்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வெந்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வெந்தோம்", "வெந்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வெந்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வெந்தீர்", "வெந்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வெந்தான்", "வெந்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வெந்தாள்", "வெந்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வெந்தார்", "வெந்தார்கள்", "வெந்தனர்", "வெந்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வெந்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வெந்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வெந்தோன்", "வெந்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வெந்தோள்", "வெந்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வெந்தோர்கள்", "வெந்தவர்கள்", "வெந்தோர்", "வெந்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வெந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வெந்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகோம்", "வேகோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகீர்", "வேகீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வேகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வேகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வேகார்", "வேகார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வேகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வேகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வேக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வேகும்", "வேம்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேவேன்", "வேகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேவோம்", "வேவோங்கள்", "வேகுவோம்", "வேகுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேவாய்", "வேகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேவீர்", "வேவீர்கள்", "வேகுவீர்", "வேகுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வேகுவான்", "வேவான்", "வேகுவன்", "வேவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வேகுவாள்", "வேவாள்", "வேகுவள்", "வேவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வேகுவார்", "வேகுவார்கள்", "வேவார்", "வேவார்கள்", "வேகுவர்", "வேகுவர்கள்", "வேவர்", "வேவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வேகுவது", "வேவது", "வேகும்", "வேம்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வேகுவன", "வேவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வேக", "வேகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வேகல்", "வேகுதல்", "வேதல்", "வேயல்", "வேகய்", "வேகுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வேகின்ற", "வேகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகின்றேன்", "வேகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகின்றோம்", "வேகின்றோங்கள்", "வேகிறோம்", "வேகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வேகின்றாய்", "வேகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வேகின்றீர்", "வேகின்றீர்கள்", "வேகிறீர்", "வேகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வேகின்றான்", "வேகின்றனன்", "வேகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வேகின்றாள்", "வேகின்றனள்", "வேகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வேகின்றார்", "வேகின்றார்கள்", "வேகின்றனர்", "வேகின்றனர்கள்", "வேகிறார்", "வேகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வேகின்றது", "வேகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வேகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("வே",), expected,);
            },);
            QUnit.test("சா", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "சா", },],
                    ["வினய்", { label: "வினய்", வடிவு: "சா", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சா",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாம்", "சாவும்", "சாங்கள்", "சாவுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["செத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["செத்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["செத்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["செத்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செத்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செத்தோம்", "செத்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செத்தீர்", "செத்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செத்தான்", "செத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செத்தாள்", "செத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செத்தார்", "செத்தார்கள்", "செத்தனர்", "செத்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செத்தோன்", "செத்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செத்தோள்", "செத்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செத்தோர்கள்", "செத்தவர்கள்", "செத்தோர்", "செத்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செத்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகோம்", "சாகோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகீர்", "சாகீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சாகான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சாகாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சாகார்", "சாகார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சாகாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சாகா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சாக",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சாகும்", "சாம்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாவேன்", "சாகுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாவோம்", "சாவோங்கள்", "சாகுவோம்", "சாகுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாவாய்", "சாகுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாவீர்", "சாவீர்கள்", "சாகுவீர்", "சாகுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சாகுவான்", "சாவான்", "சாகுவன்", "சாவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சாகுவாள்", "சாவாள்", "சாகுவள்", "சாவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சாகுவார்", "சாகுவார்கள்", "சாவார்", "சாவார்கள்", "சாகுவர்", "சாகுவர்கள்", "சாவர்", "சாவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சாகுவது", "சாவது", "சாகும்", "சாம்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சாகுவன", "சாவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சாக", "சாகுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சாகல்", "சாகுதல்", "சாதல்", "சாவல்", "சாகய்", "சாகுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சாகின்ற", "சாகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகின்றேன்", "சாகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகின்றோம்", "சாகின்றோங்கள்", "சாகிறோம்", "சாகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சாகின்றாய்", "சாகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சாகின்றீர்", "சாகின்றீர்கள்", "சாகிறீர்", "சாகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சாகின்றான்", "சாகின்றனன்", "சாகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சாகின்றாள்", "சாகின்றனள்", "சாகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சாகின்றார்", "சாகின்றார்கள்", "சாகின்றனர்", "சாகின்றனர்கள்", "சாகிறார்", "சாகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சாகின்றது", "சாகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சாகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("சா",), expected,);
            },);
        },);
        QUnit.module("அடிப்படய்", () => {
            QUnit.test("அல்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "அல்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "அல்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அல்லாது", "அற்று",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["அல்லாத", "அற்ற",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அல்லால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அற்றேன்", "அல்லாதேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அற்றோம்", "அற்றோங்கள்", "அல்லாதோம்", "அல்லாதோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அற்றாய்", "அல்லாதாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அற்றீர்", "அற்றீர்கள்", "அல்லாதீர்", "அல்லாதீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அற்றான்", "அல்லாதான்", "அல்லாதனன்", "அற்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அற்றாள்", "அல்லாதாள்", "அல்லாதனள்", "அற்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அற்றார்", "அற்றார்கள்", "அல்லாதார்", "அல்லாதார்கள்", "அல்லாதனர்", "அல்லாதனர்கள்", "அற்றனர்", "அற்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அற்றது", "அல்லாதது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அற்றன", "அல்லாதன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அற்றோன்", "அல்லாதோன்", "அல்லாதவன்", "அற்றவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அற்றோள்", "அல்லாதோள்", "அல்லாதவள்", "அற்றவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அற்றோர்", "அற்றோர்கள்", "அல்லாதோர்", "அல்லாதோர்கள்", "அல்லாதவர்", "அல்லாதவர்கள்", "அற்றவர்", "அற்றவர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அற்றது", "அல்லாதது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அற்றவய்", "அல்லாதவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set([],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set([],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set([],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set([],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set([],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அல்லாது", "அற்று",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அல்லாத", "அற்ற",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அற்றேன்", "அல்லாதேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அற்றோம்", "அற்றோங்கள்", "அல்லாதோம்", "அல்லாதோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அற்றாய்", "அல்லாதாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அற்றீர்", "அற்றீர்கள்", "அல்லாதீர்", "அல்லாதீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அற்றான்", "அல்லாதான்", "அல்லாதனன்", "அற்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அற்றாள்", "அல்லாதாள்", "அல்லாதனள்", "அற்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அற்றார்", "அற்றார்கள்", "அல்லாதார்", "அல்லாதார்கள்", "அல்லாதனர்", "அல்லாதனர்கள்", "அற்றனர்", "அற்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அற்றது", "அல்லாதது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அற்றன", "அல்லாதன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அற்ற", "அல்லாத",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அற்றேன்", "அல்லாதேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அற்றோம்", "அற்றோங்கள்", "அல்லாதோம்", "அல்லாதோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அற்றாய்", "அல்லாதாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அற்றீர்", "அற்றீர்கள்", "அல்லாதீர்", "அல்லாதீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அற்றான்", "அல்லாதான்", "அல்லாதனன்", "அற்றனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அற்றாள்", "அல்லாதாள்", "அல்லாதனள்", "அற்றனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அற்றார்", "அற்றார்கள்", "அல்லாதார்", "அல்லாதார்கள்", "அல்லாதனர்", "அல்லாதனர்கள்", "அற்றனர்", "அற்றனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அற்றது", "அல்லாதது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அற்றன", "அல்லாதன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("அல்",), expected,);
            },);
            QUnit.test("இல்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இல்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "இல்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["இல்லாது",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["இல்லாத",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["இல்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["இல்லோம்", "இல்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["இல்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["இல்லீர்", "இல்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["இல்லான்", "இல்லன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["இல்லாள்", "இல்லள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["இல்லார்", "இல்லார்கள்", "இல்லர்", "இல்லர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["இல்லது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["இல்லன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["இல்லாதோன்", "இல்லாதவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["இல்லாதோள்", "இல்லாதவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["இல்லாதோர்", "இல்லாதோர்கள்", "இல்லாதவர்", "இல்லாதவர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["இல்லாதது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["இல்லாதவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set([],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set([],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set([],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set([],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set([],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["இல்லாது",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["இல்லாத",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["இல்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["இல்லோம்", "இல்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["இல்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["இல்லீர்", "இல்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["இல்லான்", "இல்லன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["இல்லாள்", "இல்லள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["இல்லார்", "இல்லார்கள்", "இல்லர்", "இல்லர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["இல்லது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["இல்லன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set([],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set([],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["இல்லாத",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["இல்லேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["இல்லோம்", "இல்லோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["இல்லாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["இல்லீர்", "இல்லீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["இல்லான்", "இல்லன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["இல்லாள்", "இல்லள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["இல்லார்", "இல்லார்கள்", "இல்லர்", "இல்லர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["இல்லது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["இல்லன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("இல்",), expected,);
            },);
            QUnit.test("உள்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உள்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "உள்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set([],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set([],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set([],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set([],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set([],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set([],), },],
                        ],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set([],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set([],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set([],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set([],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set([],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set([],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set([],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set([],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set([],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set([],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set([],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set([],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set([],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உள்ள",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உள்ளேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உள்ளோம்", "உள்ளோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உள்ளாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உள்ளீர்", "உள்ளீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உள்ளான்", "உள்ளன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உள்ளாள்", "உள்ளள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உள்ளார்", "உள்ளார்கள்", "உள்ளர்", "உள்ளர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உள்ளது", "உண்டு",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உள்ளன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["உள்க", "உள்ளுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["உள்ளுதல்", "உள்ளல்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["உள்ள",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உள்ளேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உள்ளோம்", "உள்ளோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["உள்ளாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["உள்ளீர்", "உள்ளீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["உள்ளான்", "உள்ளன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["உள்ளாள்", "உள்ளள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["உள்ளார்", "உள்ளார்கள்", "உள்ளர்", "உள்ளர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["உள்ளது", "உண்டு",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["உள்ளன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("உள்",), expected,);
            },);
        },);
    },);
    QUnit.module("With ambiguous இனம்", () => {
        QUnit.module("படு", () => {
            QUnit.test("இனமில்லா படு", t => {
                t.throws(() => getForms("படு",), err => err instanceof Error &&
                    /^Multiple வினய் classes possible for படு: .*. Select one.$/v.test(err.message,),);
            },);
            QUnit.test("இடு இனத்தில் படு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இடு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "படு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படும்", "படுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["பட்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["பட்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பட்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பட்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பட்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பட்டோம்", "பட்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பட்டீர்", "பட்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பட்டான்", "பட்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பட்டாள்", "பட்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பட்டார்", "பட்டார்கள்", "பட்டனர்", "பட்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பட்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பட்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பட்டோன்", "பட்டவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பட்டோள்", "பட்டவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பட்டோர்கள்", "பட்டவர்கள்", "பட்டோர்", "பட்டவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பட்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பட்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படோம்", "படோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படீர்", "படீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படார்", "படார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["பட",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுவோம்", "படுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுவீர்", "படுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுவான்", "படுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுவாள்", "படுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுவார்", "படுவார்கள்", "படுவர்", "படுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுவது", "படும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["படுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["பட்டல்", "படுதல்", "படல்", "படுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுகின்ற", "படுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுகின்றேன்", "படுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுகின்றோம்", "படுகின்றோங்கள்", "படுகிறோம்", "படுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுகின்றாய்", "படுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுகின்றீர்", "படுகின்றீர்கள்", "படுகிறீர்", "படுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுகின்றான்", "படுகின்றனன்", "படுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுகின்றாள்", "படுகின்றனள்", "படுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுகின்றார்", "படுகின்றார்கள்", "படுகின்றனர்", "படுகின்றனர்கள்", "படுகிறார்", "படுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுகின்றது", "படுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுகின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "படுத்து", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தும்", "படுத்துங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["படுத்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["படுத்திய", "படுத்தின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["படுத்தினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["படுத்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தினோம்", "படுத்தினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தினீர்", "படுத்தினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்தினான்", "படுத்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்தினாள்", "படுத்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்தினார்", "படுத்தினார்கள்", "படுத்தினர்", "படுத்தினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்தினது", "படுத்தியது", "படுத்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்தின", "படுத்தியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்தினோன்", "படுத்தினவன்", "படுத்தியோன்", "படுத்தியவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்தினோள்", "படுத்தினவள்", "படுத்தியோள்", "படுத்தியவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்தினோர்", "படுத்தினோர்கள்", "படுத்தினவர்", "படுத்தினவர்கள்", "படுத்தியோர்", "படுத்தியோர்கள்", "படுத்தியவர்", "படுத்தியவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்தினது", "படுத்தியது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்தினவய்", "படுத்தியவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தோம்", "படுத்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தீர்", "படுத்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்தார்", "படுத்தார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["படுத்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுத்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்துவோம்", "படுத்துவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்துவீர்", "படுத்துவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்துவான்", "படுத்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்துவாள்", "படுத்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்துவார்", "படுத்துவார்கள்", "படுத்துவர்", "படுத்துவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்துவது", "படுத்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["படுத்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["படுத்துதல்", "படுத்தல்", "படுத்துகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுத்துகின்ற", "படுத்துகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்துகின்றேன்", "படுத்துகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்துகின்றோம்", "படுத்துகின்றோங்கள்", "படுத்துகிறோம்", "படுத்துகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்துகின்றாய்", "படுத்துகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்துகின்றீர்", "படுத்துகின்றீர்கள்", "படுத்துகிறீர்", "படுத்துகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்துகின்றான்", "படுத்துகின்றனன்", "படுத்துகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்துகின்றாள்", "படுத்துகின்றனள்", "படுத்துகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்துகின்றார்", "படுத்துகின்றார்கள்", "படுத்துகின்றனர்", "படுத்துகின்றனர்கள்", "படுத்துகிறார்", "படுத்துகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்துகின்றது", "படுத்துகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },],),],
                ],), };
                t.deepEqual(getForms("படு", "இடு",), expected,);
            },);
            QUnit.test("பார் இனத்தில் படு", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "படு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படும்", "படுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["படுத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["படுத்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["படுத்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["படுத்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தோம்", "படுத்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுத்தீர்", "படுத்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்தான்", "படுத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்தாள்", "படுத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்தார்", "படுத்தார்கள்", "படுத்தனர்", "படுத்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுத்தோன்", "படுத்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுத்தோள்", "படுத்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுத்தோர்கள்", "படுத்தவர்கள்", "படுத்தோர்", "படுத்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுத்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்கேன்", "படேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கோம்", "படுக்கோங்கள்", "படோம்", "படோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்காய்", "படாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கீர்", "படுக்கீர்கள்", "படீர்", "படீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுக்கான்", "படான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுக்காள்", "படாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுக்கார்", "படுக்கார்கள்", "படார்", "படார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுக்காது", "படாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுக்கா", "படா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["படுக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுப்போம்", "படுப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுப்பீர்", "படுப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுப்பான்", "படுப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுப்பாள்", "படுப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுப்பார்", "படுப்பார்கள்", "படுப்பர்", "படுப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுப்பது", "படுக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["படுக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["படுத்தல்", "படுக்கல்", "படல்", "படுக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["படுக்கின்ற", "படுக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்கின்றேன்", "படுக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கின்றோம்", "படுக்கின்றோங்கள்", "படுக்கிறோம்", "படுக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["படுக்கின்றாய்", "படுக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["படுக்கின்றீர்", "படுக்கின்றீர்கள்", "படுக்கிறீர்", "படுக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["படுக்கின்றான்", "படுக்கின்றனன்", "படுக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["படுக்கின்றாள்", "படுக்கின்றனள்", "படுக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["படுக்கின்றார்", "படுக்கின்றார்கள்", "படுக்கின்றனர்", "படுக்கின்றனர்கள்", "படுக்கிறார்", "படுக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["படுக்கின்றது", "படுக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["படுக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("படு", "பார்",), expected,);
            },);
        },);
        QUnit.module("வய்", () => {
            QUnit.test("இனமில்லா வய்", t => {
                t.throws(() => getForms("வய்",), err => err instanceof Error &&
                    /^Multiple வினய் classes possible for வய்: .*. Select one.$/v.test(err.message,),);
            },);
            QUnit.test("செய் இனத்தில் வய்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "செய்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "வய்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்யும்", "வய்யுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வய்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வய்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வய்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்தோம்", "வய்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்தீர்", "வய்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்தான்", "வய்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்தாள்", "வய்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்தார்", "வய்தார்கள்", "வய்தனர்", "வய்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்தோன்", "வய்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்தோள்", "வய்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்தோர்கள்", "வய்தவர்கள்", "வய்தோர்", "வய்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்யேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்யோம்", "வய்யோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்யாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்யீர்", "வய்யீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்யான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்யாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்யார்", "வய்யார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்யாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்யா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வய்ய",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்யும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்வேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்வோம்", "வய்வோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்வாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்வீர்", "வய்வீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்வான்", "வய்வன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்வாள்", "வய்வள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்வார்", "வய்வார்கள்", "வய்வர்", "வய்வர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்வது", "வய்யும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்வன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வய்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வய்தல்", "வய்யல்", "வய்யுதல்", "வய்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்கின்ற", "வய்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்கின்றேன்", "வய்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்கின்றோம்", "வய்கின்றோங்கள்", "வய்கிறோம்", "வய்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்கின்றாய்", "வய்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்கின்றீர்", "வய்கின்றீர்கள்", "வய்கிறீர்", "வய்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்கின்றான்", "வய்கின்றனன்", "வய்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்கின்றாள்", "வய்கின்றனள்", "வய்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்கின்றார்", "வய்கின்றார்கள்", "வய்கின்றனர்", "வய்கின்றனர்கள்", "வய்கிறார்", "வய்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்கின்றது", "வய்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("வய்", "செய்",), expected,);
            },);
            QUnit.test("பார் இனத்தில் வய்", t => {
                const expected = { label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "வய்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்யும்", "வய்யுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வய்த்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்த்த",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வய்த்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வய்த்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்த்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்த்தோம்", "வய்த்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்த்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்த்தீர்", "வய்த்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்த்தான்", "வய்த்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்த்தாள்", "வய்த்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்த்தார்", "வய்த்தார்கள்", "வய்த்தனர்", "வய்த்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்த்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்த்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்த்தோன்", "வய்த்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்த்தோள்", "வய்த்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்த்தோர்", "வய்த்தோர்கள்", "வய்த்தவர்", "வய்த்தவர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்த்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்த்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்கேன்", "வய்யேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கோம்", "வய்க்கோங்கள்", "வய்யோம்", "வய்யோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்காய்", "வய்யாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கீர்", "வய்க்கீர்கள்", "வய்யீர்", "வய்யீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்க்கான்", "வய்யான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்க்காள்", "வய்யாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்க்கார்", "வய்க்கார்கள்", "வய்யார்", "வய்யார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்க்காது", "வய்யாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்க்கா", "வய்யா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வய்க்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்க்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்ப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்ப்போம்", "வய்ப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்ப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்ப்பீர்", "வய்ப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்ப்பான்", "வய்ப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்ப்பாள்", "வய்ப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்ப்பார்", "வய்ப்பார்கள்", "வய்ப்பர்", "வய்ப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்ப்பது", "வய்க்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்ப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வய்க்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வய்த்தல்", "வய்க்கல்", "வய்யல்", "வய்க்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வய்க்கின்ற", "வய்க்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்கின்றேன்", "வய்க்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கின்றோம்", "வய்க்கின்றோங்கள்", "வய்க்கிறோம்", "வய்க்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வய்க்கின்றாய்", "வய்க்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வய்க்கின்றீர்", "வய்க்கின்றீர்கள்", "வய்க்கிறீர்", "வய்க்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வய்க்கின்றான்", "வய்க்கின்றனன்", "வய்க்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வய்க்கின்றாள்", "வய்க்கின்றனள்", "வய்க்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வய்க்கின்றார்", "வய்க்கின்றார்கள்", "வய்க்கின்றனர்", "வய்க்கின்றனர்கள்", "வய்க்கிறார்", "வய்க்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வய்க்கின்றது", "வய்க்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வய்க்கின்றன",],), },],
                        ],), },],
                    ],), },],
                    [causativeFormsKey, new Set([],),],
                ],), };
                t.deepEqual(getForms("வய்", "பார்",), expected,);
            },);
        },);
    },);
    QUnit.module("With பிறவினய் forms", () => {
        QUnit.module("Rule0", () => {
            QUnit.test("சுடு", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "இடு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "சுடு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடும்", "சுடுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சுட்டு",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுட்ட",],), },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சுட்டால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சுட்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுட்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுட்டோம்", "சுட்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுட்டீர்", "சுட்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுட்டான்", "சுட்டனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுட்டாள்", "சுட்டனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுட்டார்", "சுட்டார்கள்", "சுட்டனர்", "சுட்டனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுட்டது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுட்டன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுட்டவன்", "சுட்டோன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுட்டவள்", "சுட்டோள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுட்டவர்", "சுட்டவர்கள்", "சுட்டோர்", "சுட்டோர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுட்டது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுட்டவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடோம்", "சுடோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடீர்", "சுடீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடார்", "சுடார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சுட",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுடும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுவோம்", "சுடுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுவீர்", "சுடுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடுவான்", "சுடுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடுவாள்", "சுடுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடுவார்", "சுடுவார்கள்", "சுடுவர்", "சுடுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடுவது", "சுடும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சுடுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சுட்டல்", "சுடுதல்", "சுடல்", "சுடுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சுடுகின்ற", "சுடுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுகின்றேன்", "சுடுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுகின்றோம்", "சுடுகின்றோங்கள்", "சுடுகிறோம்", "சுடுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சுடுகின்றாய்", "சுடுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சுடுகின்றீர்", "சுடுகின்றீர்கள்", "சுடுகிறீர்", "சுடுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சுடுகின்றான்", "சுடுகின்றனன்", "சுடுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சுடுகின்றாள்", "சுடுகின்றனள்", "சுடுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சுடுகின்றார்", "சுடுகின்றார்கள்", "சுடுகின்றனர்", "சுடுகின்றனர்கள்", "சுடுகிறார்", "சுடுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சுடுகின்றது", "சுடுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சுடுகின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("சுடு",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule1", () => {
            QUnit.test("சேர்", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "சேர்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்", "சேரு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேரும்", "சேருங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சேர்த்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["சேர்த்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சேர்த்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சேர்த்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்த்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்த்தோம்", "சேர்த்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்த்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்த்தீர்", "சேர்த்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சேர்த்தான்", "சேர்த்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சேர்த்தாள்", "சேர்த்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சேர்த்தார்", "சேர்த்தார்கள்", "சேர்த்தனர்", "சேர்த்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சேர்த்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சேர்த்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சேர்த்தோன்", "சேர்த்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சேர்த்தோள்", "சேர்த்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சேர்த்தோர்கள்", "சேர்த்தவர்கள்", "சேர்த்தோர்", "சேர்த்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சேர்த்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சேர்த்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்க்கேன்", "சேரேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்க்கோம்", "சேர்க்கோங்கள்", "சேரோம்", "சேரோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்க்காய்", "சேராய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்க்கீர்", "சேர்க்கீர்கள்", "சேரீர்", "சேரீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சேர்க்கான்", "சேரான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சேர்க்காள்", "சேராள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சேர்க்கார்", "சேர்க்கார்கள்", "சேரார்", "சேரார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சேர்க்காது", "சேராது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சேர்க்கா", "சேரா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சேர்க்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சேர்க்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்ப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்ப்போம்", "சேர்ப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்ப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்ப்பீர்", "சேர்ப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சேர்ப்பான்", "சேர்ப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சேர்ப்பாள்", "சேர்ப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சேர்ப்பார்", "சேர்ப்பார்கள்", "சேர்ப்பர்", "சேர்ப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சேர்ப்பது", "சேர்க்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சேர்ப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சேர்க்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சேரல்", "சேர்க்கல்", "சேர்த்தல்", "சேர்க்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சேர்க்கின்ற", "சேர்க்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்க்கின்றேன்", "சேர்க்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்க்கின்றோம்", "சேர்க்கின்றோங்கள்", "சேர்க்கிறோம்", "சேர்க்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சேர்க்கின்றாய்", "சேர்க்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சேர்க்கின்றீர்", "சேர்க்கின்றீர்கள்", "சேர்க்கிறீர்", "சேர்க்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சேர்க்கின்றான்", "சேர்க்கின்றனன்", "சேர்க்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சேர்க்கின்றாள்", "சேர்க்கின்றனள்", "சேர்க்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சேர்க்கின்றார்", "சேர்க்கின்றார்கள்", "சேர்க்கின்றனர்", "சேர்க்கின்றனர்கள்", "சேர்க்கிறார்", "சேர்க்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சேர்க்கின்றது", "சேர்க்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சேர்க்கின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("சேர்",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule10", () => {
            QUnit.test("நட", t => {
                const expected = new Set([
                    { label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "நடப்பி", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பி",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பியும்", "நடப்பியுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நடப்பித்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["நடப்பித்த",],), },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நடப்பித்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நடப்பித்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பித்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பித்தோம்", "நடப்பித்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பித்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பித்தீர்", "நடப்பித்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடப்பித்தான்", "நடப்பித்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடப்பித்தாள்", "நடப்பித்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடப்பித்தார்", "நடப்பித்தார்கள்", "நடப்பித்தனர்", "நடப்பித்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடப்பித்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடப்பித்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடப்பித்தோன்", "நடப்பித்தவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடப்பித்தோள்", "நடப்பித்தவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடப்பித்தோர்கள்", "நடப்பித்தவர்கள்", "நடப்பித்தோர்", "நடப்பித்தவர்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடப்பித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடப்பித்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பிக்கேன்", "நடப்பியேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பிக்கோம்", "நடப்பிக்கோங்கள்", "நடப்பியோம்", "நடப்பியோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பிக்காய்", "நடப்பியாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பிக்கீர்", "நடப்பிக்கீர்கள்", "நடப்பியீர்", "நடப்பியீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடப்பிக்கான்", "நடப்பியான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடப்பிக்காள்", "நடப்பியாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடப்பிக்கார்", "நடப்பிக்கார்கள்", "நடப்பியார்", "நடப்பியார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடப்பிக்காது", "நடப்பியாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடப்பிக்கா", "நடப்பியா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நடப்பிக்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நடப்பிக்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பிப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பிப்போம்", "நடப்பிப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பிப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பிப்பீர்", "நடப்பிப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடப்பிப்பான்", "நடப்பிப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடப்பிப்பாள்", "நடப்பிப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடப்பிப்பார்", "நடப்பிப்பார்கள்", "நடப்பிப்பர்", "நடப்பிப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடப்பிப்பது", "நடப்பிக்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடப்பிப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நடப்பிக்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நடப்பித்தல்", "நடப்பிக்கல்", "நடப்பியல்", "நடப்பிக்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நடப்பிக்கின்ற", "நடப்பிக்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பிக்கின்றேன்", "நடப்பிக்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பிக்கின்றோம்", "நடப்பிக்கின்றோங்கள்", "நடப்பிக்கிறோம்", "நடப்பிக்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடப்பிக்கின்றாய்", "நடப்பிக்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடப்பிக்கின்றீர்", "நடப்பிக்கின்றீர்கள்", "நடப்பிக்கிறீர்", "நடப்பிக்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடப்பிக்கின்றான்", "நடப்பிக்கின்றனன்", "நடப்பிக்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடப்பிக்கின்றாள்", "நடப்பிக்கின்றனள்", "நடப்பிக்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடப்பிக்கின்றார்", "நடப்பிக்கின்றார்கள்", "நடப்பிக்கின்றனர்", "நடப்பிக்கின்றனர்கள்", "நடப்பிக்கிறார்", "நடப்பிக்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடப்பிக்கின்றது", "நடப்பிக்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடப்பிக்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },
                    { label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "நடத்து", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்து",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்தும்", "நடத்துங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நடத்தி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["நடத்திய", "நடத்தின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நடத்தினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நடத்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்தினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்தினோம்", "நடத்தினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்தினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்தினீர்", "நடத்தினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடத்தினான்", "நடத்தினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடத்தினாள்", "நடத்தினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடத்தினார்", "நடத்தினார்கள்", "நடத்தினர்", "நடத்தினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடத்தினது", "நடத்தியது", "நடத்திற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடத்தின", "நடத்தியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடத்தியவன்", "நடத்தியோன்", "நடத்தினவன்", "நடத்தினோன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடத்தியவள்", "நடத்தியோள்", "நடத்தினவள்", "நடத்தினோள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடத்தியவர்", "நடத்தியவர்கள்", "நடத்தியோர்", "நடத்தியோர்கள்", "நடத்தினவர்", "நடத்தினவர்கள்", "நடத்தினோர்", "நடத்தினோர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடத்தியது", "நடத்தினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடத்தியவய்", "நடத்தினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்தோம்", "நடத்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்தீர்", "நடத்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடத்தான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடத்தாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடத்தார்", "நடத்தார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடத்தாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடத்தா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நடத்த",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நடத்தும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்துவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்துவோம்", "நடத்துவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்துவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்துவீர்", "நடத்துவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடத்துவான்", "நடத்துவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடத்துவாள்", "நடத்துவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடத்துவார்", "நடத்துவார்கள்", "நடத்துவர்", "நடத்துவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடத்துவது", "நடத்தும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடத்துவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நடத்துக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நடத்தல்", "நடத்துதல்", "நடத்துகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நடத்துகின்ற", "நடத்துகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்துகின்றேன்", "நடத்துகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்துகின்றோம்", "நடத்துகின்றோங்கள்", "நடத்துகிறோம்", "நடத்துகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நடத்துகின்றாய்", "நடத்துகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நடத்துகின்றீர்", "நடத்துகின்றீர்கள்", "நடத்துகிறீர்", "நடத்துகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நடத்துகின்றான்", "நடத்துகின்றனன்", "நடத்துகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நடத்துகின்றாள்", "நடத்துகின்றனள்", "நடத்துகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நடத்துகின்றார்", "நடத்துகின்றார்கள்", "நடத்துகின்றனர்", "நடத்துகின்றனர்கள்", "நடத்துகிறார்", "நடத்துகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நடத்துகின்றது", "நடத்துகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நடத்துகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },
                ],);
                t.deepEqual(getForms("நட",).children.get(causativeFormsKey,), expected,);
            },);
            QUnit.test("நீள்", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "நீட்டு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டும்", "நீட்டுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["நீட்டி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["நீட்டிய", "நீட்டின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நீட்டினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["நீட்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டினோம்", "நீட்டினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டினீர்", "நீட்டினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நீட்டினான்", "நீட்டினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நீட்டினாள்", "நீட்டினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நீட்டினார்", "நீட்டினார்கள்", "நீட்டினர்", "நீட்டினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நீட்டினது", "நீட்டியது", "நீட்டிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நீட்டின", "நீட்டியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நீட்டியோன்", "நீட்டினோன்", "நீட்டியவன்", "நீட்டினவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நீட்டியோள்", "நீட்டினோள்", "நீட்டியவள்", "நீட்டினவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நீட்டியோர்கள்", "நீட்டினோர்கள்", "நீட்டியவர்கள்", "நீட்டினவர்கள்", "நீட்டியோர்", "நீட்டினோர்", "நீட்டியவர்", "நீட்டினவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நீட்டியது", "நீட்டினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நீட்டியவய்", "நீட்டினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டோம்", "நீட்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டீர்", "நீட்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நீட்டான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நீட்டாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நீட்டார்", "நீட்டார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நீட்டாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நீட்டா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["நீட்ட",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நீட்டும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டுவோம்", "நீட்டுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டுவீர்", "நீட்டுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நீட்டுவான்", "நீட்டுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நீட்டுவாள்", "நீட்டுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நீட்டுவார்", "நீட்டுவார்கள்", "நீட்டுவர்", "நீட்டுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நீட்டுவது", "நீட்டும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நீட்டுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["நீட்டுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["நீட்டுதல்", "நீட்டல்", "நீட்டுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["நீட்டுகின்ற", "நீட்டுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டுகின்றேன்", "நீட்டுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டுகின்றோம்", "நீட்டுகின்றோங்கள்", "நீட்டுகிறோம்", "நீட்டுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["நீட்டுகின்றாய்", "நீட்டுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["நீட்டுகின்றீர்", "நீட்டுகின்றீர்கள்", "நீட்டுகிறீர்", "நீட்டுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["நீட்டுகின்றான்", "நீட்டுகின்றனன்", "நீட்டுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["நீட்டுகின்றாள்", "நீட்டுகின்றனள்", "நீட்டுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["நீட்டுகின்றார்", "நீட்டுகின்றார்கள்", "நீட்டுகின்றனர்", "நீட்டுகின்றனர்கள்", "நீட்டுகிறார்", "நீட்டுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["நீட்டுகின்றது", "நீட்டுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["நீட்டுகின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("நீள்",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule11", () => {
            QUnit.test("அடு", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "அடுக்கு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்கு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்கும்", "அடுக்குங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["அடுக்கி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["அடுக்கிய", "அடுக்கின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அடுக்கினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["அடுக்கினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்கினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்கினோம்", "அடுக்கினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்கினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்கினீர்", "அடுக்கினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அடுக்கினான்", "அடுக்கினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அடுக்கினாள்", "அடுக்கினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அடுக்கினார்", "அடுக்கினார்கள்", "அடுக்கினர்", "அடுக்கினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அடுக்கினது", "அடுக்கியது", "அடுக்கிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அடுக்கின", "அடுக்கியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அடுக்கியோன்", "அடுக்கினோன்", "அடுக்கியவன்", "அடுக்கினவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அடுக்கியோள்", "அடுக்கினோள்", "அடுக்கியவள்", "அடுக்கினவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அடுக்கியோர்கள்", "அடுக்கினோர்கள்", "அடுக்கியவர்கள்", "அடுக்கினவர்கள்", "அடுக்கியோர்", "அடுக்கினோர்", "அடுக்கியவர்", "அடுக்கினவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அடுக்கியது", "அடுக்கினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அடுக்கியவய்", "அடுக்கினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்கேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்கோம்", "அடுக்கோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்காய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்கீர்", "அடுக்கீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அடுக்கான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அடுக்காள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அடுக்கார்", "அடுக்கார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அடுக்காது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அடுக்கா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["அடுக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அடுக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்குவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்குவோம்", "அடுக்குவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்குவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்குவீர்", "அடுக்குவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அடுக்குவான்", "அடுக்குவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அடுக்குவாள்", "அடுக்குவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அடுக்குவார்", "அடுக்குவார்கள்", "அடுக்குவர்", "அடுக்குவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அடுக்குவது", "அடுக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அடுக்குவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["அடுக்குக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["அடுக்குதல்", "அடுக்கல்", "அடுக்குகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["அடுக்குகின்ற", "அடுக்குகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்குகின்றேன்", "அடுக்குகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்குகின்றோம்", "அடுக்குகின்றோங்கள்", "அடுக்குகிறோம்", "அடுக்குகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["அடுக்குகின்றாய்", "அடுக்குகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["அடுக்குகின்றீர்", "அடுக்குகின்றீர்கள்", "அடுக்குகிறீர்", "அடுக்குகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["அடுக்குகின்றான்", "அடுக்குகின்றனன்", "அடுக்குகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["அடுக்குகின்றாள்", "அடுக்குகின்றனள்", "அடுக்குகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["அடுக்குகின்றார்", "அடுக்குகின்றார்கள்", "அடுக்குகின்றனர்", "அடுக்குகின்றனர்கள்", "அடுக்குகிறார்", "அடுக்குகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["அடுக்குகின்றது", "அடுக்குகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["அடுக்குகின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("அடு",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule12", () => {
            QUnit.test("காய்", t => {
                const expected = new Set([
                    { label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                        ["வினய்", { label: "வினய்", வடிவு: "காய்", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காயும்", "காயுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["காய்த்து",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["காய்த்த",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காய்த்தால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காய்த்தினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்த்தேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்த்தோம்", "காய்த்தோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்த்தாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்த்தீர்", "காய்த்தீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்த்தான்", "காய்த்தனன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்த்தாள்", "காய்த்தனள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்த்தார்", "காய்த்தார்கள்", "காய்த்தனர்", "காய்த்தனர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்த்தது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்த்தன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்த்தவன்", "காய்த்தோன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்த்தவள்", "காய்த்தோள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்த்தவர்", "காய்த்தவர்கள்", "காய்த்தோர்", "காய்த்தோர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்த்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்த்தவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்க்கேன்", "காயேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்க்கோம்", "காய்க்கோங்கள்", "காயோம்", "காயோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்க்காய்", "காயாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்க்கீர்", "காய்க்கீர்கள்", "காயீர்", "காயீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்க்கான்", "காயான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்க்காள்", "காயாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்க்கார்", "காய்க்கார்கள்", "காயார்", "காயார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்க்காது", "காயாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்க்கா", "காயா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காய்க்க",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காய்க்கும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ப்பேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ப்போம்", "காய்ப்போங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ப்பாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ப்பீர்", "காய்ப்பீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்ப்பான்", "காய்ப்பன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்ப்பாள்", "காய்ப்பள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்ப்பார்", "காய்ப்பார்கள்", "காய்ப்பர்", "காய்ப்பர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்ப்பது", "காய்க்கும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்ப்பன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காய்க்க",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காய்த்தல்", "காய்க்கல்", "காயல்", "காய்க்கய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காய்க்கின்ற", "காய்க்கிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்க்கின்றேன்", "காய்க்கிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்க்கின்றோம்", "காய்க்கின்றோங்கள்", "காய்க்கிறோம்", "காய்க்கிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்க்கின்றாய்", "காய்க்கிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்க்கின்றீர்", "காய்க்கின்றீர்கள்", "காய்க்கிறீர்", "காய்க்கிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்க்கின்றான்", "காய்க்கின்றனன்", "காய்க்கிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்க்கின்றாள்", "காய்க்கின்றனள்", "காய்க்கிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்க்கின்றார்", "காய்க்கின்றார்கள்", "காய்க்கின்றனர்", "காய்க்கின்றனர்கள்", "காய்க்கிறார்", "காய்க்கிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்க்கின்றது", "காய்க்கிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்க்கின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },
                    { label: "வினய் வடிவு", children: new Map([
                        ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                        ["வினய்", { label: "வினய்", வடிவு: "காய்ச்சு", },],
                        ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சு",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சும்", "காய்ச்சுங்கள்",],), },],
                        ],), },],
                        ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["காய்ச்சி",],), },],
                        ["போனகாலத்துப்பெயரெச்சம்", {
                            label: "போனகாலத்துப் பெயரெச்சம்",
                            வடிவு: new Set(["காய்ச்சிய", "காய்ச்சின",],),
                        },],
                        ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காய்ச்சினால்",],), },],
                        ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["காய்ச்சினும்",],), },],
                        ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சினேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சினோம்", "காய்ச்சினோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சினாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சினீர்", "காய்ச்சினீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்ச்சினான்", "காய்ச்சினன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்ச்சினாள்", "காய்ச்சினள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்ச்சினார்", "காய்ச்சினார்கள்", "காய்ச்சினர்", "காய்ச்சினர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்ச்சினது", "காய்ச்சியது", "காய்ச்சிற்று",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்ச்சின", "காய்ச்சியன",],), },],
                            ],), },],
                        ],), },],
                        ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்ச்சியவன்", "காய்ச்சியோன்", "காய்ச்சினவன்", "காய்ச்சினோன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்ச்சியவள்", "காய்ச்சியோள்", "காய்ச்சினவள்", "காய்ச்சினோள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்ச்சியவர்", "காய்ச்சியவர்கள்", "காய்ச்சியோர்", "காய்ச்சியோர்கள்", "காய்ச்சினவர்", "காய்ச்சினவர்கள்", "காய்ச்சினோர்", "காய்ச்சினோர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்ச்சியது", "காய்ச்சினது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்ச்சியவய்", "காய்ச்சினவய்",],), },],
                        ],), },],
                        ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                        ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சோம்", "காய்ச்சோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சீர்", "காய்ச்சீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்ச்சான்",],),
                                },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்ச்சாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்ச்சார்", "காய்ச்சார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்ச்சாது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்ச்சா",],), },],
                            ],), },],
                        ],), },],
                        ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["காய்ச்ச",],), },],
                        ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காய்ச்சும்",],), },],
                        ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சுவேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சுவோம்", "காய்ச்சுவோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சுவாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சுவீர்", "காய்ச்சுவீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்ச்சுவான்", "காய்ச்சுவன்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்ச்சுவாள்", "காய்ச்சுவள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்ச்சுவார்", "காய்ச்சுவார்கள்", "காய்ச்சுவர்", "காய்ச்சுவர்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்ச்சுவது", "காய்ச்சும்",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்ச்சுவன",],), },],
                            ],), },],
                        ],), },],
                        ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["காய்ச்சுக",],), },],
                        ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["காய்ச்சுதல்", "காய்ச்சல்", "காய்ச்சுகய்",],), },],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["காய்ச்சுகின்ற", "காய்ச்சுகிற",],), },],
                        ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                            ["தன்மய்", { label: "தன்மய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சுகின்றேன்", "காய்ச்சுகிறேன்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சுகின்றோம்", "காய்ச்சுகின்றோங்கள்", "காய்ச்சுகிறோம்", "காய்ச்சுகிறோங்கள்",],), },],
                            ],), },],
                            ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                                ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["காய்ச்சுகின்றாய்", "காய்ச்சுகிறாய்",],), },],
                                ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["காய்ச்சுகின்றீர்", "காய்ச்சுகின்றீர்கள்", "காய்ச்சுகிறீர்", "காய்ச்சுகிறீர்கள்",],), },],
                            ],), },],
                            ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                                ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["காய்ச்சுகின்றான்", "காய்ச்சுகின்றனன்", "காய்ச்சுகிறான்",],), },],
                                ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["காய்ச்சுகின்றாள்", "காய்ச்சுகின்றனள்", "காய்ச்சுகிறாள்",],), },],
                                ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["காய்ச்சுகின்றார்", "காய்ச்சுகின்றார்கள்", "காய்ச்சுகின்றனர்", "காய்ச்சுகின்றனர்கள்", "காய்ச்சுகிறார்", "காய்ச்சுகிறார்கள்",],), },],
                                ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["காய்ச்சுகின்றது", "காய்ச்சுகிறது",],), },],
                                ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["காய்ச்சுகின்றன",],), },],
                            ],), },],
                        ],), },],
                    ],), },
                ],);
                t.deepEqual(getForms("காய்",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule13", () => {
            QUnit.test("பர", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "பரப்பு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்பு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்பும்", "பரப்புங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["பரப்பி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["பரப்பிய", "பரப்பின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பரப்பினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["பரப்பினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்பினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்பினோம்", "பரப்பினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்பினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்பினீர்", "பரப்பினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பரப்பினான்", "பரப்பினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பரப்பினாள்", "பரப்பினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பரப்பினார்", "பரப்பினார்கள்", "பரப்பினர்", "பரப்பினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பரப்பினது", "பரப்பியது", "பரப்பிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பரப்பின", "பரப்பியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பரப்பியோன்", "பரப்பினோன்", "பரப்பியவன்", "பரப்பினவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பரப்பியோள்", "பரப்பினோள்", "பரப்பியவள்", "பரப்பினவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பரப்பியோர்கள்", "பரப்பினோர்கள்", "பரப்பியவர்கள்", "பரப்பினவர்கள்", "பரப்பியோர்", "பரப்பினோர்", "பரப்பியவர்", "பரப்பினவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பரப்பியது", "பரப்பினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பரப்பியவய்", "பரப்பினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்போம்", "பரப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்பீர்", "பரப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பரப்பான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பரப்பாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பரப்பார்", "பரப்பார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பரப்பாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பரப்பா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["பரப்ப",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["பரப்பும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்புவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்புவோம்", "பரப்புவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்புவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்புவீர்", "பரப்புவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பரப்புவான்", "பரப்புவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பரப்புவாள்", "பரப்புவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பரப்புவார்", "பரப்புவார்கள்", "பரப்புவர்", "பரப்புவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பரப்புவது", "பரப்பும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பரப்புவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["பரப்புக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["பரப்புதல்", "பரப்பல்", "பரப்புகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["பரப்புகின்ற", "பரப்புகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்புகின்றேன்", "பரப்புகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்புகின்றோம்", "பரப்புகின்றோங்கள்", "பரப்புகிறோம்", "பரப்புகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["பரப்புகின்றாய்", "பரப்புகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["பரப்புகின்றீர்", "பரப்புகின்றீர்கள்", "பரப்புகிறீர்", "பரப்புகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["பரப்புகின்றான்", "பரப்புகின்றனன்", "பரப்புகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["பரப்புகின்றாள்", "பரப்புகின்றனள்", "பரப்புகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["பரப்புகின்றார்", "பரப்புகின்றார்கள்", "பரப்புகின்றனர்", "பரப்புகின்றனர்கள்", "பரப்புகிறார்", "பரப்புகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["பரப்புகின்றது", "பரப்புகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["பரப்புகின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("பர",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule20", () => {
            QUnit.test("செய்", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "செய்வி", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்வி",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்வியும்", "செய்வியுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["செய்வித்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["செய்வித்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["செய்வித்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["செய்வித்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்வித்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்வித்தோம்", "செய்வித்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்வித்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்வித்தீர்", "செய்வித்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செய்வித்தான்", "செய்வித்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செய்வித்தாள்", "செய்வித்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செய்வித்தார்", "செய்வித்தார்கள்", "செய்வித்தனர்", "செய்வித்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செய்வித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செய்வித்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செய்வித்தோன்", "செய்வித்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செய்வித்தோள்", "செய்வித்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செய்வித்தோர்கள்", "செய்வித்தவர்கள்", "செய்வித்தோர்", "செய்வித்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செய்வித்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செய்வித்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்விக்கேன்", "செய்வியேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்விக்கோம்", "செய்விக்கோங்கள்", "செய்வியோம்", "செய்வியோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்விக்காய்", "செய்வியாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்விக்கீர்", "செய்விக்கீர்கள்", "செய்வியீர்", "செய்வியீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செய்விக்கான்", "செய்வியான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செய்விக்காள்", "செய்வியாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செய்விக்கார்", "செய்விக்கார்கள்", "செய்வியார்", "செய்வியார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செய்விக்காது", "செய்வியாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செய்விக்கா", "செய்வியா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["செய்விக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["செய்விக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்விப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்விப்போம்", "செய்விப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்விப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்விப்பீர்", "செய்விப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செய்விப்பான்", "செய்விப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செய்விப்பாள்", "செய்விப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செய்விப்பார்", "செய்விப்பார்கள்", "செய்விப்பர்", "செய்விப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செய்விப்பது", "செய்விக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செய்விப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["செய்விக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["செய்வித்தல்", "செய்விக்கல்", "செய்வியல்", "செய்விக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["செய்விக்கின்ற", "செய்விக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்விக்கின்றேன்", "செய்விக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்விக்கின்றோம்", "செய்விக்கின்றோங்கள்", "செய்விக்கிறோம்", "செய்விக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["செய்விக்கின்றாய்", "செய்விக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["செய்விக்கின்றீர்", "செய்விக்கின்றீர்கள்", "செய்விக்கிறீர்", "செய்விக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["செய்விக்கின்றான்", "செய்விக்கின்றனன்", "செய்விக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["செய்விக்கின்றாள்", "செய்விக்கின்றனள்", "செய்விக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["செய்விக்கின்றார்", "செய்விக்கின்றார்கள்", "செய்விக்கின்றனர்", "செய்விக்கின்றனர்கள்", "செய்விக்கிறார்", "செய்விக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["செய்விக்கின்றது", "செய்விக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["செய்விக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("செய்",).children.get(causativeFormsKey,), expected,);
            },);
            QUnit.test("தெரி", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "தெரிவி", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவி",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவியும்", "தெரிவியுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["தெரிவித்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["தெரிவித்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தெரிவித்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["தெரிவித்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவித்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவித்தோம்", "தெரிவித்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவித்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவித்தீர்", "தெரிவித்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தெரிவித்தான்", "தெரிவித்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தெரிவித்தாள்", "தெரிவித்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தெரிவித்தார்", "தெரிவித்தார்கள்", "தெரிவித்தனர்", "தெரிவித்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தெரிவித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தெரிவித்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தெரிவித்தோன்", "தெரிவித்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தெரிவித்தோள்", "தெரிவித்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தெரிவித்தோர்கள்", "தெரிவித்தவர்கள்", "தெரிவித்தோர்", "தெரிவித்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தெரிவித்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தெரிவித்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவிக்கேன்", "தெரிவியேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவிக்கோம்", "தெரிவிக்கோங்கள்", "தெரிவியோம்", "தெரிவியோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவிக்காய்", "தெரிவியாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவிக்கீர்", "தெரிவிக்கீர்கள்", "தெரிவியீர்", "தெரிவியீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தெரிவிக்கான்", "தெரிவியான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தெரிவிக்காள்", "தெரிவியாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தெரிவிக்கார்", "தெரிவிக்கார்கள்", "தெரிவியார்", "தெரிவியார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தெரிவிக்காது", "தெரிவியாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தெரிவிக்கா", "தெரிவியா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["தெரிவிக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தெரிவிக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவிப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவிப்போம்", "தெரிவிப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவிப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவிப்பீர்", "தெரிவிப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தெரிவிப்பான்", "தெரிவிப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தெரிவிப்பாள்", "தெரிவிப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தெரிவிப்பார்", "தெரிவிப்பார்கள்", "தெரிவிப்பர்", "தெரிவிப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தெரிவிப்பது", "தெரிவிக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தெரிவிப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["தெரிவிக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["தெரிவித்தல்", "தெரிவிக்கல்", "தெரிவியல்", "தெரிவிக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["தெரிவிக்கின்ற", "தெரிவிக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவிக்கின்றேன்", "தெரிவிக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவிக்கின்றோம்", "தெரிவிக்கின்றோங்கள்", "தெரிவிக்கிறோம்", "தெரிவிக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["தெரிவிக்கின்றாய்", "தெரிவிக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["தெரிவிக்கின்றீர்", "தெரிவிக்கின்றீர்கள்", "தெரிவிக்கிறீர்", "தெரிவிக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["தெரிவிக்கின்றான்", "தெரிவிக்கின்றனன்", "தெரிவிக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["தெரிவிக்கின்றாள்", "தெரிவிக்கின்றனள்", "தெரிவிக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["தெரிவிக்கின்றார்", "தெரிவிக்கின்றார்கள்", "தெரிவிக்கின்றனர்", "தெரிவிக்கின்றனர்கள்", "தெரிவிக்கிறார்", "தெரிவிக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["தெரிவிக்கின்றது", "தெரிவிக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["தெரிவிக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("தெரி",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule21", () => {
            QUnit.test("கல்", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "கற்பி", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பி",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பியும்", "கற்பியுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["கற்பித்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["கற்பித்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கற்பித்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["கற்பித்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பித்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பித்தோம்", "கற்பித்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பித்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பித்தீர்", "கற்பித்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கற்பித்தான்", "கற்பித்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கற்பித்தாள்", "கற்பித்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கற்பித்தார்", "கற்பித்தார்கள்", "கற்பித்தனர்", "கற்பித்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கற்பித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கற்பித்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கற்பித்தோன்", "கற்பித்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கற்பித்தோள்", "கற்பித்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கற்பித்தோர்கள்", "கற்பித்தவர்கள்", "கற்பித்தோர்", "கற்பித்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கற்பித்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கற்பித்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பிக்கேன்", "கற்பியேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பிக்கோம்", "கற்பிக்கோங்கள்", "கற்பியோம்", "கற்பியோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பிக்காய்", "கற்பியாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பிக்கீர்", "கற்பிக்கீர்கள்", "கற்பியீர்", "கற்பியீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கற்பிக்கான்", "கற்பியான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கற்பிக்காள்", "கற்பியாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கற்பிக்கார்", "கற்பிக்கார்கள்", "கற்பியார்", "கற்பியார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கற்பிக்காது", "கற்பியாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கற்பிக்கா", "கற்பியா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["கற்பிக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கற்பிக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பிப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பிப்போம்", "கற்பிப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பிப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பிப்பீர்", "கற்பிப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கற்பிப்பான்", "கற்பிப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கற்பிப்பாள்", "கற்பிப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கற்பிப்பார்", "கற்பிப்பார்கள்", "கற்பிப்பர்", "கற்பிப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கற்பிப்பது", "கற்பிக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கற்பிப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["கற்பிக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["கற்பித்தல்", "கற்பிக்கல்", "கற்பியல்", "கற்பிக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["கற்பிக்கின்ற", "கற்பிக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பிக்கின்றேன்", "கற்பிக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பிக்கின்றோம்", "கற்பிக்கின்றோங்கள்", "கற்பிக்கிறோம்", "கற்பிக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["கற்பிக்கின்றாய்", "கற்பிக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["கற்பிக்கின்றீர்", "கற்பிக்கின்றீர்கள்", "கற்பிக்கிறீர்", "கற்பிக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["கற்பிக்கின்றான்", "கற்பிக்கின்றனன்", "கற்பிக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["கற்பிக்கின்றாள்", "கற்பிக்கின்றனள்", "கற்பிக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["கற்பிக்கின்றார்", "கற்பிக்கின்றார்கள்", "கற்பிக்கின்றனர்", "கற்பிக்கின்றனர்கள்", "கற்பிக்கிறார்", "கற்பிக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["கற்பிக்கின்றது", "கற்பிக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["கற்பிக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("கல்",).children.get(causativeFormsKey,), expected,);
            },);
            QUnit.test("சிற", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "சிறப்பி", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பி",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பியும்", "சிறப்பியுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["சிறப்பித்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["சிறப்பித்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சிறப்பித்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["சிறப்பித்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பித்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பித்தோம்", "சிறப்பித்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பித்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பித்தீர்", "சிறப்பித்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சிறப்பித்தான்", "சிறப்பித்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சிறப்பித்தாள்", "சிறப்பித்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சிறப்பித்தார்", "சிறப்பித்தார்கள்", "சிறப்பித்தனர்", "சிறப்பித்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சிறப்பித்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சிறப்பித்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சிறப்பித்தோன்", "சிறப்பித்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சிறப்பித்தோள்", "சிறப்பித்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சிறப்பித்தோர்கள்", "சிறப்பித்தவர்கள்", "சிறப்பித்தோர்", "சிறப்பித்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சிறப்பித்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சிறப்பித்தவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பிக்கேன்", "சிறப்பியேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பிக்கோம்", "சிறப்பிக்கோங்கள்", "சிறப்பியோம்", "சிறப்பியோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பிக்காய்", "சிறப்பியாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பிக்கீர்", "சிறப்பிக்கீர்கள்", "சிறப்பியீர்", "சிறப்பியீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சிறப்பிக்கான்", "சிறப்பியான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சிறப்பிக்காள்", "சிறப்பியாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சிறப்பிக்கார்", "சிறப்பிக்கார்கள்", "சிறப்பியார்", "சிறப்பியார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சிறப்பிக்காது", "சிறப்பியாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சிறப்பிக்கா", "சிறப்பியா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["சிறப்பிக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சிறப்பிக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பிப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பிப்போம்", "சிறப்பிப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பிப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பிப்பீர்", "சிறப்பிப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சிறப்பிப்பான்", "சிறப்பிப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சிறப்பிப்பாள்", "சிறப்பிப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சிறப்பிப்பார்", "சிறப்பிப்பார்கள்", "சிறப்பிப்பர்", "சிறப்பிப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சிறப்பிப்பது", "சிறப்பிக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சிறப்பிப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["சிறப்பிக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["சிறப்பித்தல்", "சிறப்பிக்கல்", "சிறப்பியல்", "சிறப்பிக்கய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["சிறப்பிக்கின்ற", "சிறப்பிக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பிக்கின்றேன்", "சிறப்பிக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பிக்கின்றோம்", "சிறப்பிக்கின்றோங்கள்", "சிறப்பிக்கிறோம்", "சிறப்பிக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["சிறப்பிக்கின்றாய்", "சிறப்பிக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["சிறப்பிக்கின்றீர்", "சிறப்பிக்கின்றீர்கள்", "சிறப்பிக்கிறீர்", "சிறப்பிக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["சிறப்பிக்கின்றான்", "சிறப்பிக்கின்றனன்", "சிறப்பிக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["சிறப்பிக்கின்றாள்", "சிறப்பிக்கின்றனள்", "சிறப்பிக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["சிறப்பிக்கின்றார்", "சிறப்பிக்கின்றார்கள்", "சிறப்பிக்கின்றனர்", "சிறப்பிக்கின்றனர்கள்", "சிறப்பிக்கிறார்", "சிறப்பிக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["சிறப்பிக்கின்றது", "சிறப்பிக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["சிறப்பிக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("சிற",).children.get(causativeFormsKey,), expected,);
            },);
        },);
        QUnit.module("Rule30", () => {
            QUnit.test("ஆடு", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "ஆட்டு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டும்", "ஆட்டுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["ஆட்டி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["ஆட்டிய", "ஆட்டின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆட்டினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["ஆட்டினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டினோம்", "ஆட்டினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டினீர்", "ஆட்டினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆட்டினான்", "ஆட்டினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆட்டினாள்", "ஆட்டினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆட்டினார்", "ஆட்டினார்கள்", "ஆட்டினர்", "ஆட்டினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆட்டினது", "ஆட்டியது", "ஆட்டிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆட்டின", "ஆட்டியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆட்டியோன்", "ஆட்டினோன்", "ஆட்டியவன்", "ஆட்டினவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆட்டியோள்", "ஆட்டினோள்", "ஆட்டியவள்", "ஆட்டினவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆட்டியோர்கள்", "ஆட்டினோர்கள்", "ஆட்டியவர்கள்", "ஆட்டினவர்கள்", "ஆட்டியோர்", "ஆட்டினோர்", "ஆட்டியவர்", "ஆட்டினவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆட்டியது", "ஆட்டினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆட்டியவய்", "ஆட்டினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டோம்", "ஆட்டோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டீர்", "ஆட்டீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆட்டான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆட்டாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆட்டார்", "ஆட்டார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆட்டாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆட்டா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["ஆட்ட",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆட்டும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டுவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டுவோம்", "ஆட்டுவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டுவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டுவீர்", "ஆட்டுவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆட்டுவான்", "ஆட்டுவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆட்டுவாள்", "ஆட்டுவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆட்டுவார்", "ஆட்டுவார்கள்", "ஆட்டுவர்", "ஆட்டுவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆட்டுவது", "ஆட்டும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆட்டுவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["ஆட்டுக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["ஆட்டுதல்", "ஆட்டல்", "ஆட்டுகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["ஆட்டுகின்ற", "ஆட்டுகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டுகின்றேன்", "ஆட்டுகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டுகின்றோம்", "ஆட்டுகின்றோங்கள்", "ஆட்டுகிறோம்", "ஆட்டுகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["ஆட்டுகின்றாய்", "ஆட்டுகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["ஆட்டுகின்றீர்", "ஆட்டுகின்றீர்கள்", "ஆட்டுகிறீர்", "ஆட்டுகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["ஆட்டுகின்றான்", "ஆட்டுகின்றனன்", "ஆட்டுகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["ஆட்டுகின்றாள்", "ஆட்டுகின்றனள்", "ஆட்டுகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["ஆட்டுகின்றார்", "ஆட்டுகின்றார்கள்", "ஆட்டுகின்றனர்", "ஆட்டுகின்றனர்கள்", "ஆட்டுகிறார்", "ஆட்டுகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["ஆட்டுகின்றது", "ஆட்டுகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["ஆட்டுகின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("ஆடு",).children.get(causativeFormsKey,), expected,);
            },);
            QUnit.test("எழும்பு", t => {
                const expected = new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "வாங்கு", },],
                    ["வினய்", { label: "வினய்", வடிவு: "எழுப்பு", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்பு",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்பும்", "எழுப்புங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["எழுப்பி",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["எழுப்பிய", "எழுப்பின",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["எழுப்பினால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["எழுப்பினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்பினேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்பினோம்", "எழுப்பினோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்பினாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்பினீர்", "எழுப்பினீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எழுப்பினான்", "எழுப்பினன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எழுப்பினாள்", "எழுப்பினள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எழுப்பினார்", "எழுப்பினார்கள்", "எழுப்பினர்", "எழுப்பினர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எழுப்பினது", "எழுப்பியது", "எழுப்பிற்று",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எழுப்பின", "எழுப்பியன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எழுப்பியோன்", "எழுப்பினோன்", "எழுப்பியவன்", "எழுப்பினவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எழுப்பியோள்", "எழுப்பினோள்", "எழுப்பியவள்", "எழுப்பினவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எழுப்பியோர்கள்", "எழுப்பினோர்கள்", "எழுப்பியவர்கள்", "எழுப்பினவர்கள்", "எழுப்பியோர்", "எழுப்பினோர்", "எழுப்பியவர்", "எழுப்பினவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எழுப்பியது", "எழுப்பினது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எழுப்பியவய்", "எழுப்பினவய்",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்போம்", "எழுப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்பீர்", "எழுப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எழுப்பான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எழுப்பாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எழுப்பார்", "எழுப்பார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எழுப்பாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எழுப்பா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["எழுப்ப",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["எழுப்பும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்புவேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்புவோம்", "எழுப்புவோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்புவாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்புவீர்", "எழுப்புவீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எழுப்புவான்", "எழுப்புவன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எழுப்புவாள்", "எழுப்புவள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எழுப்புவார்", "எழுப்புவார்கள்", "எழுப்புவர்", "எழுப்புவர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எழுப்புவது", "எழுப்பும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எழுப்புவன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["எழுப்புக",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["எழுப்புதல்", "எழுப்பல்", "எழுப்புகய்",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["எழுப்புகின்ற", "எழுப்புகிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்புகின்றேன்", "எழுப்புகிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்புகின்றோம்", "எழுப்புகின்றோங்கள்", "எழுப்புகிறோம்", "எழுப்புகிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["எழுப்புகின்றாய்", "எழுப்புகிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["எழுப்புகின்றீர்", "எழுப்புகின்றீர்கள்", "எழுப்புகிறீர்", "எழுப்புகிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["எழுப்புகின்றான்", "எழுப்புகின்றனன்", "எழுப்புகிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["எழுப்புகின்றாள்", "எழுப்புகின்றனள்", "எழுப்புகிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["எழுப்புகின்றார்", "எழுப்புகின்றார்கள்", "எழுப்புகின்றனர்", "எழுப்புகின்றனர்கள்", "எழுப்புகிறார்", "எழுப்புகிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["எழுப்புகின்றது", "எழுப்புகிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["எழுப்புகின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],);
                t.deepEqual(getForms("எழும்பு",).children.get(causativeFormsKey,), expected,);
            },);
        },);
    },);
    QUnit.module("புத்தெழுத்துமுறய்", () => {
        QUnit.test("மறை", t => {
            const expected = { label: "வினய் வடிவு", children: new Map([
                ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "உயர்", },],
                ["வினய்", { label: "வினய்", வடிவு: "மறய்", },],
                ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறை",],), },],
                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறையும்", "மறையுங்கள்",],), },],
                ],), },],
                ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["மறைந்து",],), },],
                ["போனகாலத்துப்பெயரெச்சம்", { label: "போனகாலத்துப் பெயரெச்சம்", வடிவு: new Set(["மறைந்த",],), },],
                ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மறைந்தால்",],), },],
                ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மறைந்தினும்",],), },],
                ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைந்தேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைந்தோம்", "மறைந்தோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைந்தாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைந்தீர்", "மறைந்தீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைந்தான்", "மறைந்தனன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைந்தாள்", "மறைந்தனள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைந்தார்", "மறைந்தார்கள்", "மறைந்தனர்", "மறைந்தனர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைந்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைந்தன",],), },],
                    ],), },],
                ],), },],
                ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைந்தோன்", "மறைந்தவன்",],), },],
                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைந்தோள்", "மறைந்தவள்",],), },],
                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைந்தோர்", "மறைந்தோர்கள்", "மறைந்தவர்", "மறைந்தவர்கள்",],), },],
                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைந்தது",],), },],
                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைந்தவை",],), },],
                ],), },],
                ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set(), },],
                ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set(), },],
                ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறையேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறையோம்", "மறையோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறையாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறையீர்", "மறையீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறையான்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறையாள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறையார்", "மறையார்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறையாது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறையா",],), },],
                    ],), },],
                ],), },],
                ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["மறைய",],), },],
                ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மறையும்",],), },],
                ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைவேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைவோம்", "மறைவோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைவாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைவீர்", "மறைவீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைவான்", "மறைவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைவாள்", "மறைவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைவார்", "மறைவார்கள்", "மறைவர்", "மறைவர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைவது", "மறையும்",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைவன",],), },],
                    ],), },],
                ],), },],
                ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["மறைக",],), },],
                ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["மறைதல்", "மறையல்", "மறையுதல்", "மறைகை",],), },],
                ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மறைகின்ற", "மறைகிற",],), },],
                ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைகின்றேன்", "மறைகிறேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைகின்றோம்", "மறைகின்றோங்கள்", "மறைகிறோம்", "மறைகிறோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைகின்றாய்", "மறைகிறாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைகின்றீர்", "மறைகின்றீர்கள்", "மறைகிறீர்", "மறைகிறீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைகின்றான்", "மறைகின்றனன்", "மறைகிறான்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைகின்றாள்", "மறைகின்றனள்", "மறைகிறாள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைகின்றார்", "மறைகின்றார்கள்", "மறைகின்றனர்", "மறைகின்றனர்கள்", "மறைகிறார்", "மறைகிறார்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைகின்றது", "மறைகிறது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைகின்றன",],), },],
                    ],), },],
                ],), },],
                [causativeFormsKey, new Set([{ label: "வினய் வடிவு", children: new Map([
                    ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                    ["வினய்", { label: "வினய்", வடிவு: "மறய்", },],
                    ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறை",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறையும்", "மறையுங்கள்",],), },],
                    ],), },],
                    ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["மறைத்து",],), },],
                    ["போனகாலத்துப்பெயரெச்சம்", {
                        label: "போனகாலத்துப் பெயரெச்சம்",
                        வடிவு: new Set(["மறைத்த",],),
                    },],
                    ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மறைத்தால்",],), },],
                    ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["மறைத்தினும்",],), },],
                    ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைத்தேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைத்தோம்", "மறைத்தோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைத்தாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைத்தீர்", "மறைத்தீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைத்தான்", "மறைத்தனன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைத்தாள்", "மறைத்தனள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைத்தார்", "மறைத்தார்கள்", "மறைத்தனர்", "மறைத்தனர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைத்தது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைத்தன",],), },],
                        ],), },],
                    ],), },],
                    ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைத்தோன்", "மறைத்தவன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைத்தோள்", "மறைத்தவள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைத்தோர்கள்", "மறைத்தவர்கள்", "மறைத்தோர்", "மறைத்தவர்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைத்தவை",],), },],
                    ],), },],
                    ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                    ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைக்கேன்", "மறையேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைக்கோம்", "மறைக்கோங்கள்", "மறையோம்", "மறையோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைக்காய்", "மறையாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைக்கீர்", "மறைக்கீர்கள்", "மறையீர்", "மறையீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைக்கான்", "மறையான்",],),
                            },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைக்காள்", "மறையாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைக்கார்", "மறைக்கார்கள்", "மறையார்", "மறையார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைக்காது", "மறையாது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைக்கா", "மறையா",],), },],
                        ],), },],
                    ],), },],
                    ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["மறைக்க",],), },],
                    ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மறைக்கும்",],), },],
                    ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைப்பேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைப்போம்", "மறைப்போங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைப்பாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைப்பீர்", "மறைப்பீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைப்பான்", "மறைப்பன்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைப்பாள்", "மறைப்பள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைப்பார்", "மறைப்பார்கள்", "மறைப்பர்", "மறைப்பர்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைப்பது", "மறைக்கும்",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைப்பன",],), },],
                        ],), },],
                    ],), },],
                    ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["மறைக்க",],), },],
                    ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["மறைத்தல்", "மறைக்கல்", "மறையல்", "மறைக்கை",],), },],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["மறைக்கின்ற", "மறைக்கிற",],), },],
                    ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                        ["தன்மய்", { label: "தன்மய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைக்கின்றேன்", "மறைக்கிறேன்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைக்கின்றோம்", "மறைக்கின்றோங்கள்", "மறைக்கிறோம்", "மறைக்கிறோங்கள்",],), },],
                        ],), },],
                        ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                            ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["மறைக்கின்றாய்", "மறைக்கிறாய்",],), },],
                            ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["மறைக்கின்றீர்", "மறைக்கின்றீர்கள்", "மறைக்கிறீர்", "மறைக்கிறீர்கள்",],), },],
                        ],), },],
                        ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                            ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["மறைக்கின்றான்", "மறைக்கின்றனன்", "மறைக்கிறான்",],), },],
                            ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["மறைக்கின்றாள்", "மறைக்கின்றனள்", "மறைக்கிறாள்",],), },],
                            ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["மறைக்கின்றார்", "மறைக்கின்றார்கள்", "மறைக்கின்றனர்", "மறைக்கின்றனர்கள்", "மறைக்கிறார்", "மறைக்கிறார்கள்",],), },],
                            ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["மறைக்கின்றது", "மறைக்கிறது",],), },],
                            ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["மறைக்கின்றன",],), },],
                        ],), },],
                    ],), },],
                ],), },],),],
            ],), };
            t.deepEqual(getForms("மறை", null, true,), expected,);
        },);
        QUnit.test("வை", t => {
            const expected = { label: "வினய் வடிவு", children: new Map([
                ["இனத்துப்பெயர்", { label: "இனம்", வடிவு: "பார்", },],
                ["வினய்", { label: "வினய்", வடிவு: "வய்", },],
                ["ஏவல்வினய்முற்று", { label: "ஏவல் வினய்முற்று", children: new Map([
                    ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வை",],), },],
                    ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வையும்", "வையுங்கள்",],), },],
                ],), },],
                ["போனகாலத்துவினயெச்சம்", { label: "போனகாலத்து வினயெச்சம்", வடிவு: new Set(["வைத்து",],), },],
                ["போனகாலத்துப்பெயரெச்சம்", {
                    label: "போனகாலத்துப் பெயரெச்சம்",
                    வடிவு: new Set(["வைத்த",],),
                },],
                ["நிபந்தனய்வினயெச்சம்", { label: "நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வைத்தால்",],), },],
                ["எதிர்மறய்நிபந்தனய்வினயெச்சம்", { label: "எதிர்மறய் நிபந்தனய் வினயெச்சம்", வடிவு: new Set(["வைத்தினும்",],), },],
                ["போனகாலத்துவினய்முற்று", { label: "போனகாலத்து வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைத்தேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைத்தோம்", "வைத்தோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைத்தாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைத்தீர்", "வைத்தீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வைத்தான்", "வைத்தனன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வைத்தாள்", "வைத்தனள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வைத்தார்", "வைத்தார்கள்", "வைத்தனர்", "வைத்தனர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வைத்தது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வைத்தன",],), },],
                    ],), },],
                ],), },],
                ["போனகாலத்துப்பெயரெச்சத்துப்பெயர்", { label: "போனகாலத்துப் பெயரெச்சத்துப் பெயர்", children: new Map([
                    ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வைத்தோன்", "வைத்தவன்",],), },],
                    ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வைத்தோள்", "வைத்தவள்",],), },],
                    ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வைத்தோர்", "வைத்தோர்கள்", "வைத்தவர்", "வைத்தவர்கள்",],), },],
                    ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வைத்தது",],), },],
                    ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வைத்தவை",],), },],
                ],), },],
                ["எதிர்மறய்வினயெச்சம்", { label: "எதிர்மறய் வினயெச்சம்", வடிவு: new Set([],), },],
                ["எதிர்மறய்ப்பெயரெச்சம்", { label: "எதிர்மறய்ப் பெயரெச்சம்", வடிவு: new Set([],), },],
                ["எதிர்மறய்வினய்முற்று", { label: "எதிர்மறய் வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைக்கேன்", "வையேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைக்கோம்", "வைக்கோங்கள்", "வையோம்", "வையோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைக்காய்", "வையாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைக்கீர்", "வைக்கீர்கள்", "வையீர்", "வையீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வைக்கான்", "வையான்",],),
                        },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வைக்காள்", "வையாள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வைக்கார்", "வைக்கார்கள்", "வையார்", "வையார்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வைக்காது", "வையாது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வைக்கா", "வையா",],), },],
                    ],), },],
                ],), },],
                ["வருங்காலத்துவினயெச்சம்", { label: "வருங்காலத்து வினயெச்சம்", வடிவு: new Set(["வைக்க",],), },],
                ["வருங்காலத்துப்பெயரெச்சம்", { label: "வருங்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வைக்கும்",],), },],
                ["வருங்காலத்துவினய்முற்று", { label: "வருங்காலத்து வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைப்பேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைப்போம்", "வைப்போங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைப்பாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைப்பீர்", "வைப்பீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வைப்பான்", "வைப்பன்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வைப்பாள்", "வைப்பள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வைப்பார்", "வைப்பார்கள்", "வைப்பர்", "வைப்பர்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வைப்பது", "வைக்கும்",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வைப்பன",],), },],
                    ],), },],
                ],), },],
                ["வியங்கோள்வினய்முற்று", { label: "வியங்கோள் வினய்முற்று", வடிவு: new Set(["வைக்க",],), },],
                ["தொழிற்பெயர்", { label: "தொழிற்பெயர்", வடிவு: new Set(["வைத்தல்", "வைக்கல்", "வையல்", "வைக்கை",],), },],
                ["நிகழ்காலத்துப்பெயரெச்சம்", { label: "நிகழ்காலத்துப் பெயரெச்சம்", வடிவு: new Set(["வைக்கின்ற", "வைக்கிற",],), },],
                ["நிகழ்காலத்துவினய்முற்று", { label: "நிகழ்காலத்து வினய்முற்று", children: new Map([
                    ["தன்மய்", { label: "தன்மய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைக்கின்றேன்", "வைக்கிறேன்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைக்கின்றோம்", "வைக்கின்றோங்கள்", "வைக்கிறோம்", "வைக்கிறோங்கள்",],), },],
                    ],), },],
                    ["முன்னிலய்", { label: "முன்னிலய்", children: new Map([
                        ["ஒருமய்", { label: "ஒருமய்", வடிவு: new Set(["வைக்கின்றாய்", "வைக்கிறாய்",],), },],
                        ["பன்மய்", { label: "பன்மய்", வடிவு: new Set(["வைக்கின்றீர்", "வைக்கின்றீர்கள்", "வைக்கிறீர்", "வைக்கிறீர்கள்",],), },],
                    ],), },],
                    ["படர்க்கய்", { label: "படர்க்கய்", children: new Map([
                        ["ஆண்பால்", { label: "ஆண்பால்", வடிவு: new Set(["வைக்கின்றான்", "வைக்கின்றனன்", "வைக்கிறான்",],), },],
                        ["பெண்பால்", { label: "பெண்பால்", வடிவு: new Set(["வைக்கின்றாள்", "வைக்கின்றனள்", "வைக்கிறாள்",],), },],
                        ["பலர்பால்", { label: "பலர்பால்", வடிவு: new Set(["வைக்கின்றார்", "வைக்கின்றார்கள்", "வைக்கின்றனர்", "வைக்கின்றனர்கள்", "வைக்கிறார்", "வைக்கிறார்கள்",],), },],
                        ["ஒன்றன்பால்", { label: "ஒன்றன்பால்", வடிவு: new Set(["வைக்கின்றது", "வைக்கிறது",],), },],
                        ["பலவின்பால்", { label: "பலவின்பால்", வடிவு: new Set(["வைக்கின்றன",],), },],
                    ],), },],
                ],), },],
                [causativeFormsKey, new Set([],),],
            ],), };
            t.deepEqual(getForms("வை", "பார்", true,), expected,);
        },);
    },);
    QUnit.module("Invalid getForms", () => {
        QUnit.test("அ as a வினயினம்", t => {
            t.throws(
                () => getForms("படு", "அ",),
                err => err instanceof Error &&
                    /^Unknown வினயினம் .*\.$/v.test(err.message,),
            );
        },);
        QUnit.test("இல் as the வினயினம் for அல்", t => {
            t.throws(
                () => getForms("அல்", "இல்",),
                err => err instanceof Error &&
                    /^பகுதி .* isn't valid for வினயினம் .*\.$/v.test(err.message,),
            );
        },);
        QUnit.test("அ as a பகுதி", t => {
            t.throws(
                () => getForms("அ",),
                err => err instanceof Error &&
                    /^Unknown பகுதி .*\.$/v.test(err.message,),
            );
        },);
    },);
},);

QUnit.module("conversionsToNewSpelling", () => {
    const convert = text => conversionsToNewSpelling.reduce(
        (வடிவு, புணர்ச்சிவிதி,) => புணர்ச்சிவிதி(வடிவு,),
        text,
    );
    QUnit.test("கையை", t => {
        t.strictEqual(convert("கய்யய்",), "கையை",);
    },);
    QUnit.test("ஐயன்", t => {
        t.strictEqual(convert("அய்யன்",), "ஐயன்",);
    },);
    QUnit.test("இளையவள்", t => {
        t.strictEqual(convert("இளயவள்",), "இளையவள்",);
    },);
},);
