/* global QUnit */

QUnit.config.maxDepth = -1;
QUnit.config.noglobals = true;
QUnit.config.seed = true;

import { schema, } from "../lib/main.js";

QUnit.module("schema", () => {
    QUnit.test("schema is a map of strings", t => {
        t.true(schema instanceof Map);
        schema.forEach((k, v) => {
            t.equal(typeof k, "string");
            t.equal(typeof v, "string");
        },);
    },);
},);

import { வினயினத்துப்பெயர்கள், validவினயினத்துப்பெயர்கள், } from "../lib/vinayinam.js";

QUnit.module("வினயினத்துப்பெயர்கள்", () => {
    QUnit.test("வினயினத்துப்பெயர்கள் is an Array of strings", t => {
        t.true(Array.isArray(வினயினத்துப்பெயர்கள்));
        வினயினத்துப்பெயர்கள்.forEach(வினயினத்துப்பெயர் => {
            t.equal(typeof வினயினத்துப்பெயர், "string");
        },);
    },);
    QUnit.module("validவினயினத்துப்பெயர்கள்", () => {
        const assertValid = (t, வினயினம்,) => (வினய்,) => {
            t.true(validவினயினத்துப்பெயர்கள்(வினய்,).includes(வினயினம்,));
        };
        const assertInvalid = (t, வினயினம்,) => (வினய்,) => {
            t.false(validவினயினத்துப்பெயர்கள்(வினய்,).includes(வினயினம்,));
        };
        QUnit.test("வாங்கு", t => {
            ["ஊது",].forEach(assertValid(t, "வாங்கு",),);
            ["கல்", "கல", "தெரி", "போ",].forEach(assertInvalid(t, "வாங்கு",),);
        },);
        QUnit.test("பார்", t => { t.expect(0); },); // பார் is always a valid இனம்
        QUnit.test("இரு", t => { t.expect(0); },); // இரு is always a valid இனம்
        QUnit.test("உயர்", t => {
            ["ஈ", "அணி", "மிகு", "உயர்", "வீழ்", "குலய்", "கல்",].forEach(assertValid(t, "உயர்",),);
            ["கல",].forEach(assertInvalid(t, "உயர்",),);
        },);
        QUnit.test("சொல்", t => {
            ["சொல்",].forEach(assertValid(t, "சொல்",),);
            ["வாங்கு", "போ", "அணி",].forEach(assertInvalid(t, "சொல்",),);
        },);
        QUnit.test("செய்", t => { t.expect(0); }); // செய் is always a valid இனம்
        QUnit.test("இடு", t => {
            ["போடு", "பெறு",].forEach(assertValid(t, "இடு",),);
            ["பரவு", "உயர்", "விழு", "கடி", "தின்", "உண்",].forEach(assertInvalid(t, "இடு",),);
        });
        QUnit.test("வா", t => {
            ["தா",].forEach(assertValid(t, "வா",),);
            ["கல்", "கல", "தெரி", "போ", "வாங்கு", "உயர்",].forEach(assertInvalid(t, "வா",),);
        },);
        QUnit.test("காண்", t => {
            ["காண்",].forEach(assertValid(t, "காண்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "காண்",),);
        },);
        QUnit.test("போ", t => {
            ["போ", "சா",].forEach(assertValid(t, "போ",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல",].forEach(assertInvalid(t, "போ",),);
        },);
        QUnit.test("நோ", t => {
            ["நோ",].forEach(assertValid(t, "நோ",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா",].forEach(assertInvalid(t, "நோ",),);
        },);
        QUnit.test("சா", t => {
            ["சா",].forEach(assertValid(t, "சா",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "நோ",].forEach(assertInvalid(t, "சா",),);
        },);
        QUnit.test("அல்", t => {
            ["அல்",].forEach(assertValid(t, "அல்",),);
            ["கல்", "கல", "தெரி", "போ",].forEach(assertInvalid(t, "அல்",),);
        },);
        QUnit.test("உள்", t => {
            ["உள்",].forEach(assertValid(t, "உள்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "உள்",),);
        },);
        QUnit.test("இல்", t => {
            ["இல்",].forEach(assertValid(t, "இல்",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "இல்",),);
        },);
        QUnit.test("மாட்டு", t => {
            ["மாட்டு",].forEach(assertValid(t, "மாட்டு",),);
            ["வாங்கு", "உயர்", "விழு", "கடி", "காட்டு", "பெறு", "தொடு", "உண்", "கல்", "கல", "சா", "போ",].forEach(assertInvalid(t, "மாட்டு",),);
        },);
    },);
},);

import { getForms, } from "../lib/main.js";

QUnit.module("getForms", () => {
    QUnit.module("With unambiguous இனம்", () => {
        QUnit.module("வாங்கு", () => {
            QUnit.test("நம்பு", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "நம்பு",],
                    ["எதிர்மறய்வினய்முற்று", "நம்பார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "நம்பினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "நம்புகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "நம்புவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "நம்ப",],
                    ["இறந்தகாலத்துவினயெச்சம்", "நம்பி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "நம்பிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "நம்புகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "நம்பும்",],
                    ["தொழிற்பெயர்", "நம்புதல்",],
                ],);
                t.deepEqual(getForms("நம்பு",), expected,);
            },);
            QUnit.test("உலாவு", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "உலாவு",],
                    ["எதிர்மறய்வினய்முற்று", "உலாவார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "உலாவினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "உலாவுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "உலாவுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "உலாவ",],
                    ["இறந்தகாலத்துவினயெச்சம்", "உலாவி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "உலாவிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "உலாவுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "உலாவும்",],
                    ["தொழிற்பெயர்", "உலாவுதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "உலாத்து",],
                        ["எதிர்மறய்வினய்முற்று", "உலாத்தார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "உலாத்தினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "உலாத்துகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "உலாத்துவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "உலாத்த",],
                        ["இறந்தகாலத்துவினயெச்சம்", "உலாத்தி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "உலாத்திய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "உலாத்துகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "உலாத்தும்",],
                        ["தொழிற்பெயர்", "உலாத்துதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("உலாவு",), expected,);
            },);
        },);
        QUnit.module("பாரும் இருவும்", () => {
            QUnit.test("எடு", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "எடு",],
                    ["எதிர்மறய்வினய்முற்று", "எடார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "எடுத்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "எடுக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "எடுப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "எடுக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "எடுத்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "எடுத்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "எடுக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "எடுக்கும்",],
                    ["தொழிற்பெயர்", "எடுத்தல்",],
                ],);
                t.deepEqual(getForms("எடு",), expected,);
            },);
            QUnit.test("கேள்", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "கேள்",],
                    ["எதிர்மறய்வினய்முற்று", "கேளார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "கேட்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "கேட்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "கேட்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "கேட்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "கேட்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "கேட்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "கேட்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "கேட்கும்",],
                    ["தொழிற்பெயர்", "கேட்டல்",],
                ],);
                t.deepEqual(getForms("கேள்",), expected,);
            },);
            QUnit.test("வில்", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "வில்",],
                    ["எதிர்மறய்வினய்முற்று", "வில்லார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "விற்றார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "விற்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "விற்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "விற்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "விற்று",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "விற்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "விற்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "விற்கும்",],
                    ["தொழிற்பெயர்", "விற்றல்",],
                ],);
                t.deepEqual(getForms("வில்",), expected,);
            },);
            QUnit.test("ஒ", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "ஒ",],
                    ["எதிர்மறய்வினய்முற்று", "ஒவ்வார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "ஒத்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "ஒக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "ஒப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "ஒக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "ஒத்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "ஒத்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "ஒக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "ஒக்கும்",],
                    ["தொழிற்பெயர்", "ஒத்தல்",],
                ],);
                t.deepEqual(getForms("ஒ",), expected,);
            },);
            QUnit.test("அள", (t) => {
                const expected = new Map([
                    ["இனம்", "இரு",],
                    ["ஏவல்வினய்முற்று", "அள",],
                    ["எதிர்மறய்வினய்முற்று", "அளவார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "அளந்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "அளக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "அளப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "அளக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "அளந்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "அளந்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "அளக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "அளக்கும்",],
                    ["தொழிற்பெயர்", "அளத்தல்",],
                ],);
                t.deepEqual(getForms("அள",), expected,);
            },);
            QUnit.test("நில்", (t) => {
                const expected = new Map([
                    ["இனம்", "இரு",],
                    ["ஏவல்வினய்முற்று", "நில்",],
                    ["எதிர்மறய்வினய்முற்று", "நில்லார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "நின்றார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "நிற்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "நிற்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "நிற்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "நின்று",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "நின்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "நிற்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "நிற்கும்",],
                    ["தொழிற்பெயர்", "நிற்றல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "நிறுத்து",],
                        ["எதிர்மறய்வினய்முற்று", "நிறுத்தார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "நிறுத்தினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "நிறுத்துகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "நிறுத்துவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "நிறுத்த",],
                        ["இறந்தகாலத்துவினயெச்சம்", "நிறுத்தி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "நிறுத்திய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "நிறுத்துகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "நிறுத்தும்",],
                        ["தொழிற்பெயர்", "நிறுத்துதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("நில்",), expected,);
            },);
        },);
        QUnit.module("உயரும் சொல்லும்", () => {
            QUnit.test("வாழ்", (t) => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", "வாழ்",],
                    ["எதிர்மறய்வினய்முற்று", "வாழார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "வாழ்ந்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "வாழ்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "வாழ்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "வாழ",],
                    ["இறந்தகாலத்துவினயெச்சம்", "வாழ்ந்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "வாழ்ந்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "வாழ்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "வாழும்",],
                    ["தொழிற்பெயர்", "வாழ்தல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "வாழ்த்து",],
                        ["எதிர்மறய்வினய்முற்று", "வாழ்த்தார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "வாழ்த்தினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "வாழ்த்துகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "வாழ்த்துவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "வாழ்த்த",],
                        ["இறந்தகாலத்துவினயெச்சம்", "வாழ்த்தி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "வாழ்த்திய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "வாழ்த்துகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "வாழ்த்தும்",],
                        ["தொழிற்பெயர்", "வாழ்த்துதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("வாழ்",), expected,);
            },);
            QUnit.test("பயில்", (t) => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", "பயில்",],
                    ["எதிர்மறய்வினய்முற்று", "பயிலார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "பயின்றார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "பயில்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "பயில்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "பயில",],
                    ["இறந்தகாலத்துவினயெச்சம்", "பயின்று",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "பயின்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "பயில்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "பயிலும்",],
                    ["தொழிற்பெயர்", "பயிலுதல்",],
                ],);
                t.deepEqual(getForms("பயில்",), expected,);
            },);
            QUnit.test("ஆள்", (t) => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", "ஆள்",],
                    ["எதிர்மறய்வினய்முற்று", "ஆளார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "ஆண்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "ஆள்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "ஆள்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "ஆள",],
                    ["இறந்தகாலத்துவினயெச்சம்", "ஆண்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "ஆண்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "ஆள்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "ஆளும்",],
                    ["தொழிற்பெயர்", "ஆளுதல்",],
                ],);
                t.deepEqual(getForms("ஆள்",), expected,);
            },);
            QUnit.test("செல்", (t) => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", "செல்",],
                    ["எதிர்மறய்வினய்முற்று", "செல்லார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "சென்றார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "செல்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "செல்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "செல்ல",],
                    ["இறந்தகாலத்துவினயெச்சம்", "சென்று",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "சென்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "செல்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "செல்லும்",],
                    ["தொழிற்பெயர்", "செல்லுதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "செலுத்து",],
                        ["எதிர்மறய்வினய்முற்று", "செலுத்தார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "செலுத்தினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "செலுத்துகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "செலுத்துவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "செலுத்த",],
                        ["இறந்தகாலத்துவினயெச்சம்", "செலுத்தி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "செலுத்திய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "செலுத்துகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "செலுத்தும்",],
                        ["தொழிற்பெயர்", "செலுத்துதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("செல்",), expected,);
            },);
            QUnit.test("கொள்", (t) => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", "கொள்",],
                    ["எதிர்மறய்வினய்முற்று", "கொள்ளார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "கொண்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "கொள்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "கொள்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "கொள்ள",],
                    ["இறந்தகாலத்துவினயெச்சம்", "கொண்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "கொண்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "கொள்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "கொள்ளும்",],
                    ["தொழிற்பெயர்", "கொள்ளுதல்",],
                ],);
                t.deepEqual(getForms("கொள்",), expected,);
            },);
            QUnit.test("சொல்", (t) => {
                const expected = new Map([
                    ["இனம்", "சொல்",],
                    ["ஏவல்வினய்முற்று", "சொல்",],
                    ["எதிர்மறய்வினய்முற்று", "சொல்லார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "சொன்னார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "சொல்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "சொல்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "சொல்ல",],
                    ["இறந்தகாலத்துவினயெச்சம்", "சொல்லி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", new Set(["சொன்ன", "சொல்லிய",],),],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "சொல்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "சொல்லும்",],
                    ["தொழிற்பெயர்", "சொல்லுதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", "சொல்லுவி",],
                        ["எதிர்மறய்வினய்முற்று", "சொல்லுவியார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "சொல்லுவித்தார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "சொல்லுவிக்கின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "சொல்லுவிப்பார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "சொல்லுவிக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "சொல்லுவித்து",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "சொல்லுவித்த",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "சொல்லுவிக்கின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "சொல்லுவிக்கும்",],
                        ["தொழிற்பெயர்", "சொல்லுவித்தல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("சொல்",), expected,);
            },);
        },);
        QUnit.module("செய்யும் இடுவும் வாவும் காணும்", () => {
            QUnit.test("அழு", (t) => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", "அழு",],
                    ["எதிர்மறய்வினய்முற்று", "அழார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "அழுதார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "அழுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "அழுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "அழ",],
                    ["இறந்தகாலத்துவினயெச்சம்", "அழுது",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "அழுத",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "அழுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "அழும்",],
                    ["தொழிற்பெயர்", "அழுதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", "அழுவி",],
                        ["எதிர்மறய்வினய்முற்று", "அழுவியார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "அழுவித்தார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "அழுவிக்கின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "அழுவிப்பார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "அழுவிக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "அழுவித்து",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "அழுவித்த",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "அழுவிக்கின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "அழுவிக்கும்",],
                        ["தொழிற்பெயர்", "அழுவித்தல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("அழு",), expected,);
            },);
            QUnit.test("தொகு", (t) => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", "தொகு",],
                    ["எதிர்மறய்வினய்முற்று", "தொகார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "தொக்கார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "தொகுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "தொகுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "தொக",],
                    ["இறந்தகாலத்துவினயெச்சம்", "தொக்கு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "தொக்க",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "தொகுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "தொகும்",],
                    ["தொழிற்பெயர்", "தொக்கல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", "தொகு",],
                        ["எதிர்மறய்வினய்முற்று", "தொகார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "தொகுத்தார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "தொகுக்கின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "தொகுப்பார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "தொகுக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "தொகுத்து",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "தொகுத்த",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "தொகுக்கின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "தொகுக்கும்",],
                        ["தொழிற்பெயர்", "தொகுத்தல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("தொகு",), expected,);
            },);
            QUnit.test("சுடு", (t) => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", "சுடு",],
                    ["எதிர்மறய்வினய்முற்று", "சுடார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "சுட்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "சுடுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "சுடுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "சுட",],
                    ["இறந்தகாலத்துவினயெச்சம்", "சுட்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "சுட்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "சுடுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "சுடும்",],
                    ["தொழிற்பெயர்", "சுட்டல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "இடு",],
                        ["ஏவல்வினய்முற்று", "சுடு",],
                        ["எதிர்மறய்வினய்முற்று", "சுடார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "சுட்டார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "சுடுகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "சுடுவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "சுட",],
                        ["இறந்தகாலத்துவினயெச்சம்", "சுட்டு",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "சுட்ட",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "சுடுகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "சுடும்",],
                        ["தொழிற்பெயர்", "சுட்டல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("சுடு",), expected,);
            },);
            QUnit.test("பெறு", (t) => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", "பெறு",],
                    ["எதிர்மறய்வினய்முற்று", "பெறார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "பெற்றார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "பெறுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "பெறுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "பெற",],
                    ["இறந்தகாலத்துவினயெச்சம்", "பெற்று",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "பெற்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "பெறுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "பெறும்",],
                    ["தொழிற்பெயர்", "பெற்றல்",],
                ],);
                t.deepEqual(getForms("பெறு",), expected,);
            },);
            QUnit.test("தா", (t) => {
                const expected = new Map([
                    ["இனம்", "வா",],
                    ["ஏவல்வினய்முற்று", "தா",],
                    ["எதிர்மறய்வினய்முற்று", "தரார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "தந்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "தருகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "தருவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "தர",],
                    ["இறந்தகாலத்துவினயெச்சம்", "தந்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "தந்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "தருகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "தரும்",],
                    ["தொழிற்பெயர்", "தருதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", "தருவி",],
                        ["எதிர்மறய்வினய்முற்று", "தருவியார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "தருவித்தார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "தருவிக்கின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "தருவிப்பார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "தருவிக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "தருவித்து",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "தருவித்த",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "தருவிக்கின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "தருவிக்கும்",],
                        ["தொழிற்பெயர்", "தருவித்தல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("தா",), expected,);
            },);
            QUnit.test("என்", (t) => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", "என்",],
                    ["எதிர்மறய்வினய்முற்று", "என்னார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "என்றார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "என்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "என்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "என்ன",],
                    ["இறந்தகாலத்துவினயெச்சம்", "என்று",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "என்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "என்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "என்னும்",],
                    ["தொழிற்பெயர்", "என்றல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", "என்பி",],
                        ["எதிர்மறய்வினய்முற்று", "என்பியார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "என்பித்தார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "என்பிக்கின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "என்பிப்பார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "என்பிக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "என்பித்து",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "என்பித்த",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "என்பிக்கின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "என்பிக்கும்",],
                        ["தொழிற்பெயர்", "என்பித்தல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("என்",), expected,);
            },);
            QUnit.test("உண்", (t) => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", "உண்",],
                    ["எதிர்மறய்வினய்முற்று", "உண்ணார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "உண்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "உண்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "உண்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "உண்ண",],
                    ["இறந்தகாலத்துவினயெச்சம்", "உண்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "உண்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "உண்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "உண்ணும்",],
                    ["தொழிற்பெயர்", "உண்டல்",],
                    ["பிறவினய்வடிவு", [
                        new Map([
                            ["இனம்", "வாங்கு",],
                            ["ஏவல்வினய்முற்று", "ஊட்டு",],
                            ["எதிர்மறய்வினய்முற்று", "ஊட்டார்",],
                            ["இறந்தகாலத்துவினய்முற்று", "ஊட்டினார்",],
                            ["நிகழ்காலத்துவினய்முற்று", "ஊட்டுகின்றார்",],
                            ["எதிர்காலத்துவினய்முற்று", "ஊட்டுவார்",],
                            ["எதிர்காலத்துவினயெச்சம்", "ஊட்ட",],
                            ["இறந்தகாலத்துவினயெச்சம்", "ஊட்டி",],
                            ["இறந்தகாலத்துப்பெயரெச்சம்", "ஊட்டிய",],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", "ஊட்டுகின்ற",],
                            ["எதிர்காலத்துப்பெயரெச்சம்", "ஊட்டும்",],
                            ["தொழிற்பெயர்", "ஊட்டுதல்",],
                        ],),
                        new Map([
                            ["இனம்", "பார்",],
                            ["ஏவல்வினய்முற்று", "உண்பி",],
                            ["எதிர்மறய்வினய்முற்று", "உண்பியார்",],
                            ["இறந்தகாலத்துவினய்முற்று", "உண்பித்தார்",],
                            ["நிகழ்காலத்துவினய்முற்று", "உண்பிக்கின்றார்",],
                            ["எதிர்காலத்துவினய்முற்று", "உண்பிப்பார்",],
                            ["எதிர்காலத்துவினயெச்சம்", "உண்பிக்க",],
                            ["இறந்தகாலத்துவினயெச்சம்", "உண்பித்து",],
                            ["இறந்தகாலத்துப்பெயரெச்சம்", "உண்பித்த",],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", "உண்பிக்கின்ற",],
                            ["எதிர்காலத்துப்பெயரெச்சம்", "உண்பிக்கும்",],
                            ["தொழிற்பெயர்", "உண்பித்தல்",],
                        ],),
                    ],],
                ],);
                t.deepEqual(getForms("உண்",), expected,);
            },);
            QUnit.test("காண்", (t) => {
                const expected = new Map([
                    ["இனம்", "காண்",],
                    ["ஏவல்வினய்முற்று", "காண்",],
                    ["எதிர்மறய்வினய்முற்று", "காணார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "கண்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "காண்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "காண்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "காண",],
                    ["இறந்தகாலத்துவினயெச்சம்", "கண்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "கண்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "காண்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "காணும்",],
                    ["தொழிற்பெயர்", "காண்டல்",],
                    ["பிறவினய்வடிவு", [
                        new Map([
                            ["இனம்", "வாங்கு",],
                            ["ஏவல்வினய்முற்று", "காட்டு",],
                            ["எதிர்மறய்வினய்முற்று", "காட்டார்",],
                            ["இறந்தகாலத்துவினய்முற்று", "காட்டினார்",],
                            ["நிகழ்காலத்துவினய்முற்று", "காட்டுகின்றார்",],
                            ["எதிர்காலத்துவினய்முற்று", "காட்டுவார்",],
                            ["எதிர்காலத்துவினயெச்சம்", "காட்ட",],
                            ["இறந்தகாலத்துவினயெச்சம்", "காட்டி",],
                            ["இறந்தகாலத்துப்பெயரெச்சம்", "காட்டிய",],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", "காட்டுகின்ற",],
                            ["எதிர்காலத்துப்பெயரெச்சம்", "காட்டும்",],
                            ["தொழிற்பெயர்", "காட்டுதல்",],
                        ],),
                        new Map([
                            ["இனம்", "பார்",],
                            ["ஏவல்வினய்முற்று", "காண்பி",],
                            ["எதிர்மறய்வினய்முற்று", "காண்பியார்",],
                            ["இறந்தகாலத்துவினய்முற்று", "காண்பித்தார்",],
                            ["நிகழ்காலத்துவினய்முற்று", "காண்பிக்கின்றார்",],
                            ["எதிர்காலத்துவினய்முற்று", "காண்பிப்பார்",],
                            ["எதிர்காலத்துவினயெச்சம்", "காண்பிக்க",],
                            ["இறந்தகாலத்துவினயெச்சம்", "காண்பித்து",],
                            ["இறந்தகாலத்துப்பெயரெச்சம்", "காண்பித்த",],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", "காண்பிக்கின்ற",],
                            ["எதிர்காலத்துப்பெயரெச்சம்", "காண்பிக்கும்",],
                            ["தொழிற்பெயர்", "காண்பித்தல்",],
                        ],),
                    ],],
                ],);
                t.deepEqual(getForms("காண்",), expected,);
            },);
        },);
        QUnit.module("கடயுயிர்", () => {
            QUnit.test("போ", (t) => {
                const expected = new Map([
                    ["இனம்", "போ",],
                    ["ஏவல்வினய்முற்று", "போ",],
                    ["எதிர்மறய்வினய்முற்று", "போகார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "போனார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "போகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "போவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "போக",],
                    ["இறந்தகாலத்துவினயெச்சம்", "போய்",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "போன",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "போகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "போகும்",],
                    ["தொழிற்பெயர்", "போதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "போக்கு",],
                        ["எதிர்மறய்வினய்முற்று", "போக்கார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "போக்கினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "போக்குகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "போக்குவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "போக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "போக்கி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "போக்கிய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "போக்குகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "போக்கும்",],
                        ["தொழிற்பெயர்", "போக்குதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("போ",), expected,);
            },);
            QUnit.test("ஆ", (t) => {
                const expected = new Map([
                    ["இனம்", "போ",],
                    ["ஏவல்வினய்முற்று", "ஆ",],
                    ["எதிர்மறய்வினய்முற்று", "ஆகார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "ஆனார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "ஆகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "ஆவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "ஆக",],
                    ["இறந்தகாலத்துவினயெச்சம்", "ஆய்",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "ஆன",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "ஆகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "ஆகும்",],
                    ["தொழிற்பெயர்", "ஆதல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "ஆக்கு",],
                        ["எதிர்மறய்வினய்முற்று", "ஆக்கார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "ஆக்கினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "ஆக்குகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "ஆக்குவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "ஆக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "ஆக்கி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "ஆக்கிய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "ஆக்குகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "ஆக்கும்",],
                        ["தொழிற்பெயர்", "ஆக்குதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("ஆ",), expected,);
            },);
            QUnit.test("நோ", (t) => {
                const expected = new Map([
                    ["இனம்", "நோ",],
                    ["ஏவல்வினய்முற்று", "நோ",],
                    ["எதிர்மறய்வினய்முற்று", "நோகார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "நொந்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "நோகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "நோவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "நோக",],
                    ["இறந்தகாலத்துவினயெச்சம்", "நொந்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "நொந்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "நோகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "நோகும்",],
                    ["தொழிற்பெயர்", "நோதல்",],
                ],);
                t.deepEqual(getForms("நோ",), expected,);
            },);
            QUnit.test("சா", (t) => {
                const expected = new Map([
                    ["இனம்", "சா",],
                    ["ஏவல்வினய்முற்று", "சா",],
                    ["எதிர்மறய்வினய்முற்று", "சாகார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "செத்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "சாகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "சாவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "சாக",],
                    ["இறந்தகாலத்துவினயெச்சம்", "செத்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "செத்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "சாகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "சாகும்",],
                    ["தொழிற்பெயர்", "சாதல்",],
                ],);
                t.deepEqual(getForms("சா",), expected,);
            },);
        },);
        QUnit.module("அடிப்படய்", () => {
            QUnit.test("அல்", (t) => {
                const expected = new Map([
                    ["இனம்", "அல்",],
                    ["ஏவல்வினய்முற்று", "",],
                    ["எதிர்மறய்வினய்முற்று", "",],
                    ["இறந்தகாலத்துவினய்முற்று", "அல்லார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "அல்லார்",],
                    ["எதிர்காலத்துவினய்முற்று", "அல்லார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "அற்ற",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "அற்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "அற்ற",],
                    ["தொழிற்பெயர்", "",],
                ],);
                t.deepEqual(getForms("அல்",), expected,);
            },);
            QUnit.test("உள்", (t) => {
                const expected = new Map([
                    ["இனம்", "உள்",],
                    ["ஏவல்வினய்முற்று", "",],
                    ["எதிர்மறய்வினய்முற்று", "",],
                    ["இறந்தகாலத்துவினய்முற்று", "உள்ளார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "உள்ளார்",],
                    ["எதிர்காலத்துவினய்முற்று", "உள்ளார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "உள்ள",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "உள்ள",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "உள்ள",],
                    ["தொழிற்பெயர்", "உள்ளுதல்",],
                ],);
                t.deepEqual(getForms("உள்",), expected,);
            },);
            QUnit.test("இல்", (t) => {
                const expected = new Map([
                    ["இனம்", "இல்",],
                    ["ஏவல்வினய்முற்று", "",],
                    ["எதிர்மறய்வினய்முற்று", "",],
                    ["இறந்தகாலத்துவினய்முற்று", "இல்லார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "இல்லார்",],
                    ["எதிர்காலத்துவினய்முற்று", "இல்லார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "இல்லாத",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "இல்லாத",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "இல்லாத",],
                    ["தொழிற்பெயர்", "",],
                ],);
                t.deepEqual(getForms("இல்",), expected,);
            },);
            QUnit.test("மாட்டு", (t) => {
                const expected = new Map([
                    ["இனம்", "மாட்டு",],
                    ["ஏவல்வினய்முற்று", "",],
                    ["எதிர்மறய்வினய்முற்று", "",],
                    ["இறந்தகாலத்துவினய்முற்று", "மாட்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "மாட்டார்",],
                    ["எதிர்காலத்துவினய்முற்று", "மாட்டார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துவினயெச்சம்", "",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "",],
                    ["தொழிற்பெயர்", "",],
                ],);
                t.deepEqual(getForms("மாட்டு", "மாட்டு",), expected,);
            },);
        },);
    },);
    QUnit.module("With ambiguous இனம்", () => {
        QUnit.module("படு", () => {
            QUnit.test("இனமில்லா படு", (t) => {
                t.throws(() => getForms("படு",), function(err) {
                    return err instanceof Error &&
                    RegExp(`^Multiple வினய் classes possible for படு: இடு,பார்\. Select one\.$`).test(err.message);
                },);
            },);
            QUnit.test("இடு இனத்தில் படு", (t) => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", "படு",],
                    ["எதிர்மறய்வினய்முற்று", "படார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "பட்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "படுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "படுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "பட",],
                    ["இறந்தகாலத்துவினயெச்சம்", "பட்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "பட்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "படுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "படும்",],
                    ["தொழிற்பெயர்", "பட்டல்",],
                    ["பிறவினய்வடிவு", new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "படுத்து",],
                        ["எதிர்மறய்வினய்முற்று", "படுத்தார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "படுத்தினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "படுத்துகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "படுத்துவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "படுத்த",],
                        ["இறந்தகாலத்துவினயெச்சம்", "படுத்தி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "படுத்திய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "படுத்துகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "படுத்தும்",],
                        ["தொழிற்பெயர்", "படுத்துதல்",],
                    ],),],
                ],);
                t.deepEqual(getForms("படு", "இடு",), expected,);
            },);
            QUnit.test("பார் இனத்தில் படு", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "படு",],
                    ["எதிர்மறய்வினய்முற்று", "படார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "படுத்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "படுக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "படுப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "படுக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "படுத்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "படுத்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "படுக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "படுக்கும்",],
                    ["தொழிற்பெயர்", "படுத்தல்",],
                ],);
                t.deepEqual(getForms("படு", "பார்",), expected,);
            },);
        },);
        QUnit.module("வய்", () => {
            QUnit.test("இனமில்லா வய்", (t) => {
                t.throws(() => getForms("வய்",), function(err) {
                    return err instanceof Error &&
                    RegExp(`^Multiple வினய் classes possible for வய்: .*\. Select one\.$`).test(err.message);
                },);
            },);
            QUnit.test("செய் இனத்தில் படு", (t) => {
                const expected = new Map([
                    ["இனம்", "செய்",],
                    ["ஏவல்வினய்முற்று", "வய்",],
                    ["எதிர்மறய்வினய்முற்று", "வய்யார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "வய்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "வய்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "வய்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "வய்ய",],
                    ["இறந்தகாலத்துவினயெச்சம்", "வய்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "வய்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "வய்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "வய்யும்",],
                    ["தொழிற்பெயர்", "வய்தல்",],
                ],);
                t.deepEqual(getForms("வய்", "செய்",), expected,);
            },);
            QUnit.test("பார் இனத்தில் வய்", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "வய்",],
                    ["எதிர்மறய்வினய்முற்று", "வய்யார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "வய்த்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "வய்க்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "வய்ப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "வய்க்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "வய்த்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "வய்த்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "வய்க்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "வய்க்கும்",],
                    ["தொழிற்பெயர்", "வய்த்தல்",],
                ],);
                t.deepEqual(getForms("வய்", "பார்",), expected,);
            },);
        },);
    },);
    QUnit.module("With பிறவினய் forms", () => {
        QUnit.module("Rule0", () => {
            QUnit.test("சுடு", (t) => {
                const expected = new Map([
                    ["இனம்", "இடு",],
                    ["ஏவல்வினய்முற்று", "சுடு",],
                    ["எதிர்மறய்வினய்முற்று", "சுடார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "சுட்டார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "சுடுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "சுடுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "சுட",],
                    ["இறந்தகாலத்துவினயெச்சம்", "சுட்டு",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "சுட்ட",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "சுடுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "சுடும்",],
                    ["தொழிற்பெயர்", "சுட்டல்",],
                ],);
                t.deepEqual(getForms("சுடு").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
        QUnit.module("Rule1", () => {
            QUnit.test("சேர்", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "சேர்",],
                    ["எதிர்மறய்வினய்முற்று", "சேரார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "சேர்த்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "சேர்க்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "சேர்ப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "சேர்க்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "சேர்த்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "சேர்த்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "சேர்க்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "சேர்க்கும்",],
                    ["தொழிற்பெயர்", "சேர்த்தல்",],
                ],);
                t.deepEqual(getForms("சேர்").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
        QUnit.module("Rule10", () => {
            QUnit.test("நட", (t) => {
                const expected = [
                    new Map([
                        ["இனம்", "வாங்கு",],
                        ["ஏவல்வினய்முற்று", "நடத்து",],
                        ["எதிர்மறய்வினய்முற்று", "நடத்தார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "நடத்தினார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "நடத்துகின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "நடத்துவார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "நடத்த",],
                        ["இறந்தகாலத்துவினயெச்சம்", "நடத்தி",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "நடத்திய",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "நடத்துகின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "நடத்தும்",],
                        ["தொழிற்பெயர்", "நடத்துதல்",],
                    ],),
                    new Map([
                        ["இனம்", "பார்",],
                        ["ஏவல்வினய்முற்று", "நடப்பி",],
                        ["எதிர்மறய்வினய்முற்று", "நடப்பியார்",],
                        ["இறந்தகாலத்துவினய்முற்று", "நடப்பித்தார்",],
                        ["நிகழ்காலத்துவினய்முற்று", "நடப்பிக்கின்றார்",],
                        ["எதிர்காலத்துவினய்முற்று", "நடப்பிப்பார்",],
                        ["எதிர்காலத்துவினயெச்சம்", "நடப்பிக்க",],
                        ["இறந்தகாலத்துவினயெச்சம்", "நடப்பித்து",],
                        ["இறந்தகாலத்துப்பெயரெச்சம்", "நடப்பித்த",],
                        ["நிகழ்காலத்துப்பெயரெச்சம்", "நடப்பிக்கின்ற",],
                        ["எதிர்காலத்துப்பெயரெச்சம்", "நடப்பிக்கும்",],
                        ["தொழிற்பெயர்", "நடப்பித்தல்",],
                    ],),
                ];
                t.deepEqual(getForms("நட").get("பிறவினய்வடிவு"), expected,);
            },);
            QUnit.test("நீள்", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "நீட்டு",],
                    ["எதிர்மறய்வினய்முற்று", "நீட்டார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "நீட்டினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "நீட்டுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "நீட்டுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "நீட்ட",],
                    ["இறந்தகாலத்துவினயெச்சம்", "நீட்டி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "நீட்டிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "நீட்டுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "நீட்டும்",],
                    ["தொழிற்பெயர்", "நீட்டுதல்",],
                ],);
                t.deepEqual(getForms("நீள்").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
        QUnit.module("Rule11", () => {
            QUnit.test("அடு", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "அடுக்கு",],
                    ["எதிர்மறய்வினய்முற்று", "அடுக்கார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "அடுக்கினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "அடுக்குகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "அடுக்குவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "அடுக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "அடுக்கி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "அடுக்கிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "அடுக்குகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "அடுக்கும்",],
                    ["தொழிற்பெயர்", "அடுக்குதல்",],
                ],);
                t.deepEqual(getForms("அடு").get("பிறவினய்வடிவு"), expected,);
            },);
            QUnit.test("அடு", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "அடுக்கு",],
                    ["எதிர்மறய்வினய்முற்று", "அடுக்கார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "அடுக்கினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "அடுக்குகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "அடுக்குவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "அடுக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "அடுக்கி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "அடுக்கிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "அடுக்குகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "அடுக்கும்",],
                    ["தொழிற்பெயர்", "அடுக்குதல்",],
                ],);
                t.deepEqual(getForms("அடு").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
        QUnit.module("Rule12", () => {
            QUnit.test("காய்", (t) => {
                const expected = new Map([
                    ["இனம்", "உயர்",],
                    ["ஏவல்வினய்முற்று", "காய்",],
                    ["எதிர்மறய்வினய்முற்று", "காயார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "காய்ந்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "காய்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "காய்வார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "காய",],
                    ["இறந்தகாலத்துவினயெச்சம்", "காய்ந்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "காய்ந்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "காய்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "காயும்",],
                    ["தொழிற்பெயர்", "காய்தல்",],
                    ["பிறவினய்வடிவு", [
                        new Map([
                            ["இனம்", "பார்",],
                            ["ஏவல்வினய்முற்று", "காய்",],
                            ["எதிர்மறய்வினய்முற்று", "காயார்",],
                            ["இறந்தகாலத்துவினய்முற்று", "காய்த்தார்",],
                            ["நிகழ்காலத்துவினய்முற்று", "காய்க்கின்றார்",],
                            ["எதிர்காலத்துவினய்முற்று", "காய்ப்பார்",],
                            ["எதிர்காலத்துவினயெச்சம்", "காய்க்க",],
                            ["இறந்தகாலத்துவினயெச்சம்", "காய்த்து",],
                            ["இறந்தகாலத்துப்பெயரெச்சம்", "காய்த்த",],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", "காய்க்கின்ற",],
                            ["எதிர்காலத்துப்பெயரெச்சம்", "காய்க்கும்",],
                            ["தொழிற்பெயர்", "காய்த்தல்",],
                        ],),
                        new Map([
                            ["இனம்", "வாங்கு",],
                            ["ஏவல்வினய்முற்று", "காய்ச்சு",],
                            ["எதிர்மறய்வினய்முற்று", "காய்ச்சார்",],
                            ["இறந்தகாலத்துவினய்முற்று", "காய்ச்சினார்",],
                            ["நிகழ்காலத்துவினய்முற்று", "காய்ச்சுகின்றார்",],
                            ["எதிர்காலத்துவினய்முற்று", "காய்ச்சுவார்",],
                            ["எதிர்காலத்துவினயெச்சம்", "காய்ச்ச",],
                            ["இறந்தகாலத்துவினயெச்சம்", "காய்ச்சி",],
                            ["இறந்தகாலத்துப்பெயரெச்சம்", "காய்ச்சிய",],
                            ["நிகழ்காலத்துப்பெயரெச்சம்", "காய்ச்சுகின்ற",],
                            ["எதிர்காலத்துப்பெயரெச்சம்", "காய்ச்சும்",],
                            ["தொழிற்பெயர்", "காய்ச்சுதல்",],
                        ],),
                    ],],
                ],);
                t.deepEqual(getForms("காய்"), expected,);
            },);
        },);
        QUnit.module("Rule20", () => {
            QUnit.test("செய்", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "செய்வி",],
                    ["எதிர்மறய்வினய்முற்று", "செய்வியார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "செய்வித்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "செய்விக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "செய்விப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "செய்விக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "செய்வித்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "செய்வித்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "செய்விக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "செய்விக்கும்",],
                    ["தொழிற்பெயர்", "செய்வித்தல்",],
                ],);
                t.deepEqual(getForms("செய்").get("பிறவினய்வடிவு"), expected,);
            },);
            QUnit.test("தெரி", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "தெரிவி",],
                    ["எதிர்மறய்வினய்முற்று", "தெரிவியார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "தெரிவித்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "தெரிவிக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "தெரிவிப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "தெரிவிக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "தெரிவித்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "தெரிவித்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "தெரிவிக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "தெரிவிக்கும்",],
                    ["தொழிற்பெயர்", "தெரிவித்தல்",],
                ],);
                t.deepEqual(getForms("தெரி").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
        QUnit.module("Rule21", () => {
            QUnit.test("கல்", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "கற்பி",],
                    ["எதிர்மறய்வினய்முற்று", "கற்பியார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "கற்பித்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "கற்பிக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "கற்பிப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "கற்பிக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "கற்பித்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "கற்பித்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "கற்பிக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "கற்பிக்கும்",],
                    ["தொழிற்பெயர்", "கற்பித்தல்",],
                ],);
                t.deepEqual(getForms("கல்").get("பிறவினய்வடிவு"), expected,);
            },);
            QUnit.test("சிற", (t) => {
                const expected = new Map([
                    ["இனம்", "பார்",],
                    ["ஏவல்வினய்முற்று", "சிறப்பி",],
                    ["எதிர்மறய்வினய்முற்று", "சிறப்பியார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "சிறப்பித்தார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "சிறப்பிக்கின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "சிறப்பிப்பார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "சிறப்பிக்க",],
                    ["இறந்தகாலத்துவினயெச்சம்", "சிறப்பித்து",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "சிறப்பித்த",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "சிறப்பிக்கின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "சிறப்பிக்கும்",],
                    ["தொழிற்பெயர்", "சிறப்பித்தல்",],
                ],);
                t.deepEqual(getForms("சிற").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
        QUnit.module("Rule30", () => {
            QUnit.test("ஆடு", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "ஆட்டு",],
                    ["எதிர்மறய்வினய்முற்று", "ஆட்டார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "ஆட்டினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "ஆட்டுகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "ஆட்டுவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "ஆட்ட",],
                    ["இறந்தகாலத்துவினயெச்சம்", "ஆட்டி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "ஆட்டிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "ஆட்டுகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "ஆட்டும்",],
                    ["தொழிற்பெயர்", "ஆட்டுதல்",],
                ],);
                t.deepEqual(getForms("ஆடு").get("பிறவினய்வடிவு"), expected,);
            },);
            QUnit.test("எழும்பு", (t) => {
                const expected = new Map([
                    ["இனம்", "வாங்கு",],
                    ["ஏவல்வினய்முற்று", "எழுப்பு",],
                    ["எதிர்மறய்வினய்முற்று", "எழுப்பார்",],
                    ["இறந்தகாலத்துவினய்முற்று", "எழுப்பினார்",],
                    ["நிகழ்காலத்துவினய்முற்று", "எழுப்புகின்றார்",],
                    ["எதிர்காலத்துவினய்முற்று", "எழுப்புவார்",],
                    ["எதிர்காலத்துவினயெச்சம்", "எழுப்ப",],
                    ["இறந்தகாலத்துவினயெச்சம்", "எழுப்பி",],
                    ["இறந்தகாலத்துப்பெயரெச்சம்", "எழுப்பிய",],
                    ["நிகழ்காலத்துப்பெயரெச்சம்", "எழுப்புகின்ற",],
                    ["எதிர்காலத்துப்பெயரெச்சம்", "எழுப்பும்",],
                    ["தொழிற்பெயர்", "எழுப்புதல்",],
                ],);
                t.deepEqual(getForms("எழும்பு").get("பிறவினய்வடிவு"), expected,);
            },);
        },);
    },);
},);
