import { புள்ளி, ஈ_letter_இ_ஈ_markers, ஆ_letter, ஆ_marker, உ_marker, ஊ_marker, ஒ_marker, ஓ_marker, ய_ர_ழ, குறில், consonants, } from "./ezuttu.js";
import { anyOfArray, } from "./utils.js";

const monosyllabicShortTerminalDoubler = (வினய்) => வினய்.replace(
    RegExp(`^(${anyOfArray(consonants)}?${anyOfArray(குறில்)}?)(.)${புள்ளி}$`, "v",),
    `$1$2${புள்ளி}$2${புள்ளி}`,
);

const terminalஓShortener = (வினய்) => வினய்.replace(
    RegExp(`${ஓ_marker}$`, "v",),
    `${ஒ_marker}`,
);

const lastஆShortener = (வினய்) => வினய்.replace(
    RegExp(`${ஆ_marker}([^${ஆ_marker}]*)$`, "v",),
    `$1`,
);

class வினயினம் {
    constructor(இனத்துப்பெயர்) {
        this.இனத்துப்பெயர் = இனத்துப்பெயர்;
    }
    வினய்(வினய்) {
        return வினய்;
    }
    valid() {
        return true;
    }
    ஏவல்வினய்முற்று(வினய்) {
        return வினய்;
    }
    அல்வினய்முற்று(வினய்) {
        return this.எதிர்காலத்துவினயெச்சம்(வினய்) + "ார்";
    }
    இறந்தகாலத்துவினயெச்சம்() {
        throw new Error("Abstract method!");
    }
    இறந்தகாலத்துப்பெயரெச்சம்(வினய்) {
        return this.இறந்தகாலத்துவினயெச்சம்(வினய்) + "அ";
    }
    இறந்தகாலத்துவினய்முற்று(வினய்) {
        return this.இறந்தகாலத்துப்பெயரெச்சம்(வினய்) + "ார்";
    }
    நிகழ்காலத்துப்பெயரெச்சம்(வினய்) {
        return வினய் + "கின்ற";
    }
    நிகழ்காலத்துவினய்முற்று(வினய்) {
        return this.நிகழ்காலத்துப்பெயரெச்சம்(வினய்) + "ார்";
    }
    எதிர்காலத்துவினயெச்சம்(வினய்) {
        return monosyllabicShortTerminalDoubler(வினய்) + "அ";
    }
    எதிர்காலத்துப்பெயரெச்சம்(வினய்) {
        return this.எதிர்காலத்துவினயெச்சம்(வினய்) + "ும்";
    }
    எதிர்காலத்துவினய்முற்று(வினய்) {
        return வினய் + "வார்";
    }
    தொழிற்பெயர்(வினய்) {
        return வினய் + "தல்";
    }
}

const வாங்கு = new வினயினம்("வாங்கு");
வாங்கு.valid = (வினய்) => வினய்.endsWith(உ_marker);
வாங்கு.இறந்தகாலத்துவினயெச்சம் = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "இ";
வாங்கு.இறந்தகாலத்துவினய்முற்று = (வினய்) => வினய் + "இனார்";

const பார் = new வினயினம்("பார்");
பார்.அல்வினய்முற்று = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "ஆர்";
பார்.இறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய் + "த்து";
பார்.நிகழ்காலத்துப்பெயரெச்சம் = (வினய்) => வினய் + "க்கின்ற";
பார்.எதிர்காலத்துவினயெச்சம் = (வினய்) => வினய் + "க்க";
பார்.எதிர்காலத்துவினய்முற்று = (வினய்) => வினய் + "ப்பார்";
பார்.தொழிற்பெயர் = (வினய்) => வினய் + "த்தல்";

const உயர் = new வினயினம்("உயர்");
உயர்.valid = function(வினய்) {
    const lastCharacter = வினய்[வினய்.length - 1];
    if (ஈ_letter_இ_ஈ_markers.includes(lastCharacter)) {
        return true;
    }
    if (உ_marker === lastCharacter) {
        return true;
    }
    if (புள்ளி !== lastCharacter) {
        return false;
    }
    if (! ய_ர_ழ.includes(வினய்[வினய்.length - 2])) {
        return false;
    }
    return true;
};
உயர்.இறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய் + "ந்து";

const இயல் = { __proto__: உயர், இனத்துப்பெயர்: "இயல்", };
இயல்.valid = function(வினய்) {
    const match = வினய்.match(/..$/);
    if (! match) {
        return false;
    }
    return ['ள்','ல்',].includes(match[0]);
};
இயல்.தொழிற்பெயர் = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "உதல்";

const இரு = { __proto__: பார், இனத்துப்பெயர்: "இரு", };
இரு.இறந்தகாலத்துவினயெச்சம் = உயர்.இறந்தகாலத்துவினயெச்சம்;

const இடு = new வினயினம்("இடு");
இடு.valid = function(வினய்) {
    const match = வினய்.match(/..$/);
    if (! match) {
        return false;
    }
    return ['டு','று',].includes(match[0]);
};
இடு.இறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய்.replace(
    RegExp(`(.)${உ_marker}$`, "v",),
    `$1${புள்ளி}$1${உ_marker}`,
);

const செய் = new வினயினம்("செய்");
செய்.இறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய் + "து";

const தின் =  { __proto__: செய், இனத்துப்பெயர்: "தின்", };
தின்.valid = function(வினய்) {
    const match = வினய்.match(/..$/);
    if (! match) {
        return false;
    }
    return ['ண்','ன்',].includes(match[0]);
};
தின்.தொழிற்பெயர் = இயல்.தொழிற்பெயர்;

const வா = { __proto__: செய், இனத்துப்பெயர்: "வா", };
வா.வினய் = function(வினய்) { return lastஆShortener(வினய்) + "ரு"; };
வா.valid = (வினய்) => வினய்.endsWith(ஆ_marker);
வா.ஏவல்வினய்முற்று = (வினய்) => வினய்.replace("ரு","") + "ா";
வா.இறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய்.replace("ரு","") + "ந்து";

const சொல் = { __proto__: இயல், இனத்துப்பெயர்: "சொல்", };
சொல்.இறந்தகாலத்துவினயெச்சம் = வாங்கு.இறந்தகாலத்துவினயெச்சம்;
சொல்.சிறப்பிறந்தகாலத்துப்பெயரெச்சம் = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "ந";
சொல்.இறந்தகாலத்துப்பெயரெச்சம் = function(வினய்) { return [வினயினம்.prototype.இறந்தகாலத்துப்பெயரெச்சம்.call(this, வினய்,), சொல்.சிறப்பிறந்தகாலத்துப்பெயரெச்சம்(வினய்),];
};
சொல்.இறந்தகாலத்துவினய்முற்று = (வினய்) => சொல்.சிறப்பிறந்தகாலத்துப்பெயரெச்சம்(வினய்) + "ார்";

const காண் = { __proto__: தின், இனத்துப்பெயர்: "காண்", };
காண்.valid = function(வினய்) {
    const match = வினய்.match(/...$/);
    if (! match) {
        return false;
    }
    return ['ாண்', 'ான்',].includes(match[0]);
};
காண்.இறந்தகாலத்துவினயெச்சம் = (வினய்) => lastஆShortener(வினய்) + "து";

const கடயுயிர் = { __proto__: செய், இனத்துப்பெயர்: "கடயுயிர்", };
கடயுயிர்.எதிர்காலத்துவினயெச்சம் = (வினய்) => வினய் + "க";

const போ = { __proto__: கடயுயிர், இனத்துப்பெயர்: "போ", };
போ.valid = (வினய்) => [ஆ_letter, ஆ_marker, ஊ_marker, ஓ_marker,].includes(வினய்[வினய்.length - 1]);
போ.இறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய் + "ய்";
போ.இறந்தகாலத்துப்பெயரெச்சம் = (வினய்) => வினய் + "ன";

const ஆ = { __proto__: போ, இனத்துப்பெயர்: "ஆ", };
ஆ.சிறப்பிறந்தகாலத்துவினயெச்சம் = (வினய்) => வினய் + "கி";
ஆ.இறந்தகாலத்துவினயெச்சம் = (வினய்) => [போ.இறந்தகாலத்துவினயெச்சம்(வினய்), ஆ.சிறப்பிறந்தகாலத்துவினயெச்சம்(வினய்),];
ஆ.இறந்தகாலத்துப்பெயரெச்சம் = (வினய்) => [போ.இறந்தகாலத்துப்பெயரெச்சம்(வினய்), ஆ.சிறப்பிறந்தகாலத்துவினயெச்சம்(வினய்) + "அ",];
ஆ.இறந்தகாலத்துவினய்முற்று = (வினய்) => போ.இறந்தகாலத்துப்பெயரெச்சம்(வினய்) + "ார்";

const நோ = { __proto__: கடயுயிர், இனத்துப்பெயர்: "நோ", };
நோ.valid = (வினய்) => வினய்.endsWith(ஓ_marker);
நோ.இறந்தகாலத்துவினயெச்சம் = (வினய்) => terminalஓShortener(வினய்) + "ந்து";

const சா = { __proto__: கடயுயிர், இனத்துப்பெயர்: "சா", };
சா.valid = (வினய்) => வினய்.endsWith(ஆ_marker);
சா.இறந்தகாலத்துவினயெச்சம் = (வினய்) => lastஆShortener(வினய்) + "ெத்து";

const emptyStringGenerator = () => "";

const அடிப்படய் = { __proto__: இயல், இனத்துப்பெயர்: "அடிப்படய்", };
அடிப்படய்.ஏவல்வினய்முற்று = அடிப்படய்.அல்வினய்முற்று = அடிப்படய்.எதிர்காலத்துவினயெச்சம் = அடிப்படய்.இறந்தகாலத்துவினயெச்சம் = emptyStringGenerator;
அடிப்படய்.இறந்தகாலத்துவினய்முற்று = அடிப்படய்.நிகழ்காலத்துவினய்முற்று = அடிப்படய்.எதிர்காலத்துவினய்முற்று = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "அ" + "ார்";

const அல் = { __proto__: அடிப்படய், இனத்துப்பெயர்: "அல்", };
அல்.valid = (வினய்) => வினய் == "அல்";
அல்.இறந்தகாலத்துப்பெயரெச்சம் = அல்.நிகழ்காலத்துப்பெயரெச்சம் = அல்.எதிர்காலத்துப்பெயரெச்சம் = (வினய்) => வினய் + "த்த";
அல்.தொழிற்பெயர் = emptyStringGenerator;

const உள் = { __proto__: அடிப்படய், இனத்துப்பெயர்: "உள்", };
உள்.valid = (வினய்) => வினய் == "உள்";
உள்.இறந்தகாலத்துப்பெயரெச்சம் = உள்.நிகழ்காலத்துப்பெயரெச்சம் = உள்.எதிர்காலத்துப்பெயரெச்சம் = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "அ";

const இல் = { __proto__: அடிப்படய், இனத்துப்பெயர்: "இல்", };
இல்.valid = (வினய்) => வினய் == "இல்";
இல்.இறந்தகாலத்துப்பெயரெச்சம் = இல்.நிகழ்காலத்துப்பெயரெச்சம் = இல்.எதிர்காலத்துப்பெயரெச்சம் = (வினய்) => monosyllabicShortTerminalDoubler(வினய்) + "ஆத";
இல்.தொழிற்பெயர் = emptyStringGenerator;

const TBD = new Proxy(new வினயினம்("TBD"), {
    get(_unused, prop) {
        if (prop === "இனத்துப்பெயர்") {
            return "TBD";
        }
        return () => "TBD";
    },
});

export {வாங்கு, பார், உயர், இயல், இரு, இடு, செய், தின், வா, சொல், போ, ஆ, நோ, சா, காண், அல், உள், இல், TBD, };
const வினயினங்கள் = [வாங்கு, பார், உயர், இயல், இரு, இடு, செய், தின், வா, சொல், போ, ஆ, நோ, சா, காண், அல், உள், இல்,];

export const வினயினத்துப்பெயர்கள் = வினயினங்கள்.map((வினயினம்,) => வினயினம்.இனத்துப்பெயர்,);

export function validவினயினத்துப்பெயர்கள்(வினய்,) {
    return வினயினங்கள்.filter((வினயினம்,) => வினயினம்.valid(வினய்,)).map((வினயினம்) => வினயினம்.இனத்துப்பெயர்,);
}
