import { புணர்ச்சி, } from "./punarcci.js";
import { வினய், } from "./vinay.js";
import { getபிறவினய், } from "./pitavinay.js";

export { வினயினத்துப்பெயர்கள் as verbClasses, validவினயினத்துப்பெயர்கள் as validVerbClasses, } from "./vinayinam.js";

export const schema = new Map([
    ["ஏவல்வினய்முற்று", "ஏவல் வினைமுற்று (ஒருமையில்)",],
    ["போனகாலத்துவினயெச்சம்", "போனகாலத்து வினையெச்சம்",],
    ["போனகாலத்துப்பெயரெச்சம்", "போனகாலத்துப் பெயரெச்சம்",],
    ["போனகாலத்துவினய்முற்று", "போனகாலத்து வினைமுற்று (பலர்பாலில்)",],
    ["எதிர்மறய்வினய்முற்று", "எதிர்மறை வினைமுற்று (பலர்பாலில்)",],
    ["வருங்காலத்துவினயெச்சம்", "வருங்காலத்து வினையெச்சம்",],
    ["வருங்காலத்துப்பெயரெச்சம்", "வருங்காலத்துப் பெயரெச்சம்",],
    ["வருங்காலத்துவினய்முற்று", "வருங்காலத்து வினைமுற்று (பலர்பாலில்)",],
    ["தொழிற்பெயர்", "தொழிற்பெயர்",],
    ["நிகழ்காலத்துப்பெயரெச்சம்", "நிகழ்காலத்துப் பெயரெச்சம்",],
    ["நிகழ்காலத்துவினய்முற்று", "நிகழ்காலத்து வினைமுற்று (பலர்பாலில்)",],
],);

export const causativeFormsKey = "பிறவினய்வடிவு";

export const getForms = (வினய்ப்பெயர், இனத்துப்பெயர், புத்தெழுத்துமுறயோ,) => {
    const தன்வினய் = new வினய்(வினய்ப்பெயர், இனத்துப்பெயர், புத்தெழுத்துமுறயோ,);

    const புணர்ச்சிவிதிகள் = புணர்ச்சி(புத்தெழுத்துமுறயோ,);

    const வினய்toவடிவு = வினய்_ => Array.from(schema.keys(),).reduce(
        (forms, item,) => forms.set(
            item,
            புணர்ச்சிவிதிகள்.reduce(
                (intermediateForms, புணர்ச்சிவிதி,) => new Set(Array.from(intermediateForms,).map(புணர்ச்சிவிதி,),),
                வினய்_[item](),
            ),
        ),
        new Map([["இனம்", வினய்_.வினயினம்.இனத்துப்பெயர்,],],),
    );

    const allForms = வினய்toவடிவு(தன்வினய்,);

    const பிறவினய்வடிவு = (தன்வினய்_ => {
        const பிறவினய் = getபிறவினய்(தன்வினய்_,);

        if (! பிறவினய்) {
            return null;
        }

        if (! Array.isArray(பிறவினய்,)) {
            return வினய்toவடிவு(பிறவினய்,);
        }

        return பிறவினய்.map(e => வினய்toவடிவு(e,),);
    })(தன்வினய்,);

    if (பிறவினய்வடிவு) {
        allForms.set("பிறவினய்வடிவு", பிறவினய்வடிவு,);
    }

    return allForms;
};
