import { புணர்ச்சி, } from "./punarcci.js";
import { வினய், } from "./vinay.js";
import { getபிறவினய், } from "./pitavinay.js";

export const schema = new Map([
    ["ஏவல்வினய்முற்று", "ஏவல் வினய்முற்று (ஒருமயில்)",],
    ["எதிர்மறய்வினய்முற்று", "எதிர்மறய் வினய்முற்று (பலர்பாலில்)",],
    ["இறந்தகாலத்துவினய்முற்று", "இறந்தகாலத்து வினய்முற்று (பலர்பாலில்)",],
    ["நிகழ்காலத்துவினய்முற்று", "நிகழ்காலத்து வினய்முற்று (பலர்பாலில்)",],
    ["எதிர்காலத்துவினய்முற்று", "எதிர்காலத்து வினய்முற்று (பலர்பாலில்)",],
    ["எதிர்காலத்துவினயெச்சம்", "எதிர்காலத்து வினயெச்சம்",],
    ["இறந்தகாலத்துவினயெச்சம்", "இறந்தகாலத்து வினயெச்சம்",],
    ["இறந்தகாலத்துப்பெயரெச்சம்", "இறந்தகாலத்துப் பெயரெச்சம்",],
    ["நிகழ்காலத்துப்பெயரெச்சம்", "நிகழ்காலத்துப் பெயரெச்சம்",],
    ["எதிர்காலத்துப்பெயரெச்சம்", "எதிர்காலத்துப் பெயரெச்சம்",],
    ["தொழிற்பெயர்", "தொழிற்பெயர்",],
],);

export const causativeFormsKey = "பிறவினய்வடிவு";

const வினய்toவடிவு = (வினய்_, புத்தெழுத்துமுறயோ,) => Array.from(schema.keys(),).reduce(
    (forms, item,) => forms.set(
        item,
        புணர்ச்சி(புத்தெழுத்துமுறயோ,).reduce(
            (acc, val,) => {
                if (! (acc instanceof Set)) {
                    return val(acc,);
                }
                return new Set([...acc,].map(val,),);
            },
            வினய்_[item](),
        ),
    ),
    new Map([["இனம்", வினய்_.வினயினம்.இனத்துப்பெயர்,],],),
);

export const getForms = (வினய்ப்பெயர், இனத்துப்பெயர், புத்தெழுத்துமுறயோ,) => {
    if (! வினய்ப்பெயர்) {
        return new Map();
    }

    const தன்வினய் = new வினய்(வினய்ப்பெயர், இனத்துப்பெயர், புத்தெழுத்துமுறயோ,);
    const allForms = வினய்toவடிவு(தன்வினய், புத்தெழுத்துமுறயோ,);

    const பிறவினய்வடிவு = ((தன்வினய்_,) => {
        const பிறவினய் = getபிறவினய்(தன்வினய்_,);

        if (! பிறவினய்) {
            return;
        }

        if (! Array.isArray(பிறவினய்,)) {
            return வினய்toவடிவு(பிறவினய், புத்தெழுத்துமுறயோ,);
        }

        return பிறவினய்.map(e => வினய்toவடிவு(e,),);
    })(தன்வினய்,);

    if (பிறவினய்வடிவு) {
        allForms.set("பிறவினய்வடிவு", பிறவினய்வடிவு,);
    }

    return allForms;
};
