import { வினய்Data, } from "./vinayData.js";
import { வினயினம்byபெயர், } from "./vinayinam.js";

export class வினய் {
    constructor(வினய்ப்பெயர், இனத்துப்பெயர்,) {
        if (! வினய்ப்பெயர்) {
            return undefined;
        }

        this.வினயினம் = ((வினய்ப்பெயர், இனத்துப்பெயர்,) => {
            if (இனத்துப்பெயர்) {
                const வினயினம் = வினயினம்byபெயர்(இனத்துப்பெயர்,);

                if (! வினயினம்.valid(வினய்ப்பெயர்,)) {
                    throw new Error(`வினய் ${வினய்ப்பெயர்} isn't valid for வினயினம் ${இனத்துப்பெயர்}.`,);
                }

                return வினயினம்;
            }

            const வினயினம் = வினய்Data.get(வினய்ப்பெயர்,).இனம்;

            if (Array.isArray(வினயினம்)) {
                const பெயர்கள் = வினயினம்.map((இனம்) => இனம்.இனத்துப்பெயர்,);
                throw new Error(`Multiple வினய் classes possible for ${வினய்ப்பெயர்}: ${பெயர்கள்}. Select one.`,);
            }

            if (! வினயினம்) {
                throw new Error(`Unknown வினய் ${வினய்ப்பெயர்}.`,);
            }

            return வினயினம்;
        })(வினய்ப்பெயர், இனத்துப்பெயர்,);

        this.வினய் = this.வினயினம்.வினய்(வினய்ப்பெயர்);
    }

    // TODO: clean up

    ஏவல்வினய்முற்று() {
        return this.வினயினம்.ஏவல்வினய்முற்று(this.வினய்);
    }
    அல்வினய்முற்று() {
        return this.வினயினம்.அல்வினய்முற்று(this.வினய்);
    }
    இறந்தகாலத்துவினயெச்சம்() {
        return this.வினயினம்.இறந்தகாலத்துவினயெச்சம்(this.வினய்);
    }
    இறந்தகாலத்துப்பெயரெச்சம்() {
        return this.வினயினம்.இறந்தகாலத்துப்பெயரெச்சம்(this.வினய்);
    }
    இறந்தகாலத்துவினய்முற்று() {
        return this.வினயினம்.இறந்தகாலத்துவினய்முற்று(this.வினய்);
    }
    நிகழ்காலத்துப்பெயரெச்சம்() {
        return this.வினயினம்.நிகழ்காலத்துப்பெயரெச்சம்(this.வினய்);
    }
    நிகழ்காலத்துவினய்முற்று() {
        return this.வினயினம்.நிகழ்காலத்துவினய்முற்று(this.வினய்);
    }
    எதிர்காலத்துவினயெச்சம்() {
        return this.வினயினம்.எதிர்காலத்துவினயெச்சம்(this.வினய்);
    }
    எதிர்காலத்துப்பெயரெச்சம்() {
        return this.வினயினம்.எதிர்காலத்துப்பெயரெச்சம்(this.வினய்);
    }
    எதிர்காலத்துவினய்முற்று() {
        return this.வினயினம்.எதிர்காலத்துவினய்முற்று(this.வினய்);
    }
    தொழிற்பெயர்() {
        return this.வினயினம்.தொழிற்பெயர்(this.வினய்);
    }
}

