import { புள்ளி, இஈLettersOrMarkers, ஆLetter, ஆMarker, உMarker, ஏLetter, ஏMarker, ஓLetter, ஓMarker, ண்ன்ள்ல்ழ், இடயினம், உLetter, } from "./ezuttu.js";
import { monosyllabicShortTerminalDoubler, terminalஏஓShortener, lastஆShortener, terminalஉRemover, terminalதNasaliser, } from "./punarcci.js";

const TWO_CHAR_RE = /..$/v;
const THREE_CHAR_RE = /...$/v;

const வினய்முற்றுstub1 = (பகுதி, இடம், எண்,) => {
    if (இடம் === "தன்மய்") {
        if (எண் === "ஒருமய்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஏன்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அன்`,),],);
        }
        if (எண் === "பன்மய்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஓம்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அனம்`,),],);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "முன்னிலய்") {
        if (எண் === "ஒருமய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆய்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஈர்`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "படர்க்கய்") {
        if (எண் === "ஆண்பால்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஆன்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அனன்`,),],);
        }
        if (எண் === "பெண்பால்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஆள்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அனள்`,),],);
        }
        if (எண் === "பலர்பால்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஆர்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அனர்`,),],);
        }
        if (எண் === "ஒன்றன்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}அது`,),);
        }
        if (எண் === "பலவின்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}அன`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    throw new Error(`Invalid இடம்: ${இடம்}`,);
};

const எதிர்மறய்வினய்முற்றுstub = (பகுதி, இடம், எண்,) => {
    if (இடம் === "தன்மய்") {
        if (எண் === "ஒருமய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஏன்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஓம்`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "முன்னிலய்") {
        if (எண் === "ஒருமய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆய்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஈர்`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "படர்க்கய்") {
        if (எண் === "ஆண்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆன்`,),);
        }
        if (எண் === "பெண்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆள்`,),);
        }
        if (எண் === "பலர்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆர்`,),);
        }
        if (எண் === "ஒன்றன்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆது`,),);
        }
        if (எண் === "பலவின்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆ`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    throw new Error(`Invalid இடம்: ${இடம்}`,);
};

const வருங்காலத்துவினய்முற்றுstub = (பகுதி, இடம், எண்,) => {
    if (இடம் === "தன்மய்") {
        if (எண் === "ஒருமய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஏன்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஓம்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அம்`,),],);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "முன்னிலய்") {
        if (எண் === "ஒருமய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஆய்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}ஈர்`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "படர்க்கய்") {
        if (எண் === "ஆண்பால்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஆன்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அன்`,),],);
        }
        if (எண் === "பெண்பால்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஆள்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அள்`,),],);
        }
        if (எண் === "பலர்பால்") {
            return new Set([...பகுதி.values().map(val => `${val}${புள்ளி}ஆர்`,), ...பகுதி.values().map(val => `${val}${புள்ளி}அர்`,),],);
        }
        if (எண் === "ஒன்றன்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}அது`,),);
        }
        if (எண் === "பலவின்பால்") {
            return new Set(பகுதி.values().map(val => `${val}${புள்ளி}அன`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    throw new Error(`Invalid இடம்: ${இடம்}`,);
};

/* eslint-disable class-methods-use-this -- We override these methods in instance வினயினம்s in creative ways that making these static disallows us from doing */

class வினயினம் {
    constructor(இனத்துப்பெயர்,) {
        this.இனத்துப்பெயர் = இனத்துப்பெயர்;
    }

    பகுதி(பகுதி,) {
        return பகுதி;
    }

    valid() {
        return true;
    }

    ஏவல்வினய்முற்று(பகுதி, எண்,) {
        if (எண் === "ஒருமய்") {
            return new Set([பகுதி,],);
        }
        if (எண் === "பன்மய்") {
            return new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}உம்`,],);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }

    போனகாலத்துவினயெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}து`,],);
    }

    போனகாலத்துப்பெயரெச்சம்(பகுதி,) {
        return new Set(this.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}அ`,),);
    }

    போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்,) {
        return வினய்முற்றுstub1(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்,);
    }

    எதிர்மறய்வினயெச்சம்() {
        return new Set();
    }

    எதிர்மறய்ப்பெயரெச்சம்() {
        return new Set();
    }

    எதிர்மறய்வினய்முற்று(பகுதி, இடம், எண்,) {
        return எதிர்மறய்வினய்முற்றுstub(வினயினம்.prototype.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்,);
    }

    வருங்காலத்துவினயெச்சம்(பகுதி,) {
        return new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}அ`,],);
    }

    வருங்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return new Set(this.வருங்காலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}${புள்ளி}உம்`,),);
    }

    வருங்காலத்துவினய்முற்று(பகுதி, இடம், எண்,) {
        const intermediateForms = வருங்காலத்துவினய்முற்றுstub((() => {
            if (! ண்ன்ள்ல்ழ்.includes(பகுதி.match(TWO_CHAR_RE,)?.[0],)) {
                return new Set([`${பகுதி}வ`,],);
            }
            return new Set([
                `${பகுதி}வ`,
                `${monosyllabicShortTerminalDoubler(பகுதி,)}உவ`,
            ],);
        })(), இடம், எண்,);
        if ((இடம் !== "படர்க்கய்") || (எண் !== "ஒன்றன்பால்")) {
            return intermediateForms;
        }
        return intermediateForms.union(this.வருங்காலத்துப்பெயரெச்சம்(பகுதி,),);
    }

    வியங்கோள்வினய்முற்று(பகுதி,) {
        if (! ண்ன்ள்ல்ழ்.includes(பகுதி.match(TWO_CHAR_RE,)?.[0],)) {
            return new Set([`${பகுதி}க`,],);
        }
        return new Set([
            `${பகுதி}க`,
            `${monosyllabicShortTerminalDoubler(பகுதி,)}உக`,
        ],);
    }

    தொழிற்பெயர்(பகுதி,) {
        const match = பகுதி.match(TWO_CHAR_RE,);
        if (! ண்ன்ள்ல்ழ்.includes(match?.[0],)) {
            return new Set([`${பகுதி}தல்`,],);
        }
        if (["ண்", "ன்", "ழ்",].includes(match[0],)) {
            return new Set([
                `${பகுதி}தல்`,
                `${monosyllabicShortTerminalDoubler(பகுதி,)}உதல்`,
            ],);
        }
        return new Set([
            `${பகுதி}த்தல்`,
            `${monosyllabicShortTerminalDoubler(பகுதி,)}உதல்`,
        ],);
    }

    நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,) {
        if (! ண்ன்ள்ல்ழ்.includes(பகுதி.match(TWO_CHAR_RE,)?.[0],)) {
            return new Set([`${பகுதி}கின்ற`,],);
        }
        return new Set([
            `${பகுதி}கின்ற`,
            `${monosyllabicShortTerminalDoubler(பகுதி,)}உகின்ற`,
        ],);
    }

    நிகழ்காலத்துவினய்முற்று(பகுதி, இடம், எண்,) {
        return வினய்முற்றுstub1(this.நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்,);
    }
}

/* eslint-enable class-methods-use-this */

const செய் = new வினயினம்("செய்",);

const வா = new வினயினம்("வா",);
வா.பகுதி = பகுதி => `${lastஆShortener(பகுதி,)}ரு`;
வா.valid = பகுதி => [ஆLetter, ஆMarker,].includes(பகுதி[பகுதி.length - 1],);
வா.ஏவல்வினய்முற்று = (பகுதி, எண்,) => {
    const baseForm = பகுதி.replace("ரு", "",);
    if (எண் === "ஒருமய்") {
        return new Set([`${baseForm}${புள்ளி}ஆ`,],);
    }
    if (எண் === "பன்மய்") {
        return new Set([`${baseForm}${புள்ளி}ஆரும்`,],);
    }
    throw new Error(`Invalid எண்: ${எண்}`,);
};
வா.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி.replace("ரு", "",)}ந்து`,],);

const காண் = new வினயினம்("காண்",);
காண்.valid = பகுதி => ["ாண்", "ான்", "ஆண்", "ஆன்",].includes(பகுதி.match(THREE_CHAR_RE,)?.[0],);
காண்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${lastஆShortener(பகுதி,)}து`,],);

const கடயுயிரோரசய் = new வினயினம்("கடயுயிரோரசய்",);
கடயுயிரோரசய்.ஏவல்வினய்முற்று = function (பகுதி, எண்,) {
    if (எண் === "ஒருமய்") {
        return வினயினம்.prototype.ஏவல்வினய்முற்று(பகுதி, எண்,);
    }
    if (எண் === "பன்மய்") {
        return new Set([`${பகுதி}உம்`, `${பகுதி}ம்`,],);
    }
    throw new Error(`Invalid எண்: ${எண்}`,);
};
கடயுயிரோரசய்.எதிர்மறய்வினய்முற்று = (பகுதி, இடம், எண்,) => எதிர்மறய்வினய்முற்றுstub(கடயுயிரோரசய்.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்,);
கடயுயிரோரசய்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}க`,],);
கடயுயிரோரசய்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => {
    const intermediateForms = வருங்காலத்துவினய்முற்றுstub([`${பகுதி}வ`, `${பகுதி}குவ`,], இடம், எண்,);
    if ((இடம் !== "படர்க்கய்") || (எண் !== "ஒன்றன்பால்")) {
        return intermediateForms;
    }
    return intermediateForms.union(கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம்(பகுதி,),);
};
கடயுயிரோரசய்.வியங்கோள்வினய்முற்று = பகுதி => new Set([`${பகுதி}க`, `${பகுதி}குக`,],);
கடயுயிரோரசய்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}தல்`, `${பகுதி}குதல்`,],);

const போ = Object.create(கடயுயிரோரசய்,);
போ.இனத்துப்பெயர் = "போ";
போ.valid = பகுதி => [ஆLetter, ஆMarker, ஓLetter, ஓMarker,].includes(பகுதி[பகுதி.length - 1],);
போ.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ய்`,],);
போ.போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}ன`, `${பகுதி}யின`,],);
போ.போனகாலத்துவினய்முற்று = function (பகுதி, இடம், எண்,) {
    if ((இடம் !== "படர்க்கய்") || (எண் !== "ஒன்றன்பால்")) {
        return கடயுயிரோரசய்.போனகாலத்துவினய்முற்று.call(this, பகுதி, இடம், எண்,);
    }
    return கடயுயிரோரசய்.போனகாலத்துவினய்முற்று.call(this, பகுதி, இடம், எண்,).union(new Set(போ.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}இற்று`,),),);
};

const நோ = Object.create(கடயுயிரோரசய்,);
நோ.இனத்துப்பெயர் = "நோ";
நோ.valid = பகுதி => [ஏLetter, ஏMarker, ஓLetter, ஓMarker,].includes(பகுதி[பகுதி.length - 1],);
நோ.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${terminalஏஓShortener(பகுதி,)}ந்து`,],);

const சா = Object.create(கடயுயிரோரசய்,);
சா.இனத்துப்பெயர் = "சா";
சா.valid = பகுதி => [ஆLetter, ஆMarker,].includes(பகுதி[பகுதி.length - 1],);
சா.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${lastஆShortener(பகுதி,)}${புள்ளி}எத்து`,],);

// உயர் has different போனகாலத்து forms
const உயர் = new வினயினம்("உயர்",);
உயர்.valid = பகுதி => {
    const lastCharacter = பகுதி[பகுதி.length - 1];
    if (இஈLettersOrMarkers.includes(lastCharacter,)) {
        return true;
    }
    if ([உLetter, உMarker,].includes(lastCharacter,)) {
        return true;
    }
    if (புள்ளி !== lastCharacter) {
        return false;
    }
    if (! இடயினம்.includes(பகுதி[பகுதி.length - 2],)) {
        return false;
    }
    return true;
};
உயர்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ந்து`,],);

const பார் = new வினயினம்("பார்",);
பார்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}த்து`,],);
பார்.எதிர்மறய்வினய்முற்று = (பகுதி, இடம், எண்,) => எதிர்மறய்வினய்முற்றுstub(பார்.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்,).union(வினயினம்.prototype.எதிர்மறய்வினய்முற்று(பகுதி, இடம், எண்,),);
பார்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}க்க`,],);
பார்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => {
    const intermediateForms = வருங்காலத்துவினய்முற்றுstub([`${பகுதி}ப்ப`,], இடம், எண்,);
    if ((இடம் !== "படர்க்கய்") || (எண் !== "ஒன்றன்பால்")) {
        return intermediateForms;
    }
    return intermediateForms.union(பார்.வருங்காலத்துப்பெயரெச்சம்(பகுதி,),);
};
பார்.வியங்கோள்வினய்முற்று = பகுதி => new Set([`${பகுதி}க்க`,],);
பார்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}த்தல்`,],);
பார்.நிகழ்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}க்கின்ற`,],);

// இரு is a hybrid of பார் and உயர்
const இரு = Object.create(பார்,);
இரு.இனத்துப்பெயர் = "இரு";
இரு.போனகாலத்துவினயெச்சம் = உயர்.போனகாலத்துவினயெச்சம்;

const இடு = new வினயினம்("இடு",);
இடு.valid = பகுதி => ["கு", "டு", "று",].includes(பகுதி.match(TWO_CHAR_RE,)?.[0],);
இடு.போனகாலத்துவினயெச்சம் = பகுதி => new Set([
    பகுதி.replace(
        RegExp(`(.)${உMarker}$`, "v",),
        `$1${புள்ளி}$1${உMarker}`,
    ),
],);
இடு.தொழிற்பெயர் = பகுதி => new Set([
    பகுதி.replace(
        RegExp(`(.)${உMarker}$`, "v",),
        `$1${புள்ளி}$1ல்`,
    ),
    `${பகுதி}உதல்`,
],);

const தகு = new வினயினம்("தகு",);
தகு.valid = பகுதி => பகுதி.match(TWO_CHAR_RE,)?.[0] === "கு";
தகு.போனகாலத்துவினயெச்சம் = பகுதி => இடு.போனகாலத்துவினயெச்சம்(பகுதி,).union(உயர்.போனகாலத்துவினயெச்சம்(பகுதி,),);
தகு.தொழிற்பெயர் = இடு.தொழிற்பெயர்;

const வாங்கு = new வினயினம்("வாங்கு",);
வாங்கு.valid = பகுதி => [உLetter, உMarker,].includes(பகுதி[பகுதி.length - 1],);
வாங்கு.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}இ`,],);
வாங்கு.போனகாலத்துப்பெயரெச்சம் = function (பகுதி,) { return new Set(வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}ன`,),).union(வினயினம்.prototype.போனகாலத்துப்பெயரெச்சம்.call(this, பகுதி,),); };
வாங்கு.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => {
    const போனகாலத்துவினயெச்சம் = வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,);
    if (இடம் === "தன்மய்") {
        if (எண் === "ஒருமய்") {
            return new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}னேன்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set([...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னோம்`,), ...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னம்`,),],);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "முன்னிலய்") {
        if (எண் === "ஒருமய்") {
            return new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}னாய்`,),);
        }
        if (எண் === "பன்மய்") {
            return new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}னீர்`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    if (இடம் === "படர்க்கய்") {
        if (எண் === "ஆண்பால்") {
            return new Set([...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னான்`,), ...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னன்`,),],);
        }
        if (எண் === "பெண்பால்") {
            return new Set([...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னாள்`,), ...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னள்`,),],);
        }
        if (எண் === "பலர்பால்") {
            return new Set([...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னார்`,), ...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னர்`,),],);
        }
        if (எண் === "ஒன்றன்பால்") {
            return new Set([...போனகாலத்துவினயெச்சம்.values().map(val => `${val}னது`,), ...போனகாலத்துவினயெச்சம்.values().map(val => `${val}அது`,), ...போனகாலத்துவினயெச்சம்.values().map(val => `${val}ற்று`,),],);
        }
        if (எண் === "பலவின்பால்") {
            return new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}ன`,),);
        }
        throw new Error(`Invalid எண்: ${எண்}`,);
    }
    throw new Error(`Invalid இடம்: ${இடம்}`,);
};

const போது = new வினயினம்("போது",);
போது.valid = பகுதி => பகுதி.match(TWO_CHAR_RE,)?.[0] === "து";
போது.சிறப்புப்பகுதி = பகுதி => `${terminalதNasaliser(terminalஉRemover(பகுதி,),)}${புள்ளி}`;
போது.போனகாலத்துவினயெச்சம் = பகுதி => வினயினம்.prototype.போனகாலத்துவினயெச்சம்(போது.சிறப்புப்பகுதி(பகுதி,),).union(வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,),);
போது.போனகாலத்துப்பெயரெச்சம் = பகுதி => வினயினம்.prototype.போனகாலத்துப்பெயரெச்சம்(போது.சிறப்புப்பகுதி(பகுதி,),).union(வாங்கு.போனகாலத்துப்பெயரெச்சம்(பகுதி,),);
போது.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => வினயினம்.prototype.போனகாலத்துவினய்முற்று(போது.சிறப்புப்பகுதி(பகுதி,), இடம், எண்,).union(வாங்கு.போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்,),);

const சொல் = new வினயினம்("சொல்",);
சொல்.valid = பகுதி => ["ள்", "ல்",].includes(பகுதி.match(TWO_CHAR_RE,)?.[0],);
சொல்.போனகாலத்துவினயெச்சம் = வாங்கு.போனகாலத்துவினயெச்சம்;
சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}ந`,],);
சொல்.போனகாலத்துப்பெயரெச்சம் = பகுதி => வாங்கு.போனகாலத்துப்பெயரெச்சம்(பகுதி,).union(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),);
சொல்.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => வினய்முற்றுstub1(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்,).union(வாங்கு.போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்,),);

const emptySetGenerator = () => new Set([],);

const அடிப்படய் = new வினயினம்("அடிப்படய்",);
அடிப்படய்.ஏவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்வினய்முற்று = () => emptySetGenerator();
அடிப்படய்.போனகாலத்துவினய்முற்று = அடிப்படய்.வருங்காலத்துவினய்முற்று = அடிப்படய்.நிகழ்காலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => வினய்முற்றுstub1(new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}அ`,],), இடம், எண்,);

const அல் = Object.create(அடிப்படய்,);
அல்.இனத்துப்பெயர் = "அல்";
அல்.valid = பகுதி => பகுதி === "அல்";
அல்.போனகாலத்துவினயெச்சம் = அல்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}ஆது`,],);
அல்.போனகாலத்துப்பெயரெச்சம் = அல்.நிகழ்காலத்துப்பெயரெச்சம் = அல்.வருங்காலத்துப்பெயரெச்சம் = function (பகுதி,) { return new Set([`${பகுதி}த்த`,],).union(வினயினம்.prototype.போனகாலத்துப்பெயரெச்சம்.call(this, பகுதி,),); };
அல்.போனகாலத்துவினய்முற்று = அல்.வருங்காலத்துவினய்முற்று = அல்.நிகழ்காலத்துவினய்முற்று = (பகுதி, இடம், எண்,) => வினய்முற்றுstub1(new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}ஆத`, `${பகுதி}த்த`,],), இடம், எண்,);
அல்.தொழிற்பெயர் = அல்.வியங்கோள்வினய்முற்று = emptySetGenerator;

const உள் = Object.create(அடிப்படய்,);
உள்.இனத்துப்பெயர் = "உள்";
உள்.valid = பகுதி => பகுதி === "உள்";
உள்.போனகாலத்துவினயெச்சம் = உள்.வருங்காலத்துவினயெச்சம் = () => emptySetGenerator();
உள்.போனகாலத்துப்பெயரெச்சம் = உள்.நிகழ்காலத்துப்பெயரெச்சம் = உள்.வருங்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}அ`,],);
உள்.தொழிற்பெயர் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}உதல்`,],);

const இல் = Object.create(அடிப்படய்,);
இல்.இனத்துப்பெயர் = "இல்";
இல்.valid = பகுதி => பகுதி === "இல்";
இல்.போனகாலத்துவினயெச்சம் = இல்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}ஆது`,],);
இல்.நிகழ்காலத்துப்பெயரெச்சம் = இல்.வருங்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${monosyllabicShortTerminalDoubler(பகுதி,)}ஆத`,],);
இல்.தொழிற்பெயர் = இல்.வியங்கோள்வினய்முற்று = emptySetGenerator;

export { செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், இரு, இடு, தகு, வாங்கு, போது, அல், உள், இல், };

/*
வாங்குவும் போதுவும் ஒரு வகய்
பார் இரு இவய் ஒரு வகய்
சொல் உயர் போலவே
இடுவும் வாவும் காணும் செய் போல்
தகு இடுபோலும் உயர்போலும்
கடயுயிரோரசய்கள் ஒரு வகய்
அடிப்படய்கள் ஒரு வகய்
*/

const வினயினங்கள் = [செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், இரு, இடு, தகு, வாங்கு, போது, அல், உள், இல்,];

export const வினயினத்துப்பெயர்கள் = வினயினங்கள்.map(வினயினம்_ => வினயினம்_.இனத்துப்பெயர்,);

export const validவினயினத்துப்பெயர்கள் = பகுதி => வினயினங்கள்.filter(வினயினம்_ => வினயினம்_.valid(பகுதி,),).map(வினயினம்_ => வினயினம்_.இனத்துப்பெயர்,);

export const வினயினம்Byபெயர் = இனத்துப்பெயர் => {
    const வினயினம்Option = வினயினங்கள்.find(e => e.இனத்துப்பெயர் === இனத்துப்பெயர்,);

    if (! வினயினம்Option) {
        throw new Error(`Unknown வினயினம் ${இனத்துப்பெயர்}.`,);
    }

    return வினயினம்Option;
};
