import { புள்ளி, ஈ_letter_இ_ஈ_markers, ஆ_letter, ஆ_marker, உ_marker, ஊ_marker, ஓ_marker, ய_ர_ல_ழ_ள, } from "./ezuttu.js";
import { monosyllabicShortTerminalDoubler, terminalஓShortener, lastஆShortener, terminalஉRemover, terminalதNasaliser, } from "./punarcci.js";

class வினயினம் {
    constructor(இனத்துப்பெயர்) {
        this.இனத்துப்பெயர் = இனத்துப்பெயர்;
    }
    வினய்(வினய்,) {
        return வினய்;
    }
    valid() {
        return true;
    }
    ஏவல்வினய்முற்று(வினய்,) {
        return வினய்;
    }
    எதிர்மறய்வினய்முற்று(வினய்,) {
        return monosyllabicShortTerminalDoubler(வினய்,) + "ஆர்";
    }
    இறந்தகாலத்துவினயெச்சம்(வினய்,) {
        return வினய் + "து";
    }
    இறந்தகாலத்துப்பெயரெச்சம்(வினய்,) {
        return this.இறந்தகாலத்துவினயெச்சம்(வினய்,) + "அ";
    }
    இறந்தகாலத்துவினய்முற்று(வினய்,) {
        return this.இறந்தகாலத்துப்பெயரெச்சம்(வினய்,) + "ார்";
    }
    நிகழ்காலத்துப்பெயரெச்சம்(வினய்,) {
        return வினய் + "கின்ற";
    }
    நிகழ்காலத்துவினய்முற்று(வினய்,) {
        return this.நிகழ்காலத்துப்பெயரெச்சம்(வினய்,) + "ார்";
    }
    எதிர்காலத்துவினயெச்சம்(வினய்,) {
        return monosyllabicShortTerminalDoubler(வினய்,) + "அ";
    }
    எதிர்காலத்துப்பெயரெச்சம்(வினய்,) {
        return this.எதிர்காலத்துவினயெச்சம்(வினய்,) + "ும்";
    }
    எதிர்காலத்துவினய்முற்று(வினய்,) {
        return வினய் + "வார்";
    }
    தொழிற்பெயர்(வினய்,) {
        return வினய் + "தல்";
    }
}

const வாங்கு = new வினயினம்("வாங்கு");
வாங்கு.valid = (வினய்,) => வினய்.endsWith(உ_marker);
வாங்கு.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => monosyllabicShortTerminalDoubler(வினய்,) + "இ";
வாங்கு.இறந்தகாலத்துவினய்முற்று = (வினய்,) => வினய் + "இனார்";

const போது = Object.create(வாங்கு,);
போது.இனத்துப்பெயர் = "போது";
போது.valid = function(வினய்,) {
    const match = வினய்.match(/..$/);
    if (! match) {
        return false;
    }
    return match[0] === 'து';
};
போது.சிறப்புவினய் = (வினய்,) => terminalதNasaliser(terminalஉRemover(வினய்,),) + புள்ளி;
போது.இறந்தகாலத்துவினயெச்சம் = function(வினய்,) { return new Set([வாங்கு.இறந்தகாலத்துவினயெச்சம்(வினய்,), வினயினம்.prototype.இறந்தகாலத்துவினயெச்சம்(this.சிறப்புவினய்(வினய்,),),],); };
போது.இறந்தகாலத்துப்பெயரெச்சம் = function(வினய்,) { return new Set([...this.இறந்தகாலத்துவினயெச்சம்(வினய்,),].map((a,)=> a + 'அ',),); };
போது.இறந்தகாலத்துவினய்முற்று = function(வினய்,) { return new Set([வாங்கு.இறந்தகாலத்துவினய்முற்று(வினய்,), வினயினம்.prototype.இறந்தகாலத்துவினய்முற்று(this.சிறப்புவினய்(வினய்,),),],); };

const பார் = new வினயினம்("பார்");
பார்.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => வினய் + "த்து";
பார்.நிகழ்காலத்துப்பெயரெச்சம் = (வினய்,) => வினய் + "க்கின்ற";
பார்.எதிர்காலத்துவினயெச்சம் = (வினய்,) => வினய் + "க்க";
பார்.எதிர்காலத்துவினய்முற்று = (வினய்,) => வினய் + "ப்பார்";
பார்.தொழிற்பெயர் = (வினய்,) => வினய் + "த்தல்";
பார்.எதிர்மறய்வினய்முற்று = function(வினய்,) { return new Set([வினயினம்.prototype.எதிர்மறய்வினய்முற்று.call(this, வினய்,), this.எதிர்காலத்துவினயெச்சம்(வினய்,) + "ார்",],); };

const இரு = Object.create(பார்,);
இரு.இனத்துப்பெயர் = "இரு";
இரு.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => வினய் + "ந்து";

const உயர் = new வினயினம்("உயர்");
உயர்.valid = function(வினய்,) {
    const lastCharacter = வினய்[வினய்.length - 1];
    if (ஈ_letter_இ_ஈ_markers.includes(lastCharacter)) {
        return true;
    }
    if (உ_marker === lastCharacter) {
        return true;
    }
    if (புள்ளி !== lastCharacter) {
        return false;
    }
    if (! ய_ர_ல_ழ_ள.includes(வினய்[வினய்.length - 2])) {
        return false;
    }
    return true;
};
உயர்.இறந்தகாலத்துவினயெச்சம் = இரு.இறந்தகாலத்துவினயெச்சம்;

const சொல் = Object.create(உயர்,);
சொல்.இனத்துப்பெயர் = "சொல்";
சொல்.valid = function(வினய்,) {
    const match = வினய்.match(/..$/);
    if (! match) {
        return false;
    }
    return ['ள்','ல்',].includes(match[0]);
};
சொல்.இறந்தகாலத்துவினயெச்சம் = வாங்கு.இறந்தகாலத்துவினயெச்சம்;
சொல்.சிறப்பிறந்தகாலத்துப்பெயரெச்சம் = (வினய்,) => monosyllabicShortTerminalDoubler(வினய்,) + "ந";
சொல்.இறந்தகாலத்துப்பெயரெச்சம் = function(வினய்,) { return new Set([வினயினம்.prototype.இறந்தகாலத்துப்பெயரெச்சம்.call(this, வினய்,), சொல்.சிறப்பிறந்தகாலத்துப்பெயரெச்சம்(வினய்,),],); };
சொல்.இறந்தகாலத்துவினய்முற்று = (வினய்,) => சொல்.சிறப்பிறந்தகாலத்துப்பெயரெச்சம்(வினய்,) + "ார்";

const இடு = new வினயினம்("இடு");
இடு.valid = function(வினய்,) {
    const match = வினய்.match(/..$/);
    if (! match) {
        return false;
    }
    return ['கு','டு','று',].includes(match[0]);
};
இடு.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => வினய்.replace(
    RegExp(`(.)${உ_marker}$`, "v",),
    `$1${புள்ளி}$1` + உ_marker,
);
இடு.தொழிற்பெயர் = (வினய்,) => வினய்.replace(
    RegExp(`(.)${உ_marker}$`, "v",),
    `$1${புள்ளி}$1` + "ல்",
);

const செய் = new வினயினம்("செய்");

const வா = Object.create(செய்,);
வா.இனத்துப்பெயர் = "வா";
வா.வினய் = function(வினய்,) { return lastஆShortener(வினய்,) + "ரு"; };
வா.valid = (வினய்,) => வினய்.endsWith(ஆ_marker);
வா.ஏவல்வினய்முற்று = (வினய்,) => வினய்.replace("ரு","") + "ா";
வா.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => வினய்.replace("ரு","") + "ந்து";

const காண் = Object.create(செய்,);
காண்.இனத்துப்பெயர் = "காண்";
காண்.valid = function(வினய்,) {
    const match = வினய்.match(/...$/);
    if (! match) {
        return false;
    }
    return ['ாண்', 'ான்',].includes(match[0]);
};
காண்.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => lastஆShortener(வினய்,) + "து";

const கடயுயிர் = Object.create(செய்,);
கடயுயிர்.இனத்துப்பெயர் = "கடயுயிர்";
கடயுயிர்.எதிர்காலத்துவினயெச்சம் = (வினய்,) => வினய் + "க";
கடயுயிர்.எதிர்மறய்வினய்முற்று = function(வினய்,) { return this.எதிர்காலத்துவினயெச்சம்(வினய்,) + "ார்"; };

const போ = Object.create(கடயுயிர்,);
போ.இனத்துப்பெயர் = "போ";
போ.valid = (வினய்,) => [ஆ_letter, ஆ_marker, ஊ_marker, ஓ_marker,].includes(வினய்[வினய்.length - 1]);
போ.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => வினய் + "ய்";
போ.இறந்தகாலத்துப்பெயரெச்சம் = (வினய்,) => வினய் + "ன";

const நோ = Object.create(கடயுயிர்,);
நோ.இனத்துப்பெயர் = "நோ";
நோ.valid = (வினய்,) => வினய்.endsWith(ஓ_marker);
நோ.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => terminalஓShortener(வினய்,) + "ந்து";

const சா = Object.create(கடயுயிர்,);
சா.இனத்துப்பெயர் = "சா";
சா.valid = (வினய்,) => வினய்.endsWith(ஆ_marker);
சா.இறந்தகாலத்துவினயெச்சம் = (வினய்,) => lastஆShortener(வினய்,) + "ெத்து";

const emptyStringGenerator = () => "";

const அடிப்படய் = Object.create(உயர்,);
அடிப்படய்.இனத்துப்பெயர் = "அடிப்படய்";
அடிப்படய்.ஏவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்வினய்முற்று = அடிப்படய்.எதிர்காலத்துவினயெச்சம் = அடிப்படய்.இறந்தகாலத்துவினயெச்சம் = emptyStringGenerator;
அடிப்படய்.இறந்தகாலத்துவினய்முற்று = அடிப்படய்.நிகழ்காலத்துவினய்முற்று = அடிப்படய்.எதிர்காலத்துவினய்முற்று = (வினய்,) => monosyllabicShortTerminalDoubler(வினய்,) + "அ" + "ார்";

const அல் = Object.create(அடிப்படய்,);
அல்.இனத்துப்பெயர் = "அல்";
அல்.valid = (வினய்,) => வினய் === "அல்";
அல்.இறந்தகாலத்துப்பெயரெச்சம் = அல்.நிகழ்காலத்துப்பெயரெச்சம் = அல்.எதிர்காலத்துப்பெயரெச்சம் = (வினய்,) => வினய் + "த்த";
அல்.தொழிற்பெயர் = emptyStringGenerator;

const உள் = Object.create(அடிப்படய்,);
உள்.இனத்துப்பெயர் = "உள்";
உள்.valid = (வினய்,) => வினய் === "உள்";
உள்.இறந்தகாலத்துப்பெயரெச்சம் = உள்.நிகழ்காலத்துப்பெயரெச்சம் = உள்.எதிர்காலத்துப்பெயரெச்சம் = (வினய்,) => monosyllabicShortTerminalDoubler(வினய்,) + "அ";

const இல் = Object.create(அடிப்படய்,);
இல்.இனத்துப்பெயர் = "இல்";
இல்.valid = (வினய்,) => வினய் === "இல்";
இல்.இறந்தகாலத்துப்பெயரெச்சம் = இல்.நிகழ்காலத்துப்பெயரெச்சம் = இல்.எதிர்காலத்துப்பெயரெச்சம் = (வினய்,) => monosyllabicShortTerminalDoubler(வினய்,) + "ஆத";
இல்.தொழிற்பெயர் = emptyStringGenerator;

const மாட்டு = Object.create(அடிப்படய்,);
மாட்டு.இனத்துப்பெயர் = "மாட்டு";
மாட்டு.valid = (வினய்,) => வினய் === "மாட்டு";
மாட்டு.இறந்தகாலத்துப்பெயரெச்சம் = மாட்டு.நிகழ்காலத்துப்பெயரெச்சம் = மாட்டு.எதிர்காலத்துப்பெயரெச்சம் = மாட்டு.தொழிற்பெயர் = emptyStringGenerator;

const TBD = new Proxy(new வினயினம்("TBD",), {
    get(_unused, prop,) {
        if (prop === "இனத்துப்பெயர்") {
            return "TBD";
        }
        return () => "TBD";
    },
});

export {வாங்கு, பார், இரு, உயர், சொல், இடு, செய், வா, காண், போ, போது, நோ, சா, அல், உள், இல், மாட்டு, TBD,};

/*
வாங்குவும் போதுவும் ஒரு வகய்
பார் இரு இவய் ஒரு வகய்
சொல் உயர் போலவே
இடுவும் வாவும் காணும் செய் போலும்
கடயுயிர்கள் ஒரு வகய்
அடிப்படய்கள் ஒரு வகய்
*/

const வினயினங்கள் = [வாங்கு, பார், இரு, உயர், சொல், இடு, செய், வா, காண், போ, போது, நோ, சா, அல், உள், இல், மாட்டு,];

export const வினயினத்துப்பெயர்கள் = வினயினங்கள்.map((வினயினம்,) => வினயினம்.இனத்துப்பெயர்,);

export const validவினயினத்துப்பெயர்கள் = (வினய்,) => {
    return வினயினங்கள்.filter((வினயினம்,) => வினயினம்.valid(வினய்,)).map((வினயினம்,) => வினயினம்.இனத்துப்பெயர்,);
};

export const வினயினம்byபெயர் = (இனத்துப்பெயர்,) => {
    const வினயினம் =  வினயினங்கள்.find(e => e.இனத்துப்பெயர் === இனத்துப்பெயர்,);

    if (! வினயினம்) {
        throw new Error(`Unknown வினயினம் ${இனத்துப்பெயர்}.`,);
    }

    return வினயினம்;
};
