import { வினய்Data, } from "./vinayData.js";
import { வினயினம்Byபெயர், } from "./vinayinam.js";
import { அய்காரத்துப்பழயவிதி, } from "./punarcci.js";

export class வினய் {
    constructor(வினய்ப்பெயர், இனமோபெயரோ, புத்தெழுத்துமுறயோ,) {
        if (! வினய்ப்பெயர்) {
            return;
        }

        // Account for modern spelling first
        this.originalவினய்ப்பெயர் = ((வினய்ப்பெயர்_, புத்தெழுத்துமுறயோ_,) => {
            if (! புத்தெழுத்துமுறயோ_) {
                return வினய்ப்பெயர்_;
            }

            return அய்காரத்துப்பழயவிதி.reduce(
                (acc, val,) => val(acc,),
                வினய்ப்பெயர்_,
            );
        })(வினய்ப்பெயர், புத்தெழுத்துமுறயோ,);

        this.வினயினம் = ((வினய்ப்பெயர்_, இனமோபெயரோ_,) => {
            if (இனமோபெயரோ_) {
                // If just the name given, lookup by name, else use as‐is
                const வினயினம் = typeof இனமோபெயரோ_ === "string" ? வினயினம்Byபெயர்(இனமோபெயரோ_,) : இனமோபெயரோ_;

                if (! வினயினம்.valid(வினய்ப்பெயர்_,)) {
                    throw new Error(`வினய் ${வினய்ப்பெயர்_} isn't valid for வினயினம் ${வினயினம்.இனத்துப்பெயர்}.`, { cause: "UserError", },);
                }

                return வினயினம்;
            }

            // Need to lookup in the data
            const வினயினத்துData = வினய்Data.get(வினய்ப்பெயர்_,);

            if (Array.isArray(வினயினத்துData,)) {
                const பெயர்கள் = வினயினத்துData.map(இனத்துData => இனத்துData.இனம்.இனத்துப்பெயர்,);
                throw new Error(`Multiple வினய் classes possible for ${வினய்ப்பெயர்_}: ${பெயர்கள்.join(", ",)}. Select one.`, { cause: "UserError", },);
            }

            if (! வினயினத்துData) {
                throw new Error(`Unknown வினய் ${வினய்ப்பெயர்_}.`, { cause: "UserError", },);
            }

            return வினயினத்துData.இனம்;
        })(this.originalவினய்ப்பெயர், இனமோபெயரோ,);

        this.வினய்ப்பெயர் = this.வினயினம்.வினய்(this.originalவினய்ப்பெயர்,);
    }

    ஏவல்வினய்முற்று() {
        return this.வினயினம்.ஏவல்வினய்முற்று(this.வினய்ப்பெயர்,);
    }

    எதிர்மறய்வினய்முற்று() {
        return this.வினயினம்.எதிர்மறய்வினய்முற்று(this.வினய்ப்பெயர்,);
    }

    இறந்தகாலத்துவினயெச்சம்() {
        return this.வினயினம்.இறந்தகாலத்துவினயெச்சம்(this.வினய்ப்பெயர்,);
    }

    இறந்தகாலத்துப்பெயரெச்சம்() {
        return this.வினயினம்.இறந்தகாலத்துப்பெயரெச்சம்(this.வினய்ப்பெயர்,);
    }

    இறந்தகாலத்துவினய்முற்று() {
        return this.வினயினம்.இறந்தகாலத்துவினய்முற்று(this.வினய்ப்பெயர்,);
    }

    நிகழ்காலத்துப்பெயரெச்சம்() {
        return this.வினயினம்.நிகழ்காலத்துப்பெயரெச்சம்(this.வினய்ப்பெயர்,);
    }

    நிகழ்காலத்துவினய்முற்று() {
        return this.வினயினம்.நிகழ்காலத்துவினய்முற்று(this.வினய்ப்பெயர்,);
    }

    எதிர்காலத்துவினயெச்சம்() {
        return this.வினயினம்.எதிர்காலத்துவினயெச்சம்(this.வினய்ப்பெயர்,);
    }

    எதிர்காலத்துப்பெயரெச்சம்() {
        return this.வினயினம்.எதிர்காலத்துப்பெயரெச்சம்(this.வினய்ப்பெயர்,);
    }

    எதிர்காலத்துவினய்முற்று() {
        return this.வினயினம்.எதிர்காலத்துவினய்முற்று(this.வினய்ப்பெயர்,);
    }

    தொழிற்பெயர்() {
        return this.வினயினம்.தொழிற்பெயர்(this.வினய்ப்பெயர்,);
    }
}
