import { புள்ளி, இLetter, இMarker, ஈLetter, உMarker, } from "./ezuttu.js";
import { terminalஏஓShortener, lastஆShortener, terminalஉRemover, terminalஆtoஎconverter, terminalதNasaliser, } from "./punarcci.js";

const emptySetGenerator = () => new Set([],);

const childவினயினம் = (parentவினயினம், இனத்துப்பெயர்,) => Object.create(parentவினயினம், { இனத்துப்பெயர்: { value: இனத்துப்பெயர், }, },);

const allJuxtapositions = (prefixes, suffixes,) => suffixes.reduce(
    (acc, suffix,) => new Set([...prefixes.values().map(prefix => `${prefix}${suffix}`,),],).union(acc,),
    new Set([],),
);

const alsoWithகள்Suffixed = suffixes => [...allJuxtapositions(suffixes, ["", "கள்",],),];

const withExtraFormForஒன்றன்பால் = (பகுதி, இடம், எண்ணோபாலோ, intermediateForms, extraFormGenerator,) => {
    if ((இடம் !== "படர்க்கய்") || (எண்ணோபாலோ !== "ஒன்றன்பால்")) {
        return intermediateForms;
    }
    return extraFormGenerator(பகுதி,).union(intermediateForms,);
};

const withOptionalஉForm = (பகுதி, remainder,) => new Set([`${பகுதி}${remainder}`,],).union((() => {
    if (["ண்", "ன்", "ள்", "ல்", "ர்", "ழ்",].some(suffix => பகுதி.endsWith(suffix,),)) {
        return new Set([`${பகுதி}உ${remainder}`,],);
    }
    if ([இLetter, இMarker, ஈLetter, "ய்",].some(suffix => பகுதி.endsWith(suffix,),) && remainder !== "") {
        return new Set([`${பகுதி}உ${remainder}`,],);
    }
    return new Set([],);
})(),);

const வினய்முற்றுStubGenerator = (தன்னொருமய், தற்பன்மய், முன்னொருமய், முற்பன்மய், ஆண்பால், பெண்பால், பலர்பால், ஒன்றன்பால், பலவின்பால்,) => (prefixes, இடம், எண்ணோபாலோ,) => {
    if (இடம் === "தன்மய்") {
        if (எண்ணோபாலோ === "ஒருமய்") {
            return allJuxtapositions(prefixes, தன்னொருமய்,);
        }
        if (எண்ணோபாலோ === "பன்மய்") {
            return allJuxtapositions(prefixes, alsoWithகள்Suffixed(தற்பன்மய்,),);
        }
        throw new Error(`“${எண்ணோபாலோ}” எனும் எண்ணோபாலோ செல்லாதது.`,);
    }
    if (இடம் === "முன்னிலய்") {
        if (எண்ணோபாலோ === "ஒருமய்") {
            return allJuxtapositions(prefixes, முன்னொருமய்,);
        }
        if (எண்ணோபாலோ === "பன்மய்") {
            return allJuxtapositions(prefixes, alsoWithகள்Suffixed(முற்பன்மய்,),);
        }
        throw new Error(`“${எண்ணோபாலோ}” எனும் எண்ணோபாலோ செல்லாதது.`,);
    }
    if (இடம் === "படர்க்கய்") {
        if (எண்ணோபாலோ === "ஆண்பால்") {
            return allJuxtapositions(prefixes, ஆண்பால்,);
        }
        if (எண்ணோபாலோ === "பெண்பால்") {
            return allJuxtapositions(prefixes, பெண்பால்,);
        }
        if (எண்ணோபாலோ === "பலர்பால்") {
            return allJuxtapositions(prefixes, alsoWithகள்Suffixed(பலர்பால்,),);
        }
        if (எண்ணோபாலோ === "ஒன்றன்பால்") {
            return allJuxtapositions(prefixes, ஒன்றன்பால்,);
        }
        if (எண்ணோபாலோ === "பலவின்பால்") {
            return allJuxtapositions(prefixes, பலவின்பால்,);
        }
        throw new Error(`“${எண்ணோபாலோ}” எனும் எண்ணோபாலோ செல்லாதது.`,);
    }
    throw new Error(`“${இடம்}” எனும் இடம் செல்லாதது.`,);
};

const வினய்முற்றுStub1 = வினய்முற்றுStubGenerator([`${புள்ளி}ஏன்`,], [`${புள்ளி}ஓம்`,], [`${புள்ளி}ஆய்`,], [`${புள்ளி}ஈர்`,], [`${புள்ளி}ஆன்`, `${புள்ளி}அனன்`,], [`${புள்ளி}ஆள்`, `${புள்ளி}அனள்`,], [`${புள்ளி}ஆர்`, `${புள்ளி}அனர்`,], [`${புள்ளி}அது`,], [`${புள்ளி}அன`,],);
const வினய்முற்றுStub2 = வினய்முற்றுStubGenerator([`${புள்ளி}ஏன்`,], [`${புள்ளி}ஓம்`,], [`${புள்ளி}ஆய்`,], [`${புள்ளி}ஈர்`,], [`${புள்ளி}ஆன்`, `${புள்ளி}அன்`,], [`${புள்ளி}ஆள்`, `${புள்ளி}அள்`,], [`${புள்ளி}ஆர்`, `${புள்ளி}அர்`,], [`${புள்ளி}அது`,], [`${புள்ளி}அன`,],);
const எதிர்மறய்வினய்முற்றுStub = வினய்முற்றுStubGenerator([`${புள்ளி}ஏன்`,], [`${புள்ளி}ஓம்`,], [`${புள்ளி}ஆய்`,], [`${புள்ளி}ஈர்`,], [`${புள்ளி}ஆன்`,], [`${புள்ளி}ஆள்`,], [`${புள்ளி}ஆர்`,], [`${புள்ளி}ஆது`,], [`${புள்ளி}ஆ`,],);

const ஏவல்வினய்முற்றுStub = (ஒருமய்Generator, பன்மய்Generator,) => (பகுதி, எண்,) => {
    if (எண் === "ஒருமய்") {
        return ஒருமய்Generator(பகுதி,);
    }
    if (எண் === "பன்மய்") {
        return பன்மய்Generator(பகுதி,);
    }
    throw new Error(`“${எண்}” எனும் எண் செல்லாதது.`,);
};

const பெயரெச்சத்துப்பெயர்Stub = ((ஆண்பால், பெண்பால், பலர்பால், ஒன்றன்பால், பலவின்பால்,) => (prefixes, பால்,) => {
    if (பால் === "ஆண்பால்") {
        return allJuxtapositions(prefixes, ஆண்பால்,);
    }
    if (பால் === "பெண்பால்") {
        return allJuxtapositions(prefixes, பெண்பால்,);
    }
    if (பால் === "பலர்பால்") {
        return allJuxtapositions(prefixes, alsoWithகள்Suffixed(பலர்பால்,),);
    }
    if (பால் === "ஒன்றன்பால்") {
        return allJuxtapositions(prefixes, ஒன்றன்பால்,);
    }
    if (பால் === "பலவின்பால்") {
        return allJuxtapositions(prefixes, alsoWithகள்Suffixed(பலவின்பால்,),);
    }
    throw new Error(`“${பால்}” எனும் பால் செல்லாதது.`,);
})([`${புள்ளி}அவன்`, `${புள்ளி}ஓன்`,], [`${புள்ளி}அவள்`, `${புள்ளி}ஓள்`,], [`${புள்ளி}அவர்`, `${புள்ளி}ஓர்`,], [`${புள்ளி}அது`,], [`${புள்ளி}அவய்`,],);

/* eslint-disable class-methods-use-this -- We override these methods in instance வினயினம்s in creative ways that making these static disallows us from doing */

class வினயினம் {
    constructor(இனத்துப்பெயர்,) {
        this.இனத்துப்பெயர் = இனத்துப்பெயர்;
    }

    பகுதி(பகுதி,) {
        return பகுதி;
    }

    வியங்கோள்வினய்முற்று(பகுதி,) {
        return withOptionalஉForm(பகுதி, "க",);
    }

    தொழிற்பெயர்(பகுதி,) {
        return (() => {
            if ([இLetter, இMarker, ஈLetter, "ய்", "ண்", "ன்", "ர்", "ழ்",].some(suffix => பகுதி.endsWith(suffix,),)) {
                return new Set([`${பகுதி}தல்`, `${பகுதி}உதல்`,],);
            }
            if (["ள்", "ல்",].some(suffix => பகுதி.endsWith(suffix,),)) {
                return new Set([`${பகுதி}த்தல்`, `${பகுதி}உதல்`,],);
            }
            return new Set([`${பகுதி}தல்`,],);
        })().union(withOptionalஉForm(பகுதி, "கய்",),).add(`${பகுதி}அல்`,);
    }

    எதிர்மறய்த்தொழிற்பெயர்(பகுதி,) {
        return new Set([`${பகுதி}ஆமய்`,],);
    }

    எதிர்மறய்வினயெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}ஆது`, `${பகுதி}ஆமல்`,],);
    }

    எதிர்மறய்ப்பெயரெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}ஆத`, `${பகுதி}ஆ`,],);
    }

    எதிர்மறய்ப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(new Set([`${பகுதி}ஆத`,],), பால்,);
    }

    எதிர்மறய்வினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return எதிர்மறய்வினய்முற்றுStub(வினயினம்.prototype.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,);
    }

    வருங்காலத்துவினயெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}அ`,],);
    }

    வருங்காலத்துநிபந்தனய்வினயெச்சம்(பகுதி,) {
        return allJuxtapositions(this.வருங்காலத்துவினயெச்சம்(பகுதி,), [`${புள்ளி}இல்`, `${புள்ளி}இன்`,],);
    }

    வருங்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return allJuxtapositions(this.வருங்காலத்துவினயெச்சம்(பகுதி,), [`${புள்ளி}உம்`,],);
    }

    வருங்காலத்துப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(withOptionalஉForm(பகுதி, "வ",), பால்,);
    }

    வருங்காலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(withOptionalஉForm(பகுதி, "வ",), இடம், எண்ணோபாலோ,), this.வருங்காலத்துப்பெயரெச்சம்.bind(this,),);
    }

    நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return withOptionalஉForm(பகுதி, "கின்ற",).union(withOptionalஉForm(பகுதி, "கிற",),);
    }

    நிகழ்காலத்துப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(this.நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,), பால்,);
    }

    நிகழ்காலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        // You cannot use the கிறு form if followed by ன். This is especially seen in பலவின்பால், but also in more arcane forms in the other பால்s.
        return new Set(Array.from(வினய்முற்றுStub1(this.நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,),).filter(form => ! form.includes("கிற்அன",),),);
    }

    போனகாலத்துவினயெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}து`,],);
    }

    போனகாலத்துநிபந்தனய்வினயெச்சம்(பகுதி,) {
        return allJuxtapositions(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), [`${புள்ளி}ஆல்`,],).union(allJuxtapositions(this.போனகாலத்துவினயெச்சம்(பகுதி,), ["இன்", "இல்",],),);
    }

    போனகாலத்துப்பெயரெச்சம்(பகுதி,) {
        return allJuxtapositions(this.போனகாலத்துவினயெச்சம்(பகுதி,), ["அ",],);
    }

    போனகாலத்துப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), பால்,);
    }

    போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub1(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,), () => allJuxtapositions(this.போனகாலத்துவினயெச்சம்(பகுதி,), ["இற்று",],),);
    }
}

வினயினம்.prototype.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுStub(
    பகுதி => withOptionalஉForm(பகுதி, "",),
    பகுதி => new Set(alsoWithகள்Suffixed([`${பகுதி}உம்`,],),).union(withOptionalஉForm(பகுதி, "ம்இன்",),),
);

வினயினம்.prototype.எதிர்மறயேவல்வினய்முற்று = ஏவல்வினய்முற்றுStub(
    பகுதி => new Set([`${பகுதி}ஏல்`,],),
    பகுதி => new Set([`${பகுதி}ஏல்மின்`,],),
);

/* eslint-enable class-methods-use-this */

const செய் = new வினயினம்("செய்",);

const வா = new வினயினம்("வா",);
வா.பகுதி = பகுதி => `${lastஆShortener(பகுதி,)}ரு`;
வா.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுStub(
    பகுதி => new Set([`${பகுதி.replace(/ரு$/v, "",)}${புள்ளி}ஆ`,],),
    பகுதி => new Set(alsoWithகள்Suffixed([`${பகுதி.replace(/ரு$/v, "",)}${புள்ளி}ஆரும்`,],),).add(`${பகுதி.replace(/ரு$/v, "",)}ம்ம்இன்`,),
);
வா.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி.replace(/ரு$/v, "",)}ந்து`,],);

const காண் = new வினயினம்("காண்",);
காண்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${lastஆShortener(பகுதி,)}து`,],);

const கடயுயிரோரசய் = new வினயினம்("கடயுயிரோரசய்",);
கடயுயிரோரசய்.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுStub(
    பகுதி => new Set([பகுதி,],),
    பகுதி => new Set(alsoWithகள்Suffixed([`${பகுதி}உம்`, `${பகுதி}ம்`,],),).add(`${பகுதி}ம்இன்`,).add(`${பகுதி}உமின்`,),
);
கடயுயிரோரசய்.வியங்கோள்வினய்முற்று = பகுதி => new Set([`${பகுதி}க`, `${பகுதி}குக`,],);
கடயுயிரோரசய்.தொழிற்பெயர் = பகுதி => வினயினம்.prototype.தொழிற்பெயர்(`${பகுதி}கு`,).union(வினயினம்.prototype.தொழிற்பெயர்(பகுதி,),);
["எதிர்மறய்த்தொழிற்பெயர்", "எதிர்மறயேவல்வினய்முற்று", "எதிர்மறய்வினயெச்சம்", "எதிர்மறய்ப்பெயரெச்சம்", "எதிர்மறய்ப்பெயரெச்சத்துப்பெயர்", "எதிர்மறய்வினய்முற்று",].forEach(methodName => கடயுயிரோரசய்[methodName] = (பகுதி, ...args) => வினயினம்.prototype[methodName](`${பகுதி}கு`, ...args,),);
கடயுயிரோரசய்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}க`,],);
கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம் = பகுதி => வினயினம்.prototype.வருங்காலத்துப்பெயரெச்சம்.call(கடயுயிரோரசய், பகுதி,).add(`${பகுதி}ம்`,);
கடயுயிரோரசய்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2([`${பகுதி}வ`, `${பகுதி}குவ`,], இடம், எண்ணோபாலோ,), கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம்.bind(கடயுயிரோரசய்,),);

const போ = childவினயினம்(கடயுயிரோரசய், "போ",);
போ.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ய்`,],);
போ.போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}ன`, `${பகுதி}யின`,],);

const நோ = childவினயினம்(கடயுயிரோரசய், "நோ",);
நோ.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${terminalஏஓShortener(பகுதி,)}ந்து`,],);

const சா = childவினயினம்(கடயுயிரோரசய், "சா",);
சா.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${terminalஆtoஎconverter(பகுதி,)}த்து`,],);

const உயர் = new வினயினம்("உயர்",);
உயர்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ந்து`,],);

const பார் = new வினயினம்("பார்",);
பார்.வியங்கோள்வினய்முற்று = பகுதி => new Set([`${பகுதி}க்க`,],);
பார்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}த்தல்`, `${பகுதி}க்குதல்`, `${பகுதி}ப்புதல்`, `${பகுதி}அல்`, `${பகுதி}க்கல்`, `${பகுதி}ப்பல்`, `${பகுதி}க்கய்`,],);
பார்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}க்க`, `${பகுதி}ப்ப`,],);
பார்.வருங்காலத்துப்பெயரெச்சத்துப்பெயர் = (பகுதி, பால்,) => பெயரெச்சத்துப்பெயர்Stub(பார்.வருங்காலத்துவினயெச்சம்(பகுதி,), பால்,);
பார்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(பார்.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,), பார்.வருங்காலத்துப்பெயரெச்சம்.bind(பார்,),);
பார்.நிகழ்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}க்கின்ற`, `${பகுதி}க்கிற`,],);
பார்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}த்து`,],);

const திற = childவினயினம்(பார், "திற",);
திற.போனகாலத்துவினயெச்சம் = உயர்.போனகாலத்துவினயெச்சம்;

const இடு = new வினயினம்("இடு",);
இடு.போனகாலத்துவினயெச்சம் = பகுதி => new Set([பகுதி.replace(RegExp(`(.)${உMarker}$`, "v",), `$1${புள்ளி}$1${உMarker}`,),],);
இடு.தொழிற்பெயர் = பகுதி => allJuxtapositions(இடு.போனகாலத்துவினயெச்சம்(பகுதி,), ["அல்",],).union(வினயினம்.prototype.தொழிற்பெயர்(பகுதி,),);

const தகு = childவினயினம்(இடு, "தகு",);
தகு.போனகாலத்துவினயெச்சம் = பகுதி => இடு.போனகாலத்துவினயெச்சம்(பகுதி,).union(உயர்.போனகாலத்துவினயெச்சம்(பகுதி,),);

const வாங்கு = new வினயினம்("வாங்கு",);
வாங்கு.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}இ`,],);
வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => allJuxtapositions(வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,), ["ன",],);
வாங்கு.போனகாலத்துநிபந்தனய்வினயெச்சம் = பகுதி => allJuxtapositions(வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,), [`${புள்ளி}ஆல்`,],).union(new Set([`${பகுதி}இன்`, `${பகுதி}இல்`,],),);
வாங்கு.போனகாலத்துப்பெயரெச்சம் = function (பகுதி,) { return வினயினம்.prototype.போனகாலத்துப்பெயரெச்சம்.call(this, பகுதி,).union(வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),); };
வாங்கு.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => {
    const போனகாலத்துவினயெச்சம் = வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,);
    const intermediateForms = வினய்முற்றுStub2([`${பகுதி}இன`,], இடம், எண்ணோபாலோ,);
    if ((இடம் !== "படர்க்கய்")) {
        return intermediateForms;
    }
    if (எண்ணோபாலோ === "ஒன்றன்பால்") {
        return intermediateForms.union(allJuxtapositions(போனகாலத்துவினயெச்சம், ["அது", "ற்று",],),);
    }
    if (எண்ணோபாலோ === "பலவின்பால்") {
        return intermediateForms.symmetricDifference(allJuxtapositions(போனகாலத்துவினயெச்சம், ["ன்அன",],),).union(allJuxtapositions(போனகாலத்துவினயெச்சம், ["ன", "அன",],),);
    }
    return intermediateForms;
};

const போது = new வினயினம்("போது",);
போது.சிறப்புப்பகுதி = பகுதி => `${terminalதNasaliser(terminalஉRemover(பகுதி,),)}${புள்ளி}`;
["போனகாலத்துநிபந்தனய்வினயெச்சம்", "போனகாலத்துவினயெச்சம்", "போனகாலத்துப்பெயரெச்சம்", "போனகாலத்துவினய்முற்று",].forEach(methodName => போது[methodName] = (பகுதி, ...args) => வினயினம்.prototype[methodName](போது.சிறப்புப்பகுதி(பகுதி,), ...args,).union(வாங்கு[methodName](பகுதி, ...args,),),);

const சொல் = childவினயினம்(வாங்கு, "சொல்",);
சொல்.போனகாலத்துநிபந்தனய்வினயெச்சம் = பகுதி => வாங்கு.போனகாலத்துநிபந்தனய்வினயெச்சம்(பகுதி,).add(`${சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,)}${புள்ளி}ஆல்`,);
சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => `${பகுதி}ந்ந`;
சொல்.போனகாலத்துப்பெயரெச்சம் = பகுதி => வாங்கு.போனகாலத்துப்பெயரெச்சம்(பகுதி,).add(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),);
சொல்.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => வினய்முற்றுStub1(new Set([சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),],), இடம், எண்ணோபாலோ,).union(வாங்கு.போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,),);

const அடிப்படய் = new வினயினம்("அடிப்படய்",);
அடிப்படய்.ஏவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்த்தொழிற்பெயர் = அடிப்படய்.எதிர்மறயேவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்வினயெச்சம் = அடிப்படய்.எதிர்மறய்ப்பெயரெச்சம் = அடிப்படய்.எதிர்மறய்ப்பெயரெச்சத்துப்பெயர் = அடிப்படய்.எதிர்மறய்வினய்முற்று = அடிப்படய்.வருங்காலத்துநிபந்தனய்வினயெச்சம் = அடிப்படய்.போனகாலத்துநிபந்தனய்வினயெச்சம் = emptySetGenerator;

const உள் = childவினயினம்(அடிப்படய், "உள்",);
உள்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}உதல்`, `${பகுதி}அல்`, `${பகுதி}மய்`,],);
உள்.வருங்காலத்துவினயெச்சம் = உள்.போனகாலத்துவினயெச்சம் = emptySetGenerator;
உள்.வருங்காலத்துப்பெயரெச்சம் = உள்.நிகழ்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}அ`,],);
உள்.வருங்காலத்துப்பெயரெச்சத்துப்பெயர் = உள்.நிகழ்காலத்துப்பெயரெச்சத்துப்பெயர்;
உள்.வருங்காலத்துவினய்முற்று = உள்.நிகழ்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2([`${பகுதி}அ`,], இடம், எண்ணோபாலோ,), உயர்.போனகாலத்துவினயெச்சம்,).add(`${பகுதி}ந்து`,);
உள்.போனகாலத்துப்பெயரெச்சம் = உள்.போனகாலத்துவினய்முற்று = emptySetGenerator;

const எதிரடிப்படய் = Object.create(அடிப்படய்,);
எதிரடிப்படய்.வியங்கோள்வினய்முற்று = emptySetGenerator;
எதிரடிப்படய்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}மய்`, `${பகுதி}ஆமய்`,],);
எதிரடிப்படய்.வருங்காலத்துப்பெயரெச்சத்துப்பெயர் = எதிரடிப்படய்.நிகழ்காலத்துப்பெயரெச்சத்துப்பெயர் = எதிரடிப்படய்.போனகாலத்துப்பெயரெச்சத்துப்பெயர் = function (பகுதி, பால்,) { return பெயரெச்சத்துப்பெயர்Stub(this.சிறப்புப்பெயரெச்சம்(பகுதி,), பால்,); };
எதிரடிப்படய்.போனகாலத்துவினய்முற்று = எதிரடிப்படய்.வருங்காலத்துவினய்முற்று = எதிரடிப்படய்.நிகழ்காலத்துவினய்முற்று = function (பகுதி, இடம், எண்ணோபாலோ,) { return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(this.சிறப்புப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,), () => new Set([`${பகுதி}ந்து`,],),).add(this.சிறப்புவினய்முற்று(பகுதி,),); };

const இல் = childவினயினம்(எதிரடிப்படய், "இல்",);
இல்.வருங்காலத்துவினயெச்சம் = இல்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ஆ`, `${பகுதி}ஆது`, `${பகுதி}ஆமல்`, `${பகுதி}ந்தி`,],);
இல்.வருங்காலத்துப்பெயரெச்சம் = இல்.நிகழ்காலத்துப்பெயரெச்சம் = இல்.போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}ஆ`, `${பகுதி}ஆத`,],);
இல்.சிறப்புப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}அ`, `${பகுதி}ஆத`,],);
இல்.சிறப்புவினய்முற்று = பகுதி => `${பகுதி}அய்`;

const அல் = childவினயினம்(எதிரடிப்படய், "அல்",);
அல்.வருங்காலத்துநிபந்தனய்வினயெச்சம் = பகுதி => new Set([`${பகுதி}இல்`, `${பகுதி}இன்`,],);
அல்.போனகாலத்துநிபந்தனய்வினயெச்சம் = பகுதி => அல்.வருங்காலத்துநிபந்தனய்வினயெச்சம்(பகுதி,).add(`${பகுதி}ஆல்`,);
அல்.வருங்காலத்துவினயெச்சம் = அல்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ஆ`, `${பகுதி}ஆது`, `${பகுதி}ஆமல்`, `${பகுதி}ந்தி`, `${பகுதி}த்து`,],);
அல்.வருங்காலத்துப்பெயரெச்சம் = அல்.நிகழ்காலத்துப்பெயரெச்சம் = அல்.போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}ஆ`, `${பகுதி}ஆத`, `${பகுதி}த்த`,],);
அல்.சிறப்புப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}அ`, `${பகுதி}ஆத`, `${பகுதி}த்த`,],);
அல்.சிறப்புவினய்முற்று = பகுதி => `${பகுதி}அ`;

export { செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், திற, இடு, தகு, வாங்கு, போது, அல், இல், உள், };

const வினயினங்கள் = [செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், திற, இடு, தகு, வாங்கு, போது, அல், உள், இல்,];

export const வினயினம்Byபெயர் = இனத்துப்பெயர் => வினயினங்கள்.find(e => e.இனத்துப்பெயர் === இனத்துப்பெயர்,) ?? (() => { throw new Error(`“${இனத்துப்பெயர்}” எனும் வினயினம் செல்லாதது.`,); })();
