import { புள்ளி, இLetter, இMarker, ஈLetter, உMarker, } from "./ezuttu.js";
import { terminalஏஓShortenerWithExtraந், lastஆMarkerShortener, terminalஉRemover, terminalஆtoஎconverterWithExtraத், terminalதNasaliser, } from "./punarcci.js";

const emptySetGenerator = () => new Set([],);

const childவினயினம் = (parentவினயினம், இனத்துப்பெயர்,) => Object.create(parentவினயினம், { இனத்துப்பெயர்: { value: இனத்துப்பெயர், }, },);

const adaptபகுதிMethod = (object, methodName, adaptor,) => object[methodName] = (பகுதி, ...args) => adaptor(Object.getPrototypeOf(object,)[methodName].call(object, பகுதி, ...args,),);

const allJuxtapositions = (prefixes, suffixes,) => suffixes.reduce(
    (acc, suffix,) => new Set([...prefixes.values().map(prefix => `${prefix}${suffix}`,),],).union(acc,),
    new Set([],),
);

const alsoWithகள்Suffixed = suffixes => Array.from(allJuxtapositions(suffixes, ["", "கள்",],),);

const withExtraFormForஒன்றன்பால் = (பகுதி, இடம், எண்ணோபாலோ, intermediateForms, extraFormGenerator,) => {
    if ((இடம் !== "படர்க்கய்") || (எண்ணோபாலோ !== "ஒன்றன்பால்")) {
        return intermediateForms;
    }
    return extraFormGenerator(பகுதி,).union(intermediateForms,);
};

const withOptionalஉForm = (பகுதி, remainder,) => new Set([remainder,],).union((() => {
    if (["ண்", "ன்", "ள்", "ல்", "ர்", "ழ்",].some(suffix => பகுதி.endsWith(suffix,),)) {
        return new Set([`உ${remainder}`,],);
    }
    if ([இLetter, இMarker, ஈLetter, "ய்",].some(suffix => பகுதி.endsWith(suffix,),) && remainder !== "") {
        return new Set([`உ${remainder}`,],);
    }
    return new Set([],);
})(),);

const வினய்முற்றுStubGenerator = (தன்னொருமய், தற்பன்மய், முன்னொருமய், முற்பன்மய், ஆண்பால், பெண்பால், பலர்பால், ஒன்றன்பால், பலவின்பால்,) => (prefixes, இடம், எண்ணோபாலோ,) => {
    switch (இடம்) {
        case "தன்மய்":
            switch (எண்ணோபாலோ) {
                case "ஒருமய்":
                    return allJuxtapositions(prefixes, தன்னொருமய்,);
                case "பன்மய்":
                    return allJuxtapositions(prefixes, alsoWithகள்Suffixed(தற்பன்மய்,),);
                default:
                    throw new Error(`“${எண்ணோபாலோ}” எனும் எண்ணோபாலோ செல்லாதது.`,);
            }
        case "முன்னிலய்":
            switch (எண்ணோபாலோ) {
                case "ஒருமய்":
                    return allJuxtapositions(prefixes, முன்னொருமய்,);
                case "பன்மய்":
                    return allJuxtapositions(prefixes, alsoWithகள்Suffixed(முற்பன்மய்,),);
                default:
                    throw new Error(`“${எண்ணோபாலோ}” எனும் எண்ணோபாலோ செல்லாதது.`,);
            }
        case "படர்க்கய்":
            switch (எண்ணோபாலோ) {
                case "ஆண்பால்":
                    return allJuxtapositions(prefixes, ஆண்பால்,);
                case "பெண்பால்":
                    return allJuxtapositions(prefixes, பெண்பால்,);
                case "பலர்பால்":
                    return allJuxtapositions(prefixes, alsoWithகள்Suffixed(பலர்பால்,),);
                case "ஒன்றன்பால்":
                    return allJuxtapositions(prefixes, ஒன்றன்பால்,);
                case "பலவின்பால்":
                    return allJuxtapositions(prefixes, பலவின்பால்,);
                default:
                    throw new Error(`“${எண்ணோபாலோ}” எனும் எண்ணோபாலோ செல்லாதது.`,);
            }
        default:
            throw new Error(`“${இடம்}” எனும் இடம் செல்லாதது.`,);
    }
};

const வினய்முற்றுStub1 = வினய்முற்றுStubGenerator([`${புள்ளி}ஏன்`,], [`${புள்ளி}ஓம்`,], [`${புள்ளி}ஆய்`,], [`${புள்ளி}ஈர்`,], [`${புள்ளி}ஆன்`, `${புள்ளி}அனன்`,], [`${புள்ளி}ஆள்`, `${புள்ளி}அனள்`,], [`${புள்ளி}ஆர்`, `${புள்ளி}அனர்`,], [`${புள்ளி}அது`,], [`${புள்ளி}அன`,],);
const வினய்முற்றுStub2 = வினய்முற்றுStubGenerator([`${புள்ளி}ஏன்`,], [`${புள்ளி}ஓம்`,], [`${புள்ளி}ஆய்`,], [`${புள்ளி}ஈர்`,], [`${புள்ளி}ஆன்`, `${புள்ளி}அன்`,], [`${புள்ளி}ஆள்`, `${புள்ளி}அள்`,], [`${புள்ளி}ஆர்`, `${புள்ளி}அர்`,], [`${புள்ளி}அது`,], [`${புள்ளி}அன`,],);
const எதிர்மறய்வினய்முற்றுStub = வினய்முற்றுStubGenerator([`${புள்ளி}ஏன்`,], [`${புள்ளி}ஓம்`,], [`${புள்ளி}ஆய்`,], [`${புள்ளி}ஈர்`,], [`${புள்ளி}ஆன்`,], [`${புள்ளி}ஆள்`,], [`${புள்ளி}ஆர்`,], [`${புள்ளி}ஆது`,], [`${புள்ளி}ஆ`,],);

const ஏவல்வினய்முற்றுStub = (ஒருமய்Generator, பன்மய்Generator,) => (பகுதி, எண்,) => {
    if (எண் === "ஒருமய்") {
        return ஒருமய்Generator(பகுதி,);
    }
    if (எண் === "பன்மய்") {
        return பன்மய்Generator(பகுதி,);
    }
    throw new Error(`“${எண்}” எனும் எண் செல்லாதது.`,);
};

const பெயரெச்சத்துப்பெயர்Stub = ((ஆண்பால், பெண்பால், பலர்பால், ஒன்றன்பால், பலவின்பால்,) => (prefixes, பால்,) => {
    switch (பால்) {
        case "ஆண்பால்":
            return allJuxtapositions(prefixes, ஆண்பால்,);
        case "பெண்பால்":
            return allJuxtapositions(prefixes, பெண்பால்,);
        case "பலர்பால்":
            return allJuxtapositions(prefixes, alsoWithகள்Suffixed(பலர்பால்,),);
        case "ஒன்றன்பால்":
            return allJuxtapositions(prefixes, ஒன்றன்பால்,);
        case "பலவின்பால்":
            return allJuxtapositions(prefixes, alsoWithகள்Suffixed(பலவின்பால்,),);
        default:
            throw new Error(`“${பால்}” எனும் பால் செல்லாதது.`,);
    }
})([`${புள்ளி}அவன்`, `${புள்ளி}ஓன்`,], [`${புள்ளி}அவள்`, `${புள்ளி}ஓள்`,], [`${புள்ளி}அவர்`, `${புள்ளி}ஓர்`,], [`${புள்ளி}அது`,], [`${புள்ளி}அவய்`,],);

const செய் = {
    இனத்துப்பெயர்: "செய்",

    ஏவல்வினய்முற்று: ஏவல்வினய்முற்றுStub(
        பகுதி => withOptionalஉForm(பகுதி, "",),
        பகுதி => new Set(alsoWithகள்Suffixed(["உம்",],),).union(withOptionalஉForm(பகுதி, "மின்",),),
    ),

    எதிர்மறயேவல்வினய்முற்று: ஏவல்வினய்முற்றுStub(
        () => new Set(["ஏல்",],),
        () => new Set(["ஏல்மின்",],),
    ),

    வியங்கோள்வினய்முற்று(பகுதி,) {
        return withOptionalஉForm(பகுதி, "க",);
    },

    தொழிற்பெயர்(பகுதி,) {
        return (() => {
            if ([இLetter, இMarker, ஈLetter, "ய்", "ண்", "ன்", "ர்", "ழ்",].some(suffix => பகுதி.endsWith(suffix,),)) {
                return new Set(["தல்", "உதல்",],);
            }
            if (["ள்", "ல்",].some(suffix => பகுதி.endsWith(suffix,),)) {
                return new Set(["த்தல்", "உதல்",],);
            }
            return new Set(["தல்",],);
        })().union(withOptionalஉForm(பகுதி, "கய்",),).add("அல்",);
    },

    எதிர்மறய்த்தொழிற்பெயர்() {
        return new Set(["ஆமய்",],);
    },

    எதிர்மறய்வினயெச்சம்() {
        return new Set(["ஆது", "ஆமல்",],);
    },

    எதிர்மறய்ப்பெயரெச்சம்() {
        return new Set(["ஆத", "ஆ",],);
    },

    எதிர்மறய்ப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(new Set(["ஆத",],), பால்,);
    },

    எதிர்மறய்வினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return எதிர்மறய்வினய்முற்றுStub(new Set(["அ",],), இடம், எண்ணோபாலோ,);
    },

    வருங்காலத்துவினயெச்சம்() {
        return new Set(["அ",],);
    },

    வருங்காலத்துநிபந்தனய்வினயெச்சம்(பகுதி,) {
        return allJuxtapositions(this.வருங்காலத்துவினயெச்சம்(பகுதி,), [`${புள்ளி}இல்`, `${புள்ளி}இன்`,],);
    },

    வருங்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return allJuxtapositions(this.வருங்காலத்துவினயெச்சம்(பகுதி,), [`${புள்ளி}உம்`,],);
    },

    வருங்காலத்துப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(withOptionalஉForm(பகுதி, "வ",), பால்,);
    },

    வருங்காலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(withOptionalஉForm(பகுதி, "வ",), இடம், எண்ணோபாலோ,), this.வருங்காலத்துப்பெயரெச்சம்.bind(செய்,),);
    },

    நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return withOptionalஉForm(பகுதி, "கின்ற",).union(withOptionalஉForm(பகுதி, "கிற",),);
    },

    நிகழ்காலத்துப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(this.நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,), பால்,);
    },

    நிகழ்காலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        // You cannot use the கிறு form if followed by ன். This is especially seen in பலவின்பால், but also in more arcane forms in the other பால்s.
        return new Set(Array.from(வினய்முற்றுStub1(this.நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,),).filter(form => ! form.includes("கிற்அன",),),);
    },

    போனகாலத்துவினயெச்சம்() {
        return new Set(["து",],);
    },

    போனகாலத்துநிபந்தனய்வினயெச்சம்(பகுதி,) {
        return allJuxtapositions(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), [`${புள்ளி}ஆல்`,],).union(allJuxtapositions(this.போனகாலத்துவினயெச்சம்(பகுதி,), ["இன்", "இல்",],),);
    },

    போனகாலத்துப்பெயரெச்சம்(பகுதி,) {
        return allJuxtapositions(this.போனகாலத்துவினயெச்சம்(பகுதி,), ["அ",],);
    },

    போனகாலத்துப்பெயரெச்சத்துப்பெயர்(பகுதி, பால்,) {
        return பெயரெச்சத்துப்பெயர்Stub(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), பால்,);
    },

    போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub1(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,), () => allJuxtapositions(this.போனகாலத்துவினயெச்சம்(பகுதி,), ["இற்று",],),);
    },

    பகுதிவிகாரம்(பகுதி,) { return பகுதி; },
};

const வா = childவினயினம்(செய், "வா",);
வா.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுStub(
    () => new Set(["ஆ",],),
    () => new Set(alsoWithகள்Suffixed(["ஆரும்",],),).add("அம்மின்",),
);
வா.பகுதிவிகாரம் = (பகுதி, வினய்நிலய்,) => {
    if (வினய்நிலய்.startsWith("போனகாலத்து",)) {
        return `${lastஆMarkerShortener(பகுதி,)}ந்`;
    }
    if (வினய்நிலய் === "ஏவல்வினய்முற்று") {
        return `${lastஆMarkerShortener(பகுதி,)}${புள்ளி}`;
    }
    return `${lastஆMarkerShortener(பகுதி,)}ரு`;
};

const காண் = childவினயினம்(செய், "காண்",);
காண்.பகுதிவிகாரம் = (பகுதி, வினய்நிலய்,) => {
    if (வினய்நிலய்.startsWith("போனகாலத்து",)) {
        return lastஆMarkerShortener(பகுதி,);
    }
    return பகுதி;
};

const கடயுயிரோரசய் = childவினயினம்(செய், "கடயுயிரோரசய்",);
கடயுயிரோரசய்.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுStub(
    () => new Set(["",],),
    () => new Set(alsoWithகள்Suffixed(["உம்", "ம்",],),).add("மின்",).add("உமின்",),
);
["எதிர்மறய்த்தொழிற்பெயர்", "எதிர்மறயேவல்வினய்முற்று", "எதிர்மறய்வினயெச்சம்", "எதிர்மறய்ப்பெயரெச்சம்", "எதிர்மறய்ப்பெயரெச்சத்துப்பெயர்", "எதிர்மறய்வினய்முற்று",].forEach(செய்முறய் => adaptபகுதிMethod(கடயுயிரோரசய், செய்முறய், வடிவுகள் => new Set(Array.from(வடிவுகள்,).map(e => `கு${e}`,),),),);
["தொழிற்பெயர்", "வியங்கோள்வினய்முற்று",].forEach(செய்முறய் => adaptபகுதிMethod(கடயுயிரோரசய், செய்முறய், வடிவுகள் => new Set(Array.from(வடிவுகள்,).flatMap(e => [e, `கு${e}`,],),),),);
கடயுயிரோரசய்.வருங்காலத்துவினயெச்சம் = () => new Set(["க",],);
கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம் = பகுதி => செய்.வருங்காலத்துப்பெயரெச்சம்.call(கடயுயிரோரசய், பகுதி,).add("ம்",);
கடயுயிரோரசய்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(["வ", "குவ",], இடம், எண்ணோபாலோ,), கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம்,);

const போ = childவினயினம்(கடயுயிரோரசய், "போ",);
போ.போனகாலத்துவினயெச்சம் = () => new Set(["ய்",],);
போ.போனகாலத்துப்பெயரெச்சம் = () => new Set(["ன", "யின",],);

const நோ = childவினயினம்(கடயுயிரோரசய், "நோ",);
நோ.பகுதிவிகாரம் = (பகுதி, வினய்நிலய்,) => {
    if (வினய்நிலய்.startsWith("போனகாலத்து",)) {
        return terminalஏஓShortenerWithExtraந்(பகுதி,);
    }
    return பகுதி;
};

const சா = childவினயினம்(கடயுயிரோரசய், "சா",);
சா.பகுதிவிகாரம் = (பகுதி, வினய்நிலய்,) => {
    if (வினய்நிலய்.startsWith("போனகாலத்து",)) {
        return terminalஆtoஎconverterWithExtraத்(பகுதி,);
    }
    return பகுதி;
};

const உயர் = childவினயினம்(செய், "உயர்",);
உயர்.போனகாலத்துவினயெச்சம் = () => new Set(["ந்து",],);

const பார் = childவினயினம்(செய், "பார்",);
பார்.வியங்கோள்வினய்முற்று = () => new Set(["க்க",],);
பார்.தொழிற்பெயர் = () => new Set(["த்தல்", "க்குதல்", "ப்புதல்", "அல்", "க்கல்", "ப்பல்", "க்கய்",],);
பார்.வருங்காலத்துவினயெச்சம் = () => new Set(["க்க", "ப்ப",],);
பார்.வருங்காலத்துப்பெயரெச்சத்துப்பெயர் = (பகுதி, பால்,) => பெயரெச்சத்துப்பெயர்Stub(பார்.வருங்காலத்துவினயெச்சம்(), பால்,);
பார்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(பார்.வருங்காலத்துவினயெச்சம்(), இடம், எண்ணோபாலோ,), பார்.வருங்காலத்துப்பெயரெச்சம்.bind(பார்,),);
பார்.நிகழ்காலத்துப்பெயரெச்சம் = () => new Set(["க்கின்ற", "க்கிற",],);
பார்.போனகாலத்துவினயெச்சம் = () => new Set(["த்து",],);

const திற = childவினயினம்(பார், "திற",);
திற.போனகாலத்துவினயெச்சம் = உயர்.போனகாலத்துவினயெச்சம்;

const இடு = childவினயினம்(செய், "இடு",);
இடு.பகுதிவிகாரம் = (பகுதி, வினய்நிலய்,) => {
    if (வினய்நிலய்.startsWith("போனகாலத்து",)) {
        return `${terminalஉRemover(பகுதி,)}${புள்ளி}`;
    }
    if (வினய்நிலய் === "தொழிற்பெயர்") {
        return terminalஉRemover(பகுதி,);
    }
    return பகுதி;
};
இடு.தொழிற்பெயர் = () => new Set([`${புள்ளி}தல்`, `${உMarker}தல்`, `${உMarker}அல்`, `${உMarker}கய்`,],);

const தகு = childவினயினம்(இடு, "தகு",);
தகு.போனகாலத்துவினயெச்சம் = பகுதி => இடு.போனகாலத்துவினயெச்சம்().union(உயர்.போனகாலத்துவினயெச்சம்(பகுதி,),);

const வாங்கு = childவினயினம்(செய், "வாங்கு",);
வாங்கு.போனகாலத்துவினயெச்சம் = () => new Set(["இ",],);
வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => allJuxtapositions(வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,), ["ன",],);
வாங்கு.போனகாலத்துநிபந்தனய்வினயெச்சம் = பகுதி => allJuxtapositions(வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,), [`${புள்ளி}ஆல்`,],).union(new Set(["இன்", "இல்",],),);
வாங்கு.போனகாலத்துப்பெயரெச்சம் = பகுதி => செய்.போனகாலத்துப்பெயரெச்சம்.call(வாங்கு, பகுதி,).union(வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),);
வாங்கு.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => {
    const போனகாலத்துவினயெச்சம் = வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,);
    const intermediateForms = வினய்முற்றுStub2(["இன",], இடம், எண்ணோபாலோ,);
    if ((இடம் !== "படர்க்கய்")) {
        return intermediateForms;
    }
    if (எண்ணோபாலோ === "ஒன்றன்பால்") {
        return intermediateForms.union(allJuxtapositions(போனகாலத்துவினயெச்சம், ["அது", "ற்று",],),);
    }
    if (எண்ணோபாலோ === "பலவின்பால்") {
        return intermediateForms.symmetricDifference(allJuxtapositions(போனகாலத்துவினயெச்சம், ["ன்அன",],),).union(allJuxtapositions(போனகாலத்துவினயெச்சம், ["ன", "அன",],),);
    }
    return intermediateForms;
};

const போது = childவினயினம்(செய், "போது",);
போது.சிறப்புப்பகுதி = பகுதி => `${terminalதNasaliser(terminalஉRemover(பகுதி,),)}${புள்ளி}`;
["போனகாலத்துநிபந்தனய்வினயெச்சம்", "போனகாலத்துவினயெச்சம்", "போனகாலத்துப்பெயரெச்சம்", "போனகாலத்துவினய்முற்று",].forEach(methodName => போது[methodName] = (பகுதி, ...args) => செய்[methodName](போது.சிறப்புப்பகுதி(பகுதி,), ...args,).union(வாங்கு[methodName](பகுதி, ...args,),),);

const சொல் = childவினயினம்(வாங்கு, "சொல்",);
சொல்.போனகாலத்துநிபந்தனய்வினயெச்சம் = பகுதி => வாங்கு.போனகாலத்துநிபந்தனய்வினயெச்சம்(பகுதி,).add(`${சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,)}${புள்ளி}ஆல்`,);
சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => `${பகுதி}ந்ந`;
சொல்.போனகாலத்துப்பெயரெச்சம் = பகுதி => வாங்கு.போனகாலத்துப்பெயரெச்சம்(பகுதி,).add(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),);
சொல்.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => வினய்முற்றுStub1(new Set([சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),],), இடம், எண்ணோபாலோ,).union(வாங்கு.போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,),);

const அடிப்படய் = childவினயினம்(செய், "அடிப்படய்",);
அடிப்படய்.ஏவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்த்தொழிற்பெயர் = அடிப்படய்.எதிர்மறயேவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்வினயெச்சம் = அடிப்படய்.எதிர்மறய்ப்பெயரெச்சம் = அடிப்படய்.எதிர்மறய்ப்பெயரெச்சத்துப்பெயர் = அடிப்படய்.எதிர்மறய்வினய்முற்று = அடிப்படய்.வருங்காலத்துநிபந்தனய்வினயெச்சம் = அடிப்படய்.போனகாலத்துநிபந்தனய்வினயெச்சம் = emptySetGenerator;
அடிப்படய்.வருங்காலத்துப்பெயரெச்சத்துப்பெயர் = அடிப்படய்.நிகழ்காலத்துப்பெயரெச்சத்துப்பெயர் = அடிப்படய்.போனகாலத்துப்பெயரெச்சத்துப்பெயர் = function (பகுதி, பால்,) { return பெயரெச்சத்துப்பெயர்Stub(this.சிறப்புப்பெயரெச்சம்(பகுதி,), பால்,); };
அடிப்படய்.போனகாலத்துவினய்முற்று = அடிப்படய்.வருங்காலத்துவினய்முற்று = அடிப்படய்.நிகழ்காலத்துவினய்முற்று = function (பகுதி, இடம், எண்ணோபாலோ,) { return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, வினய்முற்றுStub2(this.சிறப்புப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,), () => new Set(["ந்து",],),).add(this.சிறப்புவினய்முற்று(பகுதி,),); };

const உள் = childவினயினம்(அடிப்படய், "உள்",);
உள்.தொழிற்பெயர் = () => new Set(["உதல்", "அல்", "மய்",],);
உள்.வருங்காலத்துவினயெச்சம் = உள்.போனகாலத்துவினயெச்சம் = emptySetGenerator;
உள்.வருங்காலத்துப்பெயரெச்சம் = உள்.நிகழ்காலத்துப்பெயரெச்சம் = உள்.போனகாலத்துப்பெயரெச்சம் = () => new Set(["அ",],);
உள்.சிறப்புப்பெயரெச்சம் = () => new Set(["அ",],);
உள்.சிறப்புவினய்முற்று = () => "ந்து";

const இல் = childவினயினம்(அடிப்படய், "இல்",);
இல்.வியங்கோள்வினய்முற்று = emptySetGenerator;
இல்.தொழிற்பெயர் = () => new Set(["மய்", "ஆமய்",],);
இல்.வருங்காலத்துவினயெச்சம் = இல்.போனகாலத்துவினயெச்சம் = () => new Set(["ஆ", "ஆது", "ஆமல்", "ந்தி",],);
இல்.வருங்காலத்துப்பெயரெச்சம் = இல்.நிகழ்காலத்துப்பெயரெச்சம் = இல்.போனகாலத்துப்பெயரெச்சம் = () => new Set(["ஆ", "ஆத",],);
இல்.சிறப்புப்பெயரெச்சம் = () => new Set(["அ", "ஆத",],);
இல்.சிறப்புவினய்முற்று = () => "அய்";

const அல் = childவினயினம்(அடிப்படய், "அல்",);
அல்.தொழிற்பெயர் = () => new Set(["அல்", "மய்", "ஆமய்",],);
அல்.வியங்கோள்வினய்முற்று = emptySetGenerator;
அல்.வருங்காலத்துநிபந்தனய்வினயெச்சம் = () => new Set(["இல்", "இன்",],);
அல்.போனகாலத்துநிபந்தனய்வினயெச்சம் = () => அல்.வருங்காலத்துநிபந்தனய்வினயெச்சம்().add("ஆல்",);
அல்.வருங்காலத்துவினயெச்சம் = அல்.போனகாலத்துவினயெச்சம் = () => new Set(["ஆ", "ஆது", "ஆமல்", "ந்தி", "த்து",],);
அல்.வருங்காலத்துப்பெயரெச்சம் = அல்.நிகழ்காலத்துப்பெயரெச்சம் = அல்.போனகாலத்துப்பெயரெச்சம் = () => new Set(["ஆ", "ஆத", "த்த",],);
அல்.சிறப்புப்பெயரெச்சம் = () => new Set(["அ", "ஆத", "த்த",],);
அல்.சிறப்புவினய்முற்று = () => "அ";

export { செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், திற, இடு, தகு, வாங்கு, போது, அல், இல், உள், };

const வினயினங்கள் = [செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், திற, இடு, தகு, வாங்கு, போது, அல், உள், இல்,];

export const வினயினம்Byபெயர் = இனத்துப்பெயர் => வினயினங்கள்.find(e => e.இனத்துப்பெயர் === இனத்துப்பெயர்,) ?? (() => { throw new Error(`“${இனத்துப்பெயர்}” எனும் வினயினம் செல்லாதது.`,); })();
