import { புள்ளி, vowelsAndMarkersOtherThanஅஆ, ஆLetter, ஆMarker, உMarker, ஏLetter, ஏMarker, ஓLetter, ஓMarker, ண்ன்ள்ல்ர்ழ், இடயினம், உLetter, } from "./ezuttu.js";
import { terminalஏஓShortener, lastஆShortener, terminalஉRemover, terminalஆtoஎconverter, terminalதNasaliser, } from "./punarcci.js";

const ஏவல்வினய்முற்றுGenerator = (ஒருமய்Generator, பன்மய்Generator,) => (பகுதி, எண்,) => {
    if (எண் === "ஒருமய்") {
        return ஒருமய்Generator(பகுதி,);
    }
    if (எண் === "பன்மய்") {
        return பன்மய்Generator(பகுதி,);
    }
    throw new Error(`Invalid எண்: ${எண்}`,);
};

const allJuxtapositions = (prefixes, suffixes,) => suffixes.reduce(
    (acc, suffix,) => new Set([...prefixes.values().map(prefix => `${prefix}${புள்ளி}${suffix}`,),],).union(acc,),
    new Set([],),
);

const வினய்முற்றுstubGenerator = (தன்னொருமய், தற்பன்மய், முன்னொருமய், முற்பன்மய், ஆண்பால், பெண்பால், பலர்பால், ஒன்றன்பால், பலவின்பால்,) => (prefixes, இடம், எண்ணோபாலோ,) => {
    if (இடம் === "தன்மய்") {
        if (எண்ணோபாலோ === "ஒருமய்") {
            return allJuxtapositions(prefixes, தன்னொருமய்,);
        }
        if (எண்ணோபாலோ === "பன்மய்") {
            return allJuxtapositions(prefixes, தற்பன்மய்,);
        }
        throw new Error(`Invalid எண்ணோபாலோ: ${எண்ணோபாலோ}`,);
    }
    if (இடம் === "முன்னிலய்") {
        if (எண்ணோபாலோ === "ஒருமய்") {
            return allJuxtapositions(prefixes, முன்னொருமய்,);
        }
        if (எண்ணோபாலோ === "பன்மய்") {
            return allJuxtapositions(prefixes, முற்பன்மய்,);
        }
        throw new Error(`Invalid எண்ணோபாலோ: ${எண்ணோபாலோ}`,);
    }
    if (இடம் === "படர்க்கய்") {
        if (எண்ணோபாலோ === "ஆண்பால்") {
            return allJuxtapositions(prefixes, ஆண்பால்,);
        }
        if (எண்ணோபாலோ === "பெண்பால்") {
            return allJuxtapositions(prefixes, பெண்பால்,);
        }
        if (எண்ணோபாலோ === "பலர்பால்") {
            return allJuxtapositions(prefixes, பலர்பால்,);
        }
        if (எண்ணோபாலோ === "ஒன்றன்பால்") {
            return allJuxtapositions(prefixes, ஒன்றன்பால்,);
        }
        if (எண்ணோபாலோ === "பலவின்பால்") {
            return allJuxtapositions(prefixes, பலவின்பால்,);
        }
        throw new Error(`Invalid எண்ணோபாலோ: ${எண்ணோபாலோ}`,);
    }
    throw new Error(`Invalid இடம்: ${இடம்}`,);
};

const வினய்முற்றுstub1 = வினய்முற்றுstubGenerator(["ஏன்",], ["ஓம்",], ["ஆய்",], ["ஈர்",], ["ஆன்", "அனன்",], ["ஆள்", "அனள்",], ["ஆர்", "அனர்",], ["அது",], ["அன",],);
const வினய்முற்றுstub2 = வினய்முற்றுstubGenerator(["ஏன்",], ["ஓம்",], ["ஆய்",], ["ஈர்",], ["ஆன்", "அன்",], ["ஆள்", "அள்",], ["ஆர்", "அர்",], ["அது",], ["அன",],);
const எதிர்மறய்வினய்முற்றுstub = வினய்முற்றுstubGenerator(["ஏன்",], ["ஓம்",], ["ஆய்",], ["ஈர்",], ["ஆன்",], ["ஆள்",], ["ஆர்",], ["ஆது",], ["ஆ",],);

const withExtraFormForஒன்றன்பால் = (பகுதி, இடம், எண்ணோபாலோ, prefixes, baseFormGenerator, extraFormGenerator,) => {
    const intermediateForms = baseFormGenerator(prefixes, இடம், எண்ணோபாலோ,);
    if ((இடம் !== "படர்க்கய்") || (எண்ணோபாலோ !== "ஒன்றன்பால்")) {
        return intermediateForms;
    }
    return extraFormGenerator(பகுதி,).union(intermediateForms,);
};

const withOptionalஉForm = (பகுதி, remainder,) => new Set([`${பகுதி}${remainder}`,],).union((() => {
    if (! ண்ன்ள்ல்ர்ழ்.some(suffix => பகுதி.endsWith(suffix,),)) {
        return new Set([],);
    }
    return new Set([`${பகுதி}உ${remainder}`,],);
})(),);

/* eslint-disable class-methods-use-this -- We override these methods in instance வினயினம்s in creative ways that making these static disallows us from doing */

class வினயினம் {
    constructor(இனத்துப்பெயர்,) {
        this.இனத்துப்பெயர் = இனத்துப்பெயர்;
    }

    பகுதி(பகுதி,) {
        return பகுதி;
    }

    valid() {
        return true;
    }

    ஏவல்வினய்முற்று(பகுதி, எண்,) {
        return ஏவல்வினய்முற்றுGenerator(
            பகுதி_ => withOptionalஉForm(பகுதி_, "",),
            பகுதி_ => new Set([`${பகுதி_}உம்`,],),
        )(பகுதி, எண்,);
    }

    போனகாலத்துவினயெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}து`,],);
    }

    போனகாலத்துப்பெயரெச்சம்(பகுதி,) {
        return new Set(this.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}அ`,),);
    }

    நிபந்தனய்வினயெச்சம்(பகுதி,) {
        return new Set(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,).values().map(val => `${val}${புள்ளி}ஆல்`,),);
    }

    எதிர்மறய்நிபந்தனய்வினயெச்சம்(பகுதி,) {
        return new Set(this.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}இனும்`,),);
    }

    போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return வினய்முற்றுstub1(this.போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,);
    }

    எதிர்மறய்வினயெச்சம்() {
        return new Set();
    }

    எதிர்மறய்ப்பெயரெச்சம்() {
        return new Set();
    }

    எதிர்மறய்வினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return எதிர்மறய்வினய்முற்றுstub(வினயினம்.prototype.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,);
    }

    வருங்காலத்துவினயெச்சம்(பகுதி,) {
        return new Set([`${பகுதி}அ`,],);
    }

    வருங்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return new Set(this.வருங்காலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}${புள்ளி}உம்`,),);
    }

    வருங்காலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        return withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, withOptionalஉForm(பகுதி, "வ",), வினய்முற்றுstub2, this.வருங்காலத்துப்பெயரெச்சம்.bind(this,),);
    }

    வியங்கோள்வினய்முற்று(பகுதி,) {
        return withOptionalஉForm(பகுதி, "க",);
    }

    தொழிற்பெயர்(பகுதி,) {
        if (! ண்ன்ள்ல்ர்ழ்.some(suffix => பகுதி.endsWith(suffix,),)) {
            return new Set([`${பகுதி}தல்`, `${பகுதி}அல்`,],);
        }
        if (! ["ள்", "ல்",].some(suffix => பகுதி.endsWith(suffix,),)) {
            return new Set([`${பகுதி}தல்`, `${பகுதி}உதல்`, `${பகுதி}அல்`,],);
        }
        return new Set([`${பகுதி}த்தல்`, `${பகுதி}உதல்`, `${பகுதி}அல்`,],);
    }

    நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,) {
        return withOptionalஉForm(பகுதி, "கின்ற",).union(withOptionalஉForm(பகுதி, "கிற",),);
    }

    நிகழ்காலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,) {
        // You cannot use the கிறு form if followed by ன். This is especially seen in பலவின்பால், but also in more arcane forms in the other பால்s.
        return new Set(Array.from(வினய்முற்றுstub1(this.நிகழ்காலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,),).filter(form => ! form.includes("கிற்அன",),),);
    }
}

/* eslint-enable class-methods-use-this */

const செய் = new வினயினம்("செய்",);

const வா = new வினயினம்("வா",);
வா.பகுதி = பகுதி => `${lastஆShortener(பகுதி,)}ரு`;
வா.valid = பகுதி => [ஆLetter, ஆMarker,].includes(பகுதி[பகுதி.length - 1],);
வா.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுGenerator(
    பகுதி => new Set([`${பகுதி.replace("ரு", "",)}${புள்ளி}ஆ`,],),
    பகுதி => new Set([`${பகுதி.replace("ரு", "",)}${புள்ளி}ஆரும்`,],),
);
வா.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி.replace("ரு", "",)}ந்து`,],);

const காண் = new வினயினம்("காண்",);
காண்.valid = பகுதி => ["ாண்", "ான்", "ஆண்", "ஆன்",].some(suffix => பகுதி.endsWith(suffix,),);
காண்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${lastஆShortener(பகுதி,)}து`,],);

const கடயுயிரோரசய் = new வினயினம்("கடயுயிரோரசய்",);
கடயுயிரோரசய்.ஏவல்வினய்முற்று = ஏவல்வினய்முற்றுGenerator(
    பகுதி => new Set([பகுதி,],),
    பகுதி => new Set([`${பகுதி}உம்`, `${பகுதி}ம்`,],),
);
கடயுயிரோரசய்.எதிர்மறய்வினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => எதிர்மறய்வினய்முற்றுstub(கடயுயிரோரசய்.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,);
கடயுயிரோரசய்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}க`,],);
கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம் = function (பகுதி,) {
    return வினயினம்.prototype.வருங்காலத்துப்பெயரெச்சம்.bind(கடயுயிரோரசய்,)(பகுதி,).union(new Set([`${பகுதி}ம்`,],),);
};
கடயுயிரோரசய்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, [`${பகுதி}வ`, `${பகுதி}குவ`,], வினய்முற்றுstub2, கடயுயிரோரசய்.வருங்காலத்துப்பெயரெச்சம்.bind(கடயுயிரோரசய்,),);
கடயுயிரோரசய்.வியங்கோள்வினய்முற்று = பகுதி => new Set([`${பகுதி}க`, `${பகுதி}குக`,],);
கடயுயிரோரசய்.தொழிற்பெயர் = பகுதி => வினயினம்.prototype.தொழிற்பெயர்(`${பகுதி}கு`,).union(வினயினம்.prototype.தொழிற்பெயர்(பகுதி,),);

const போ = Object.create(கடயுயிரோரசய்,);
போ.இனத்துப்பெயர் = "போ";
போ.valid = பகுதி => [ஆLetter, ஆMarker, ஓLetter, ஓMarker,].includes(பகுதி[பகுதி.length - 1],);
போ.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ய்`,],);
போ.போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}ன`, `${பகுதி}யின`,],);
போ.போனகாலத்துவினய்முற்று = function (பகுதி, இடம், எண்ணோபாலோ,) {
    if ((இடம் !== "படர்க்கய்") || (எண்ணோபாலோ !== "ஒன்றன்பால்")) {
        return கடயுயிரோரசய்.போனகாலத்துவினய்முற்று.call(this, பகுதி, இடம், எண்ணோபாலோ,);
    }
    return கடயுயிரோரசய்.போனகாலத்துவினய்முற்று.call(this, பகுதி, இடம், எண்ணோபாலோ,).union(new Set(போ.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}இற்று`,),),);
};

const நோ = Object.create(கடயுயிரோரசய்,);
நோ.இனத்துப்பெயர் = "நோ";
நோ.valid = பகுதி => [ஏLetter, ஏMarker, ஓLetter, ஓMarker,].includes(பகுதி[பகுதி.length - 1],);
நோ.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${terminalஏஓShortener(பகுதி,)}ந்து`,],);

const சா = Object.create(கடயுயிரோரசய்,);
சா.இனத்துப்பெயர் = "சா";
சா.valid = பகுதி => [ஆLetter, ஆMarker,].includes(பகுதி[பகுதி.length - 1],);
சா.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${terminalஆtoஎconverter(பகுதி,)}த்து`,],);

const உயர் = new வினயினம்("உயர்",);
உயர்.valid = பகுதி => {
    const lastCharacter = பகுதி[பகுதி.length - 1];
    if (vowelsAndMarkersOtherThanஅஆ.includes(lastCharacter,)) {
        return true;
    }
    if (புள்ளி !== lastCharacter) {
        return false;
    }
    if (! இடயினம்.includes(பகுதி[பகுதி.length - 2],)) {
        return false;
    }
    return true;
};
உயர்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ந்து`,],);

const பார் = new வினயினம்("பார்",);
பார்.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}த்து`,],);
பார்.எதிர்மறய்வினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => எதிர்மறய்வினய்முற்றுstub(பார்.வருங்காலத்துவினயெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,).union(வினயினம்.prototype.எதிர்மறய்வினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,),);
பார்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}க்க`,],);
பார்.வருங்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, [`${பகுதி}ப்ப`,], வினய்முற்றுstub2, பார்.வருங்காலத்துப்பெயரெச்சம்.bind(பார்,),);
பார்.வியங்கோள்வினய்முற்று = பகுதி => new Set([`${பகுதி}க்க`,],);
பார்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}த்தல்`, `${பகுதி}க்கல்`, `${பகுதி}அல்`,],);
பார்.நிகழ்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}க்கின்ற`, `${பகுதி}க்கிற`,],);

const திற = Object.create(பார்,);
திற.இனத்துப்பெயர் = "திற";
திற.போனகாலத்துவினயெச்சம் = உயர்.போனகாலத்துவினயெச்சம்;

const இடு = new வினயினம்("இடு",);
இடு.valid = பகுதி => ["கு", "டு", "று",].some(suffix => பகுதி.endsWith(suffix,),);
இடு.போனகாலத்துவினயெச்சம் = பகுதி => new Set([
    பகுதி.replace(
        RegExp(`(.)${உMarker}$`, "v",),
        `$1${புள்ளி}$1${உMarker}`,
    ),
],);
இடு.தொழிற்பெயர் = பகுதி => new Set([
    பகுதி.replace(
        RegExp(`(.)${உMarker}$`, "v",),
        `$1${புள்ளி}$1ல்`,
    ),
    `${பகுதி}உதல்`,
    `${பகுதி}அல்`,
],);

const தகு = new வினயினம்("தகு",);
தகு.valid = பகுதி => பகுதி.endsWith("கு",);
தகு.போனகாலத்துவினயெச்சம் = பகுதி => இடு.போனகாலத்துவினயெச்சம்(பகுதி,).union(உயர்.போனகாலத்துவினயெச்சம்(பகுதி,),);
தகு.தொழிற்பெயர் = இடு.தொழிற்பெயர்;

const வாங்கு = new வினயினம்("வாங்கு",);
வாங்கு.valid = பகுதி => [உLetter, உMarker,].some(suffix => பகுதி.endsWith(suffix,),);
வாங்கு.போனகாலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}இ`,],);
வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set(வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}ன`,),);
வாங்கு.போனகாலத்துப்பெயரெச்சம் = function (பகுதி,) { return வினயினம்.prototype.போனகாலத்துப்பெயரெச்சம்.call(this, பகுதி,).union(வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),); };
வாங்கு.நிபந்தனய்வினயெச்சம் = பகுதி => new Set(வாங்கு.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,).values().map(val => `${val}${புள்ளி}ஆல்`,),);
வாங்கு.எதிர்மறய்நிபந்தனய்வினயெச்சம் = பகுதி => new Set(வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,).values().map(val => `${val}னும்`,),);
வாங்கு.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => {
    const போனகாலத்துவினயெச்சம் = வாங்கு.போனகாலத்துவினயெச்சம்(பகுதி,);
    const intermediateForms = வினய்முற்றுstub2([`${பகுதி}இன`,], இடம், எண்ணோபாலோ,);
    if ((இடம் !== "படர்க்கய்")) {
        return intermediateForms;
    }
    if (எண்ணோபாலோ === "ஒன்றன்பால்") {
        return intermediateForms.union(new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}அது`,),),).union(new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}ற்று`,),),);
    }
    if (எண்ணோபாலோ === "பலவின்பால்") {
        return intermediateForms.symmetricDifference(new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}ன்அன`,),),).union(new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}ன`,),),).union(new Set(போனகாலத்துவினயெச்சம்.values().map(val => `${val}அன`,),),);
    }
    return intermediateForms;
};

const போது = new வினயினம்("போது",);
போது.valid = பகுதி => பகுதி.endsWith("து",);
போது.சிறப்புப்பகுதி = பகுதி => `${terminalதNasaliser(terminalஉRemover(பகுதி,),)}${புள்ளி}`;
const வினயினம்Unionவாங்கு = methodName => (பகுதி, ...args) => வினயினம்.prototype[methodName](போது.சிறப்புப்பகுதி(பகுதி,), ...args,).union(வாங்கு[methodName](பகுதி, ...args,),);
போது.போனகாலத்துவினயெச்சம் = வினயினம்Unionவாங்கு("போனகாலத்துவினயெச்சம்",);
போது.போனகாலத்துப்பெயரெச்சம் = வினயினம்Unionவாங்கு("போனகாலத்துப்பெயரெச்சம்",);
போது.நிபந்தனய்வினயெச்சம் = வினயினம்Unionவாங்கு("நிபந்தனய்வினயெச்சம்",);
போது.எதிர்மறய்நிபந்தனய்வினயெச்சம் = வினயினம்Unionவாங்கு("எதிர்மறய்நிபந்தனய்வினயெச்சம்",);
போது.போனகாலத்துவினய்முற்று = வினயினம்Unionவாங்கு("போனகாலத்துவினய்முற்று",);

const சொல் = Object.create(வாங்கு,);
சொல்.இனத்துப்பெயர் = "சொல்";
சொல்.valid = பகுதி => ["ள்", "ல்",].some(suffix => பகுதி.endsWith(suffix,),);
சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}ந்ந`,],);
சொல்.போனகாலத்துப்பெயரெச்சம் = பகுதி => வாங்கு.போனகாலத்துப்பெயரெச்சம்(பகுதி,).union(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,),);
சொல்.நிபந்தனய்வினயெச்சம் = பகுதி => வாங்கு.நிபந்தனய்வினயெச்சம்(பகுதி,).union(new Set(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,).values().map(val => `${val}${புள்ளி}ஆல்`,),),);
சொல்.போனகாலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => வினய்முற்றுstub1(சொல்.சிறப்புப்போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,).union(வாங்கு.போனகாலத்துவினய்முற்று(பகுதி, இடம், எண்ணோபாலோ,),);

const emptySetGenerator = () => new Set([],);

const அடிப்படய் = new வினயினம்("அடிப்படய்",);
அடிப்படய்.ஏவல்வினய்முற்று = அடிப்படய்.எதிர்மறய்வினய்முற்று = அடிப்படய்.நிபந்தனய்வினயெச்சம் = அடிப்படய்.எதிர்மறய்நிபந்தனய்வினயெச்சம் = அடிப்படய்.தொழிற்பெயர் = emptySetGenerator;
அடிப்படய்.நிகழ்காலத்துப்பெயரெச்சம் = அடிப்படய்.வருங்காலத்துப்பெயரெச்சம் = அடிப்படய்.போனகாலத்துப்பெயரெச்சம்;

const அல் = Object.create(அடிப்படய்,);
அல்.இனத்துப்பெயர் = "அல்";
அல்.valid = பகுதி => பகுதி === "அல்";
அல்.போனகாலத்துவினயெச்சம் = அல்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}த்து`, `${பகுதி}ஆது`,],);
அல்.நிபந்தனய்வினயெச்சம் = பகுதி => new Set([`${பகுதி}ஆல்`,],);
அல்.போனகாலத்துவினய்முற்று = அல்.வருங்காலத்துவினய்முற்று = அல்.நிகழ்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => வினய்முற்றுstub1(அல்.போனகாலத்துப்பெயரெச்சம்(பகுதி,), இடம், எண்ணோபாலோ,);
அல்.வியங்கோள்வினய்முற்று = emptySetGenerator;

const இல் = Object.create(அடிப்படய்,);
இல்.இனத்துப்பெயர் = "இல்";
இல்.valid = பகுதி => பகுதி === "இல்";
இல்.போனகாலத்துவினயெச்சம் = இல்.வருங்காலத்துவினயெச்சம் = பகுதி => new Set([`${பகுதி}ஆது`,],);
இல்.போனகாலத்துவினய்முற்று = இல்.வருங்காலத்துவினய்முற்று = இல்.நிகழ்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => வினய்முற்றுstub1(new Set([`${பகுதி}அ`,],), இடம், எண்ணோபாலோ,);
இல்.வியங்கோள்வினய்முற்று = emptySetGenerator;

const உள் = Object.create(அடிப்படய்,);
உள்.இனத்துப்பெயர் = "உள்";
உள்.valid = பகுதி => பகுதி === "உள்";
உள்.போனகாலத்துவினயெச்சம் = உள்.வருங்காலத்துவினயெச்சம் = உள்.போனகாலத்துப்பெயரெச்சம் = உள்.போனகாலத்துவினய்முற்று = emptySetGenerator;
உள்.நிகழ்காலத்துப்பெயரெச்சம் = உள்.வருங்காலத்துப்பெயரெச்சம் = பகுதி => new Set([`${பகுதி}அ`,],);
உள்.வருங்காலத்துவினய்முற்று = உள்.நிகழ்காலத்துவினய்முற்று = (பகுதி, இடம், எண்ணோபாலோ,) => withExtraFormForஒன்றன்பால்(பகுதி, இடம், எண்ணோபாலோ, new Set([`${பகுதி}அ`,],), வினய்முற்றுstub1, உயர்.போனகாலத்துவினயெச்சம்,);
உள்.தொழிற்பெயர் = பகுதி => new Set([`${பகுதி}உதல்`, `${பகுதி}அல்`,],);

export { செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், திற, இடு, தகு, வாங்கு, போது, அல், இல், உள், };

const வினயினங்கள் = [செய், வா, காண், போ, நோ, சா, உயர், சொல், பார், திற, இடு, தகு, வாங்கு, போது, அல், உள், இல்,];
export const வினயினத்துப்பெயர்கள் = வினயினங்கள்.map(வினயினம்_ => வினயினம்_.இனத்துப்பெயர்,);
export const validவினயினத்துப்பெயர்கள் = பகுதி => வினயினங்கள்.filter(வினயினம்_ => வினயினம்_.valid(பகுதி,),).map(வினயினம்_ => வினயினம்_.இனத்துப்பெயர்,);

export const வினயினம்Byபெயர் = இனத்துப்பெயர் => {
    const வினயினம்Option = வினயினங்கள்.find(e => e.இனத்துப்பெயர் === இனத்துப்பெயர்,);

    if (! வினயினம்Option) {
        throw new Error(`Unknown வினயினம் ${இனத்துப்பெயர்}.`,);
    }

    return வினயினம்Option;
};
